// Size: 0xb8
class UAIGraph : public UEdGraph {
    /* 0x00b0 */ int32_t GraphVersion;
};

// Size: 0x168
class UAIGraphNode : public UEdGraphNode {
    /* 0x00c8 */ FGraphNodeClassData ClassData;
    /* 0x0130 */ UObject* NodeInstance;
    /* 0x0138 */ UAIGraphNode* ParentNode;
    /* 0x0140 */ TArray<UAIGraphNode*> SubNodes;
    /* 0x0150 */ int32_t CopySubNodeIndex;
    /* 0x0154 */ bool bIsReadOnly;
    /* 0x0154 */ bool bIsSubNode;
    /* 0x0158 */ FString ErrorMessage;
};

// Size: 0x30
class UAIGraphSchema : public UEdGraphSchema {
};

// Size: 0x100
struct FAISchemaAction_AddComment : public FEdGraphSchemaAction {
};

// Size: 0x108
struct FAISchemaAction_NewNode : public FEdGraphSchemaAction {
    /* 0x0100 */ UAIGraphNode* NodeTemplate;
};

// Size: 0x110
struct FAISchemaAction_NewSubNode : public FEdGraphSchemaAction {
    /* 0x0100 */ UAIGraphNode* NodeTemplate;
    /* 0x0108 */ UAIGraphNode* ParentNode;
};

// Size: 0x68
struct FGraphNodeClassData {
    /* 0x0010 */ FString AssetName;
    /* 0x0020 */ FString GeneratedClassPackage;
    /* 0x0030 */ FString ClassName;
    /* 0x0040 */ FText Category;
};

// Size: 0xf8
class UK2Node_AIMoveTo : public UK2Node_BaseAsyncTask {
};

// Size: 0x70
class UAIAsyncTaskBlueprintProxy : public UObject {
    /* 0x0030 */ FMulticastInlineDelegate OnSuccess;
    /* 0x0040 */ FMulticastInlineDelegate OnFail;

    void OnMoveCompleted(FAIRequestID RequestID, uint8_t MovementResult);
};

// Size: 0x30
class UAIBlueprintHelperLibrary : public UBlueprintFunctionLibrary {

    static UAIAsyncTaskBlueprintProxy* CreateMoveToProxyObject(UObject* WorldContextObject, APawn* Pawn, FVector Destination, AActor* TargetActor, float AcceptanceRadius, bool bStopOnOverlap);
    static AAIController* GetAIController(AActor* ControlledActor);
    static UBlackboardComponent* GetBlackboard(AActor* Target);
    static UNavigationPath* GetCurrentPath(AController* Controller);
    static int32_t GetCurrentPathIndex(const AController* Controller);
    static TArray<FVector> GetCurrentPathPoints(AController* Controller);
    static int32_t GetNextNavLinkIndex(const AController* Controller);
    static bool IsValidAIDirection(FVector DirectionVector);
    static bool IsValidAILocation(FVector Location);
    static bool IsValidAIRotation(FRotator Rotation);
    static void LockAIResourcesWithAnimation(UAnimInstance* AnimInstance, bool bLockMovement, bool LockAILogic);
    static void SendAIMessage(APawn* Target, FName Message, UObject* MessageSource, bool bSuccess);
    static void SimpleMoveToActor(AController* Controller, const AActor* Goal);
    static void SimpleMoveToLocation(AController* Controller, const FVector& Goal);
    static APawn* SpawnAIFromClass(UObject* WorldContextObject, UClass* PawnClass, UBehaviorTree* BehaviorTree, FVector Location, FRotator Rotation, bool bNoCollisionFail, AActor* Owner);
    static void UnlockAIResourcesWithAnimation(UAnimInstance* AnimInstance, bool bUnlockMovement, bool UnlockAILogic);
};

// Size: 0x408
class AAIController : public AController {
    /* 0x03b0 */ bool bStartAILogicOnPossess;
    /* 0x03b0 */ bool bStopAILogicOnUnposses;
    /* 0x03b0 */ bool bLOSflag;
    /* 0x03b0 */ bool bSkipExtraLOSChecks;
    /* 0x03b0 */ bool bAllowStrafe;
    /* 0x03b0 */ bool bWantsPlayerState;
    /* 0x03b0 */ bool bSetControlRotationFromPawnOrientation;
    /* 0x03b8 */ UPathFollowingComponent* PathFollowingComponent;
    /* 0x03c0 */ UBrainComponent* BrainComponent;
    /* 0x03c8 */ UAIPerceptionComponent* PerceptionComponent;
    /* 0x03d0 */ UPawnActionsComponent* ActionsComp;
    /* 0x03d8 */ UBlackboardComponent* Blackboard;
    /* 0x03e0 */ UGameplayTasksComponent* CachedGameplayTasksComponent;
    /* 0x03e8 */ UClass* DefaultNavigationFilterClass;
    /* 0x03f0 */ FMulticastInlineDelegate ReceiveMoveCompleted;

    void ClaimTaskResource(UClass* ResourceClass);
    UAIPerceptionComponent* GetAIPerceptionComponent();
    FVector GetFocalPoint() const;
    FVector GetFocalPointOnActor(const AActor* Actor) const;
    AActor* GetFocusActor() const;
    FVector GetImmediateMoveDestination() const;
    uint8_t GetMoveStatus() const;
    UPathFollowingComponent* GetPathFollowingComponent() const;
    bool HasPartialPath() const;
    void K2_ClearFocus();
    void K2_SetFocalPoint(FVector FP);
    void K2_SetFocus(AActor* NewFocus);
    uint8_t MoveToActor(AActor* Goal, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bCanStrafe, UClass* FilterClass, bool bAllowPartialPath);
    uint8_t MoveToLocation(const FVector& Dest, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bProjectDestinationToNavigation, bool bCanStrafe, UClass* FilterClass, bool bAllowPartialPath);
    void OnGameplayTaskResourcesClaimed(FGameplayResourceSet NewlyClaimed, FGameplayResourceSet FreshlyReleased);
    void OnUsingBlackBoard(UBlackboardComponent* BlackboardComp, UBlackboardData* BlackboardAsset);
    bool RunBehaviorTree(UBehaviorTree* BTAsset);
    void SetMoveBlockDetection(bool bEnable);
    void SetPathFollowingComponent(UPathFollowingComponent* NewPFComponent);
    void UnclaimTaskResource(UClass* ResourceClass);
    bool UseBlackboard(UBlackboardData* BlackboardAsset, UBlackboardComponent*& BlackboardComponent);
};

// Size: 0x40
struct FAIDamageEvent {
    /* 0x0000 */ float Amount;
    /* 0x0004 */ FVector Location;
    /* 0x0010 */ FVector HitLocation;
    /* 0x0020 */ AActor* DamagedActor;
    /* 0x0028 */ AActor* Instigator;
    /* 0x0030 */ FName Tag;
};

// Size: 0x30
class UAIDataProvider : public UObject {
};

// Size: 0x40
struct FAIDataProviderBoolValue : public FAIDataProviderTypedValue {
    /* 0x0038 */ bool DefaultValue;
};

// Size: 0x40
struct FAIDataProviderFloatValue : public FAIDataProviderTypedValue {
    /* 0x0038 */ float DefaultValue;
};

// Size: 0x40
struct FAIDataProviderIntValue : public FAIDataProviderTypedValue {
    /* 0x0038 */ int32_t DefaultValue;
};

// Size: 0x38
struct FAIDataProviderStructValue : public FAIDataProviderValue {
};

// Size: 0x38
struct FAIDataProviderTypedValue : public FAIDataProviderValue {
    /* 0x0028 */ UClass* PropertyType;
};

// Size: 0x28
struct FAIDataProviderValue {
    /* 0x0010 */ UAIDataProvider* DataBinding;
    /* 0x0018 */ FName DataField;
};

// Size: 0x48
class UAIDataProvider_QueryParams : public UAIDataProvider {
    /* 0x0030 */ FName ParamName;
    /* 0x003c */ float FloatValue;
    /* 0x0040 */ int32_t IntValue;
    /* 0x0044 */ bool BoolValue;
};

// Size: 0x58
class UAIDataProvider_Random : public UAIDataProvider_QueryParams {
    /* 0x0048 */ float Min;
    /* 0x004c */ float Max;
    /* 0x0050 */ bool bInteger;
};

// Size: 0x48
struct FAIDynamicParam {
    /* 0x0000 */ FName ParamName;
    /* 0x000c */ EAIParamType ParamType;
    /* 0x0010 */ float Value;
    /* 0x0018 */ FBlackboardKeySelector BBKey;
};

// Size: 0x30
class UAIHotSpotManager : public UObject {
};

// Size: 0x40
struct FAIMoveRequest {
    /* 0x0000 */ AActor* GoalActor;
};

// Size: 0x30
struct FAINoiseEvent {
    /* 0x0004 */ FVector NoiseLocation;
    /* 0x0010 */ float Loudness;
    /* 0x0014 */ float MaxRange;
    /* 0x0018 */ AActor* Instigator;
    /* 0x0020 */ FName Tag;
};

// Size: 0x1a0
class UAIPerceptionComponent : public UActorComponent {
    /* 0x00c0 */ TArray<UAISenseConfig*> SensesConfig;
    /* 0x00d0 */ UClass* DominantSense;
    /* 0x00e8 */ AAIController* AIOwner;
    /* 0x0170 */ FMulticastInlineDelegate OnPerceptionUpdated;
    /* 0x0180 */ FMulticastInlineDelegate OnTargetPerceptionUpdated;
    /* 0x0190 */ FMulticastInlineDelegate OnTargetPerceptionInfoUpdated;

    void ForgetAll();
    bool GetActorsPerception(AActor* Actor, FActorPerceptionBlueprintInfo& Info);
    void GetCurrentlyPerceivedActors(UClass* SenseToUse, TArray<AActor*>& OutActors) const;
    void GetKnownPerceivedActors(UClass* SenseToUse, TArray<AActor*>& OutActors) const;
    void GetPerceivedActors(UClass* SenseToUse, TArray<AActor*>& OutActors) const;
    void GetPerceivedHostileActors(TArray<AActor*>& OutActors) const;
    void GetPerceivedHostileActorsBySense(const UClass* SenseToUse, TArray<AActor*>& OutActors) const;
    void OnOwnerEndPlay(AActor* Actor, uint8_t EndPlayReason);
    void RequestStimuliListenerUpdate();
    void SetSenseEnabled(UClass* SenseClass, const bool bEnable);
};

// Size: 0x30
class IAIPerceptionListenerInterface : public UInterface {
};

// Size: 0xd8
class UAIPerceptionStimuliSourceComponent : public UActorComponent {
    /* 0x00c0 */ bool bAutoRegisterAsSource;
    /* 0x00c8 */ TArray<UClass*> RegisterAsSourceForSenses;

    void RegisterForSense(UClass* SenseClass);
    void RegisterWithPerceptionSystem();
    void UnregisterFromPerceptionSystem();
    void UnregisterFromSense(UClass* SenseClass);
};

// Size: 0x138
class UAIPerceptionSystem : public UAISubsystem {
    /* 0x0090 */ TArray<UAISense*> Senses;
    /* 0x00a0 */ float PerceptionAgingRate;

    static UClass* GetSenseClassForStimulus(UObject* WorldContextObject, const FAIStimulus& Stimulus);
    void OnPerceptionStimuliSourceEndPlay(AActor* Actor, uint8_t EndPlayReason);
    static bool RegisterPerceptionStimuliSource(UObject* WorldContextObject, UClass* Sense, AActor* Target);
    void ReportEvent(UAISenseEvent* PerceptionEvent);
    static void ReportPerceptionEvent(UObject* WorldContextObject, UAISenseEvent* PerceptionEvent);
};

// Size: 0x18
struct FAIPredictionEvent {
    /* 0x0000 */ AActor* Requestor;
    /* 0x0008 */ AActor* PredictedActor;
};

// Size: 0x4
struct FAIRequestID {
    /* 0x0000 */ uint32_t RequestID;
};

// Size: 0x30
class IAIResourceInterface : public UInterface {
};

// Size: 0x40
class UAIResource_Logic : public UGameplayTaskResource {
};

// Size: 0x40
class UAIResource_Movement : public UGameplayTaskResource {
};

// Size: 0x90
class UAISense : public UObject {
    /* 0x0030 */ float DefaultExpirationAge;
    /* 0x0034 */ EAISenseNotifyType NotifyType;
    /* 0x0038 */ bool bWantsNewPawnNotification;
    /* 0x0038 */ bool bAutoRegisterAllPawnsAsSources;
    /* 0x0040 */ UAIPerceptionSystem* PerceptionSystemInstance;
};

// Size: 0x4
struct FAISenseAffiliationFilter {
    /* 0x0000 */ bool bDetectEnemies;
    /* 0x0000 */ bool bDetectNeutrals;
    /* 0x0000 */ bool bDetectFriendlies;
};

// Size: 0x138
class UAISenseBlueprintListener : public UUserDefinedStruct {
};

// Size: 0x50
class UAISenseConfig : public UObject {
    /* 0x0030 */ FColor DebugColor;
    /* 0x0034 */ float MaxAge;
    /* 0x0038 */ bool bStartsEnabled;
};

// Size: 0x58
class UAISenseConfig_Blueprint : public UAISenseConfig {
    /* 0x0050 */ UClass* Implementation;
};

// Size: 0x58
class UAISenseConfig_Damage : public UAISenseConfig {
    /* 0x0050 */ UClass* Implementation;
};

// Size: 0x68
class UAISenseConfig_Hearing : public UAISenseConfig {
    /* 0x0050 */ UClass* Implementation;
    /* 0x0058 */ float HearingRange;
    /* 0x005c */ float LoSHearingRange;
    /* 0x0060 */ bool bUseLoSHearing;
    /* 0x0064 */ FAISenseAffiliationFilter DetectionByAffiliation;
};

// Size: 0x50
class UAISenseConfig_Prediction : public UAISenseConfig {
};

// Size: 0x78
class UAISenseConfig_Sight : public UAISenseConfig {
    /* 0x0050 */ UClass* Implementation;
    /* 0x0058 */ float SightRadius;
    /* 0x005c */ float LoseSightRadius;
    /* 0x0060 */ float PeripheralVisionAngleDegrees;
    /* 0x0064 */ FAISenseAffiliationFilter DetectionByAffiliation;
    /* 0x0068 */ float AutoSuccessRangeFromLastSeenLocation;
    /* 0x006c */ float PointOfViewBackwardOffset;
    /* 0x0070 */ float NearClippingRadius;
};

// Size: 0x50
class UAISenseConfig_Team : public UAISenseConfig {
};

// Size: 0x50
class UAISenseConfig_Touch : public UAISenseConfig {
};

// Size: 0x30
class UAISenseEvent : public UObject {
};

// Size: 0x70
class UAISenseEvent_Damage : public UAISenseEvent {
    /* 0x0030 */ FAIDamageEvent Event;
};

// Size: 0x60
class UAISenseEvent_Hearing : public UAISenseEvent {
    /* 0x0030 */ FAINoiseEvent Event;
};

// Size: 0xb8
class UAISense_Blueprint : public UAISense {
    /* 0x0090 */ UClass* ListenerDataType;
    /* 0x0098 */ TArray<UAIPerceptionComponent*> ListenerContainer;
    /* 0x00a8 */ TArray<UAISenseEvent*> UnprocessedEvents;

    void GetAllListenerActors(TArray<AActor*>& ListenerActors) const;
    void GetAllListenerComponents(TArray<UAIPerceptionComponent*>& ListenerComponents) const;
    void K2_OnNewPawn(APawn* NewPawn);
    void OnListenerRegistered(AActor* ActorListener, UAIPerceptionComponent* PerceptionComponent);
    void OnListenerUnregistered(AActor* ActorListener, UAIPerceptionComponent* PerceptionComponent);
    void OnListenerUpdated(AActor* ActorListener, UAIPerceptionComponent* PerceptionComponent);
    float OnUpdate(const TArray<UAISenseEvent*>& EventsToProcess);
};

// Size: 0xa0
class UAISense_Damage : public UAISense {
    /* 0x0090 */ TArray<FAIDamageEvent> RegisteredEvents;

    static void ReportDamageEvent(UObject* WorldContextObject, AActor* DamagedActor, AActor* Instigator, float DamageAmount, FVector EventLocation, FVector HitLocation, FName Tag);
};

// Size: 0xf8
class UAISense_Hearing : public UAISense {
    /* 0x0090 */ TArray<FAINoiseEvent> NoiseEvents;
    /* 0x00a0 */ float SpeedOfSoundSq;

    static void ReportNoiseEvent(UObject* WorldContextObject, FVector NoiseLocation, float Loudness, AActor* Instigator, float MaxRange, FName Tag);
};

// Size: 0xa0
class UAISense_Prediction : public UAISense {
    /* 0x0090 */ TArray<FAIPredictionEvent> RegisteredEvents;

    static void RequestControllerPredictionEvent(AAIController* Requestor, AActor* PredictedActor, float PredictionTime);
    static void RequestPawnPredictionEvent(APawn* Requestor, AActor* PredictedActor, float PredictionTime);
};

// Size: 0x180
class UAISense_Sight : public UAISense {
    /* 0x0158 */ int32_t MaxTracesPerTick;
    /* 0x015c */ int32_t MinQueriesPerTimeSliceCheck;
    /* 0x0160 */ double MaxTimeSlicePerTick;
    /* 0x0168 */ float HighImportanceQueryDistanceThreshold;
    /* 0x0170 */ float MaxQueryImportance;
    /* 0x0174 */ float SightLimitQueryImportance;
};

// Size: 0xa0
class UAISense_Team : public UAISense {
    /* 0x0090 */ TArray<FAITeamStimulusEvent> RegisteredEvents;
};

// Size: 0xa0
class UAISense_Touch : public UAISense {
    /* 0x0090 */ TArray<FAITouchEvent> RegisteredEvents;
};

// Size: 0x18
struct FAISightEvent {
    /* 0x0008 */ AActor* SeenActor;
    /* 0x0010 */ AActor* Observer;
};

// Size: 0x30
class IAISightTargetInterface : public UInterface {
};

// Size: 0x44
struct FAIStimulus {
    /* 0x0000 */ float Age;
    /* 0x0004 */ float ExpirationAge;
    /* 0x0008 */ float Strength;
    /* 0x000c */ FVector StimulusLocation;
    /* 0x0018 */ FVector ReceiverLocation;
    /* 0x0024 */ FName Tag;
    /* 0x0040 */ bool bSuccessfullySensed;
};

// Size: 0x40
class UAISubsystem : public UObject {
    /* 0x0038 */ UAISystem* AISystem;
};

// Size: 0x158
class UAISystem : public UAISystemBase {
    /* 0x0070 */ FSoftClassPath PerceptionSystemClassName;
    /* 0x0090 */ FSoftClassPath HotSpotManagerClassName;
    /* 0x00b0 */ float AcceptanceRadius;
    /* 0x00b4 */ float PathfollowingRegularPathPointAcceptanceRadius;
    /* 0x00b8 */ float PathfollowingNavLinkAcceptanceRadius;
    /* 0x00bc */ bool bFinishMoveOnGoalOverlap;
    /* 0x00bd */ bool bAcceptPartialPaths;
    /* 0x00be */ bool bAllowStrafing;
    /* 0x00bf */ bool bEnableBTAITasks;
    /* 0x00c0 */ bool bAllowControllersAsEQSQuerier;
    /* 0x00c1 */ bool bEnableDebuggerPlugin;
    /* 0x00c2 */ bool bForgetStaleActors;
    /* 0x00c3 */ bool bAddBlackboardSelfKey;
    /* 0x00c4 */ uint8_t DefaultSightCollisionChannel;
    /* 0x00c8 */ UBehaviorTreeManager* BehaviorTreeManager;
    /* 0x00d0 */ UEnvQueryManager* EnvironmentQueryManager;
    /* 0x00d8 */ UAIPerceptionSystem* PerceptionSystem;
    /* 0x00e0 */ TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects;
    /* 0x00f0 */ UAIHotSpotManager* HotSpotManager;
    /* 0x00f8 */ UNavLocalGridManager* NavLocalGrids;

    void AIIgnorePlayers();
    void AILoggingVerbose();
};

// Size: 0x88
class UAITask : public UGameplayTask {
    /* 0x0080 */ AAIController* OwnerController;
};

// Size: 0x88
class UAITask_LockLogic : public UAITask {
};

// Size: 0x128
class UAITask_MoveTo : public UAITask {
    /* 0x0088 */ FMulticastInlineDelegate OnRequestFailed;
    /* 0x0098 */ FMulticastInlineDelegate OnMoveFinished;
    /* 0x00a8 */ FAIMoveRequest MoveRequest;

    static UAITask_MoveTo* AIMoveTo(AAIController* Controller, FVector GoalLocation, AActor* GoalActor, float AcceptanceRadius, uint8_t StopOnOverlap, uint8_t AcceptPartialPath, bool bUsePathfinding, bool bLockAILogic, bool bUseContinuosGoalTracking, uint8_t ProjectGoalOnNavigation);
};

// Size: 0x108
class UAITask_RunEQS : public UAITask {

    static UAITask_RunEQS* RunEQS(AAIController* Controller, UEnvQuery* QueryTemplate);
};

// Size: 0x38
struct FAITeamStimulusEvent {
    /* 0x0028 */ AActor* Broadcaster;
    /* 0x0030 */ AActor* Enemy;
};

// Size: 0x20
struct FAITouchEvent {
    /* 0x0010 */ AActor* TouchReceiver;
    /* 0x0018 */ AActor* OtherActor;
};

// Size: 0x20
struct FActorPerceptionBlueprintInfo {
    /* 0x0000 */ AActor* Target;
    /* 0x0008 */ TArray<FAIStimulus> LastSensedStimuli;
    /* 0x0018 */ bool bIsHostile;
};

// Size: 0x50
struct FActorPerceptionUpdateInfo {
    /* 0x0000 */ int32_t TargetId;
    /* 0x0004 */ TWeakObjectPtr<AActor> Target;
    /* 0x000c */ FAIStimulus Stimulus;
};

// Size: 0x70
class UBTAuxiliaryNode : public UBTNode {
};

// Size: 0x30
struct FBTCompositeChild {
    /* 0x0000 */ UBTCompositeNode* ChildComposite;
    /* 0x0008 */ UBTTaskNode* ChildTask;
    /* 0x0010 */ TArray<UBTDecorator*> Decorators;
    /* 0x0020 */ TArray<FBTDecoratorLogic> DecoratorOps;
};

// Size: 0xa0
class UBTCompositeNode : public UBTNode {
    /* 0x0068 */ TArray<FBTCompositeChild> Children;
    /* 0x0078 */ TArray<UBTService*> Services;
    /* 0x0098 */ bool bApplyDecoratorScope;
};

// Size: 0xa0
class UBTComposite_Selector : public UBTCompositeNode {
};

// Size: 0xa0
class UBTComposite_Sequence : public UBTCompositeNode {
};

// Size: 0xa8
class UBTComposite_SimpleParallel : public UBTCompositeNode {
    /* 0x00a0 */ uint8_t FinishMode;
};

// Size: 0x78
class UBTDecorator : public UBTAuxiliaryNode {
    /* 0x0070 */ bool bInverseCondition;
    /* 0x0074 */ uint8_t FlowAbortMode;
};

// Size: 0x4
struct FBTDecoratorLogic {
    /* 0x0000 */ uint8_t Operation;
    /* 0x0002 */ uint16_t Number;
};

// Size: 0xd8
class UBTDecorator_Blackboard : public UBTDecorator_BlackboardBase {
    /* 0x00a8 */ int32_t IntValue;
    /* 0x00ac */ float FloatValue;
    /* 0x00b0 */ FString StringValue;
    /* 0x00c0 */ FString CachedDescription;
    /* 0x00d0 */ uint8_t OperationType;
    /* 0x00d1 */ uint8_t NotifyObserver;
    /* 0x00d2 */ uint8_t BasicOperation;
    /* 0x00d3 */ uint8_t ArithmeticOperation;
    /* 0x00d4 */ uint8_t TextOperation;
};

// Size: 0xa8
class UBTDecorator_BlackboardBase : public UBTDecorator {
    /* 0x0078 */ FBlackboardKeySelector BlackboardKey;
};

// Size: 0xc0
class UBTDecorator_BlueprintBase : public UBTDecorator {
    /* 0x0078 */ AAIController* AIOwner;
    /* 0x0080 */ AActor* ActorOwner;
    /* 0x0088 */ TArray<FName> ObservedKeyNames;
    /* 0x00a8 */ FString CustomDescription;
    /* 0x00b8 */ bool bShowPropertyDetails;
    /* 0x00b8 */ bool bCheckConditionOnlyBlackBoardChanges;
    /* 0x00b8 */ bool bIsObservingBB;

    bool IsDecoratorExecutionActive() const;
    bool IsDecoratorObserverActive() const;
    bool PerformConditionCheck(AActor* OwnerActor);
    bool PerformConditionCheckAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveExecutionFinish(AActor* OwnerActor, uint8_t NodeResult);
    void ReceiveExecutionFinishAI(AAIController* OwnerController, APawn* ControlledPawn, uint8_t NodeResult);
    void ReceiveExecutionStart(AActor* OwnerActor);
    void ReceiveExecutionStartAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveObserverActivated(AActor* OwnerActor);
    void ReceiveObserverActivatedAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveObserverDeactivated(AActor* OwnerActor);
    void ReceiveObserverDeactivatedAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveTick(AActor* OwnerActor, float DeltaSeconds);
    void ReceiveTickAI(AAIController* OwnerController, APawn* ControlledPawn, float DeltaSeconds);
};

// Size: 0xe0
class UBTDecorator_CheckGameplayTagsOnActor : public UBTDecorator {
    /* 0x0078 */ FBlackboardKeySelector ActorToCheck;
    /* 0x00a8 */ EGameplayContainerMatchType TagsToMatch;
    /* 0x00b0 */ FGameplayTagContainer GameplayTags;
    /* 0x00d0 */ FString CachedDescription;
};

// Size: 0xe0
class UBTDecorator_CompareBBEntries : public UBTDecorator {
    /* 0x0078 */ uint8_t Operator;
    /* 0x0080 */ FBlackboardKeySelector BlackboardKeyA;
    /* 0x00b0 */ FBlackboardKeySelector BlackboardKeyB;
};

// Size: 0xd8
class UBTDecorator_ConditionalLoop : public UBTDecorator_Blackboard {
};

// Size: 0x118
class UBTDecorator_ConeCheck : public UBTDecorator {
    /* 0x0078 */ float ConeHalfAngle;
    /* 0x0080 */ FBlackboardKeySelector ConeOrigin;
    /* 0x00b0 */ FBlackboardKeySelector ConeDirection;
    /* 0x00e0 */ FBlackboardKeySelector Observed;
};

// Size: 0x80
class UBTDecorator_Cooldown : public UBTDecorator {
    /* 0x0078 */ float CoolDownTime;
};

// Size: 0xe8
class UBTDecorator_DoesPathExist : public UBTDecorator {
    /* 0x0078 */ FBlackboardKeySelector BlackboardKeyA;
    /* 0x00a8 */ FBlackboardKeySelector BlackboardKeyB;
    /* 0x00d8 */ bool bUseSelf;
    /* 0x00dc */ uint8_t PathQueryType;
    /* 0x00e0 */ UClass* FilterClass;
};

// Size: 0x78
class UBTDecorator_ForceSuccess : public UBTDecorator {
};

// Size: 0xf8
class UBTDecorator_IsAtLocation : public UBTDecorator_BlackboardBase {
    /* 0x00a8 */ float AcceptableRadius;
    /* 0x00b0 */ FAIDataProviderFloatValue ParametrizedAcceptableRadius;
    /* 0x00f0 */ FAIDistanceType GeometricDistanceType;
    /* 0x00f4 */ bool bUseParametrizedRadius;
    /* 0x00f4 */ bool bUseNavAgentGoalLocation;
    /* 0x00f4 */ bool bPathFindingBasedTest;
};

// Size: 0xb0
class UBTDecorator_IsBBEntryOfClass : public UBTDecorator_BlackboardBase {
    /* 0x00a8 */ UClass* TestClass;
};

// Size: 0xe8
class UBTDecorator_KeepInCone : public UBTDecorator {
    /* 0x0078 */ float ConeHalfAngle;
    /* 0x0080 */ FBlackboardKeySelector ConeOrigin;
    /* 0x00b0 */ FBlackboardKeySelector Observed;
    /* 0x00e0 */ bool bUseSelfAsOrigin;
    /* 0x00e0 */ bool bUseSelfAsObserved;
};

// Size: 0x88
class UBTDecorator_Loop : public UBTDecorator {
    /* 0x0078 */ int32_t NumLoops;
    /* 0x007c */ bool bInfiniteLoop;
    /* 0x0080 */ float InfiniteLoopTimeoutTime;
};

// Size: 0x78
class UBTDecorator_ReachedMoveGoal : public UBTDecorator {
};

// Size: 0x90
class UBTDecorator_SetTagCooldown : public UBTDecorator {
    /* 0x0078 */ FGameplayTag CooldownTag;
    /* 0x0084 */ float CooldownDuration;
    /* 0x0088 */ bool bAddToExistingDuration;
};

// Size: 0x90
class UBTDecorator_TagCooldown : public UBTDecorator {
    /* 0x0078 */ FGameplayTag CooldownTag;
    /* 0x0084 */ float CooldownDuration;
    /* 0x0088 */ bool bAddToExistingDuration;
    /* 0x0089 */ bool bActivatesCooldown;
};

// Size: 0x80
class UBTDecorator_TimeLimit : public UBTDecorator {
    /* 0x0078 */ float TimeLimit;
};

// Size: 0x30
class UBTFunctionLibrary : public UBlueprintFunctionLibrary {

    static void ClearBlackboardValue(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static void ClearBlackboardValueAsVector(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static AActor* GetBlackboardValueAsActor(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static bool GetBlackboardValueAsBool(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static UClass* GetBlackboardValueAsClass(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static uint8_t GetBlackboardValueAsEnum(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static float GetBlackboardValueAsFloat(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static int32_t GetBlackboardValueAsInt(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static FName GetBlackboardValueAsName(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static UObject* GetBlackboardValueAsObject(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static FRotator GetBlackboardValueAsRotator(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static FString GetBlackboardValueAsString(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static FVector GetBlackboardValueAsVector(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static UBehaviorTreeComponent* GetOwnerComponent(UBTNode* NodeOwner);
    static UBlackboardComponent* GetOwnersBlackboard(UBTNode* NodeOwner);
    static void SetBlackboardValueAsBool(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, bool Value);
    static void SetBlackboardValueAsClass(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, UClass* Value);
    static void SetBlackboardValueAsEnum(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, uint8_t Value);
    static void SetBlackboardValueAsFloat(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, float Value);
    static void SetBlackboardValueAsInt(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, int32_t Value);
    static void SetBlackboardValueAsName(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, FName Value);
    static void SetBlackboardValueAsObject(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, UObject* Value);
    static void SetBlackboardValueAsRotator(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, FRotator Value);
    static void SetBlackboardValueAsString(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, FString Value);
    static void SetBlackboardValueAsVector(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, FVector Value);
    static void StartUsingExternalEvent(UBTNode* NodeOwner, AActor* OwningActor);
    static void StopUsingExternalEvent(UBTNode* NodeOwner);
};

// Size: 0x68
class UBTNode : public UObject {
    /* 0x0038 */ FString NodeName;
    /* 0x0048 */ UBehaviorTree* TreeAsset;
    /* 0x0050 */ UBTCompositeNode* ParentNode;
};

// Size: 0x80
class UBTService : public UBTAuxiliaryNode {
    /* 0x0070 */ float Interval;
    /* 0x0074 */ float RandomDeviation;
    /* 0x0078 */ bool bCallTickOnSearchStart;
    /* 0x0078 */ bool bRestartTimerOnEachActivation;
};

// Size: 0xb0
class UBTService_BlackboardBase : public UBTService {
    /* 0x0080 */ FBlackboardKeySelector BlackboardKey;
};

// Size: 0xb8
class UBTService_BlueprintBase : public UBTService {
    /* 0x0080 */ AAIController* AIOwner;
    /* 0x0088 */ AActor* ActorOwner;
    /* 0x00a0 */ FString CustomDescription;
    /* 0x00b0 */ bool bShowPropertyDetails;
    /* 0x00b0 */ bool bShowEventDetails;

    bool IsServiceActive() const;
    void ReceiveActivation(AActor* OwnerActor);
    void ReceiveActivationAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveDeactivation(AActor* OwnerActor);
    void ReceiveDeactivationAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveSearchStart(AActor* OwnerActor);
    void ReceiveSearchStartAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveTick(AActor* OwnerActor, float DeltaSeconds);
    void ReceiveTickAI(AAIController* OwnerController, APawn* ControlledPawn, float DeltaSeconds);
};

// Size: 0xb8
class UBTService_DefaultFocus : public UBTService_BlackboardBase {
    /* 0x00b0 */ uint8_t FocusPriority;
};

// Size: 0x110
class UBTService_RunEQS : public UBTService_BlackboardBase {
    /* 0x00b0 */ FEQSParametrizedQueryExecutionRequest EQSRequest;
};

// Size: 0x80
class UBTTaskNode : public UBTNode {
    /* 0x0068 */ TArray<UBTService*> Services;
    /* 0x0078 */ bool bIgnoreRestartSelf;
};

// Size: 0xb0
class UBTTask_BlackboardBase : public UBTTaskNode {
    /* 0x0080 */ FBlackboardKeySelector BlackboardKey;
};

// Size: 0xc8
class UBTTask_BlueprintBase : public UBTTaskNode {
    /* 0x0080 */ AAIController* AIOwner;
    /* 0x0088 */ AActor* ActorOwner;
    /* 0x0090 */ FIntervalCountdown TickInterval;
    /* 0x00b0 */ FString CustomDescription;
    /* 0x00c0 */ bool bShowPropertyDetails;

    void FinishAbort();
    void FinishExecute(bool bSuccess);
    bool IsTaskAborting() const;
    bool IsTaskExecuting() const;
    void ReceiveAbort(AActor* OwnerActor);
    void ReceiveAbortAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveExecute(AActor* OwnerActor);
    void ReceiveExecuteAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveTick(AActor* OwnerActor, float DeltaSeconds);
    void ReceiveTickAI(AAIController* OwnerController, APawn* ControlledPawn, float DeltaSeconds);
    void SetFinishOnMessage(FName MessageName);
    void SetFinishOnMessageWithId(FName MessageName, int32_t RequestID);
};

// Size: 0x88
class UBTTask_FinishWithResult : public UBTTaskNode {
    /* 0x0080 */ uint8_t Result;
};

// Size: 0x88
class UBTTask_GameplayTaskBase : public UBTTaskNode {
    /* 0x0080 */ bool bWaitForGameplayTask;
};

// Size: 0x88
class UBTTask_MakeNoise : public UBTTaskNode {
    /* 0x0080 */ float Loudnes;
};

// Size: 0xd0
class UBTTask_MoveDirectlyToward : public UBTTask_MoveTo {
    /* 0x00c8 */ bool bDisablePathUpdateOnGoalLocationChange;
    /* 0x00c8 */ bool bProjectVectorGoalToNavigation;
    /* 0x00c8 */ bool bUpdatedDeprecatedProperties;
};

// Size: 0xc8
class UBTTask_MoveTo : public UBTTask_BlackboardBase {
    /* 0x00b0 */ float AcceptableRadius;
    /* 0x00b8 */ UClass* FilterClass;
    /* 0x00c0 */ float ObservedBlackboardValueTolerance;
    /* 0x00c4 */ bool bObserveBlackboardValue;
    /* 0x00c4 */ bool bAllowStrafe;
    /* 0x00c4 */ bool bAllowPartialPath;
    /* 0x00c4 */ bool bTrackMovingGoal;
    /* 0x00c4 */ bool bProjectGoalLocation;
    /* 0x00c4 */ bool bReachTestIncludesAgentRadius;
    /* 0x00c4 */ bool bReachTestIncludesGoalRadius;
    /* 0x00c4 */ bool bStopOnOverlap;
    /* 0x00c5 */ bool bStopOnOverlapNeedsUpdate;
};

// Size: 0x80
class UBTTask_PawnActionBase : public UBTTaskNode {
};

// Size: 0xc0
class UBTTask_PlayAnimation : public UBTTaskNode {
    /* 0x0080 */ UAnimationAsset* AnimationToPlay;
    /* 0x0088 */ bool bLooping;
    /* 0x0088 */ bool bNonBlocking;
    /* 0x0090 */ UBehaviorTreeComponent* MyOwnerComp;
    /* 0x0098 */ USkeletalMeshComponent* CachedSkelMesh;
};

// Size: 0x88
class UBTTask_PlaySound : public UBTTaskNode {
    /* 0x0080 */ USoundCue* SoundToPlay;
};

// Size: 0x88
class UBTTask_PushPawnAction : public UBTTask_PawnActionBase {
    /* 0x0080 */ UPawnAction* Action;
};

// Size: 0xb8
class UBTTask_RotateToFaceBBEntry : public UBTTask_BlackboardBase {
    /* 0x00b0 */ float Precision;
};

// Size: 0x88
class UBTTask_RunBehavior : public UBTTaskNode {
    /* 0x0080 */ UBehaviorTree* BehaviorAsset;
};

// Size: 0xa0
class UBTTask_RunBehaviorDynamic : public UBTTaskNode {
    /* 0x0080 */ FGameplayTag InjectionTag;
    /* 0x0090 */ UBehaviorTree* DefaultBehaviorAsset;
    /* 0x0098 */ UBehaviorTree* BehaviorAsset;
};

// Size: 0x178
class UBTTask_RunEQSQuery : public UBTTask_BlackboardBase {
    /* 0x00b0 */ UEnvQuery* QueryTemplate;
    /* 0x00b8 */ TArray<FEnvNamedValue> QueryParams;
    /* 0x00c8 */ TArray<FAIDynamicParam> QueryConfig;
    /* 0x00d8 */ uint8_t RunMode;
    /* 0x00e0 */ FBlackboardKeySelector EQSQueryBlackboardKey;
    /* 0x0110 */ bool bUseBBKey;
    /* 0x0118 */ FEQSParametrizedQueryExecutionRequest EQSRequest;
};

// Size: 0x98
class UBTTask_SetTagCooldown : public UBTTaskNode {
    /* 0x0080 */ FGameplayTag CooldownTag;
    /* 0x008c */ bool bAddToExistingDuration;
    /* 0x0090 */ float CooldownDuration;
};

// Size: 0x88
class UBTTask_Wait : public UBTTaskNode {
    /* 0x0080 */ float WaitTime;
    /* 0x0084 */ float RandomDeviation;
};

// Size: 0xb8
class UBTTask_WaitBlackboardTime : public UBTTask_Wait {
    /* 0x0088 */ FBlackboardKeySelector BlackboardKey;
};

// Size: 0x88
class UBehaviorTree : public UObject {
    /* 0x0038 */ UBTCompositeNode* RootNode;
    /* 0x0040 */ UEdGraph* BTGraph;
    /* 0x0048 */ TArray<FEditedDocumentInfo> LastEditedDocuments;
    /* 0x0058 */ UBlackboardData* BlackboardAsset;
    /* 0x0060 */ TArray<UBTDecorator*> RootDecorators;
    /* 0x0070 */ TArray<FBTDecoratorLogic> RootDecoratorOps;
};

// Size: 0x338
class UBehaviorTreeComponent : public UBrainComponent {
    /* 0x0138 */ TArray<UBTNode*> NodeInstances;
    /* 0x0318 */ UBehaviorTree* DefaultBehaviorTreeAsset;

    void AddCooldownTagDuration(FGameplayTag CooldownTag, float CooldownDuration, bool bAddToExistingDuration);
    float GetTagCooldownEndTime(FGameplayTag CooldownTag) const;
    void SetDynamicSubtree(FGameplayTag InjectTag, UBehaviorTree* BehaviorAsset);
};

// Size: 0x58
class UBehaviorTreeManager : public UObject {
    /* 0x0030 */ int32_t MaxDebuggerSteps;
    /* 0x0038 */ TArray<FBehaviorTreeTemplateInfo> LoadedTemplates;
    /* 0x0048 */ TArray<UBehaviorTreeComponent*> ActiveComponents;
};

// Size: 0x18
struct FBehaviorTreeTemplateInfo {
    /* 0x0000 */ UBehaviorTree* Asset;
    /* 0x0008 */ UBTCompositeNode* Template;
};

// Size: 0x30
class UBehaviorTreeTypes : public UObject {
};

// Size: 0x30
class IBlackboardAssetProvider : public UInterface {

    UBlackboardData* GetBlackboardAsset() const;
};

// Size: 0x1c8
class UBlackboardComponent : public UActorComponent {
    /* 0x00c0 */ UBrainComponent* BrainComp;
    /* 0x00c8 */ UBlackboardData* DefaultBlackboardAsset;
    /* 0x00d0 */ UBlackboardData* BlackboardAsset;
    /* 0x00f8 */ TArray<UBlackboardKeyType*> KeyInstances;

    void ClearValue(const FName& KeyName);
    bool GetLocationFromEntry(const FName& KeyName, FVector& ResultLocation) const;
    bool GetRotationFromEntry(const FName& KeyName, FRotator& ResultRotation) const;
    bool GetValueAsBool(const FName& KeyName) const;
    UClass* GetValueAsClass(const FName& KeyName) const;
    uint8_t GetValueAsEnum(const FName& KeyName) const;
    float GetValueAsFloat(const FName& KeyName) const;
    int32_t GetValueAsInt(const FName& KeyName) const;
    FName GetValueAsName(const FName& KeyName) const;
    UObject* GetValueAsObject(const FName& KeyName) const;
    FRotator GetValueAsRotator(const FName& KeyName) const;
    FString GetValueAsString(const FName& KeyName) const;
    FVector GetValueAsVector(const FName& KeyName) const;
    bool IsVectorValueSet(const FName& KeyName) const;
    void SetValueAsBool(const FName& KeyName, bool BoolValue);
    void SetValueAsClass(const FName& KeyName, UClass* ClassValue);
    void SetValueAsEnum(const FName& KeyName, uint8_t EnumValue);
    void SetValueAsFloat(const FName& KeyName, float FloatValue);
    void SetValueAsInt(const FName& KeyName, int32_t IntValue);
    void SetValueAsName(const FName& KeyName, FName NameValue);
    void SetValueAsObject(const FName& KeyName, UObject* ObjectValue);
    void SetValueAsRotator(const FName& KeyName, FRotator VectorValue);
    void SetValueAsString(const FName& KeyName, FString StringValue);
    void SetValueAsVector(const FName& KeyName, FVector VectorValue);
};

// Size: 0x68
class UBlackboardData : public UDataAsset {
    /* 0x0038 */ UBlackboardData* Parent;
    /* 0x0040 */ TArray<FBlackboardEntry> ParentKeys;
    /* 0x0050 */ TArray<FBlackboardEntry> Keys;
    /* 0x0060 */ bool bHasSynchronizedKeys;
};

// Size: 0x40
struct FBlackboardEntry {
    /* 0x0000 */ FName EntryName;
    /* 0x0010 */ FString EntryDescription;
    /* 0x0020 */ FName EntryCategory;
    /* 0x0030 */ UBlackboardKeyType* KeyType;
    /* 0x0038 */ bool bInstanceSynced;
};

// Size: 0x30
struct FBlackboardKeySelector {
    /* 0x0000 */ TArray<UBlackboardKeyType*> AllowedTypes;
    /* 0x0010 */ FName SelectedKeyName;
    /* 0x0020 */ UClass* SelectedKeyType;
    /* 0x0028 */ uint8_t SelectedKeyID;
    /* 0x002c */ bool bNoneIsAllowedValue;
};

// Size: 0x38
class UBlackboardKeyType : public UObject {
};

// Size: 0x38
class UBlackboardKeyType_Bool : public UBlackboardKeyType {
};

// Size: 0x40
class UBlackboardKeyType_Class : public UBlackboardKeyType {
    /* 0x0038 */ UClass* BaseClass;
};

// Size: 0x58
class UBlackboardKeyType_Enum : public UBlackboardKeyType {
    /* 0x0038 */ UEnum* EnumType;
    /* 0x0040 */ FString EnumName;
    /* 0x0050 */ bool bIsEnumNameValid;
};

// Size: 0x38
class UBlackboardKeyType_Float : public UBlackboardKeyType {
};

// Size: 0x38
class UBlackboardKeyType_Int : public UBlackboardKeyType {
};

// Size: 0x38
class UBlackboardKeyType_Name : public UBlackboardKeyType {
};

// Size: 0x50
class UBlackboardKeyType_NativeEnum : public UBlackboardKeyType {
    /* 0x0038 */ FString EnumName;
    /* 0x0048 */ UEnum* EnumType;
};

// Size: 0x40
class UBlackboardKeyType_Object : public UBlackboardKeyType {
    /* 0x0038 */ UClass* BaseClass;
};

// Size: 0x38
class UBlackboardKeyType_Rotator : public UBlackboardKeyType {
};

// Size: 0x48
class UBlackboardKeyType_String : public UBlackboardKeyType {
    /* 0x0038 */ FString StringValue;
};

// Size: 0x38
class UBlackboardKeyType_Vector : public UBlackboardKeyType {
};

// Size: 0x118
class UBrainComponent : public UActorComponent {
    /* 0x00c8 */ UBlackboardComponent* BlackboardComp;
    /* 0x00d0 */ AAIController* AIOwner;

    bool IsPaused() const;
    bool IsRunning() const;
    void RestartLogic();
    void StartLogic();
    void StopLogic(FString reason);
};

// Size: 0x30
class ICrowdAgentInterface : public UInterface {
};

// Size: 0x1c
struct FCrowdAvoidanceConfig {
    /* 0x0000 */ float VelocityBias;
    /* 0x0004 */ float DesiredVelocityWeight;
    /* 0x0008 */ float CurrentVelocityWeight;
    /* 0x000c */ float SideBiasWeight;
    /* 0x0010 */ float ImpactTimeWeight;
    /* 0x0014 */ float ImpactTimeRange;
    /* 0x0018 */ uint8_t CustomPatternIdx;
    /* 0x0019 */ uint8_t AdaptiveDivisions;
    /* 0x001a */ uint8_t AdaptiveRings;
    /* 0x001b */ uint8_t AdaptiveDepth;
};

// Size: 0x20
struct FCrowdAvoidanceSamplingPattern {
    /* 0x0000 */ TArray<float> Angles;
    /* 0x0010 */ TArray<float> Radii;
};

// Size: 0x2e0
class UCrowdFollowingComponent : public UPathFollowingComponent {
    /* 0x0298 */ FVector CrowdAgentMoveDirection;
    /* 0x02a8 */ UCharacterMovementComponent* CharacterMovement;
    /* 0x02b0 */ FNavAvoidanceMask AvoidanceGroup;
    /* 0x02b4 */ FNavAvoidanceMask GroupsToAvoid;
    /* 0x02b8 */ FNavAvoidanceMask GroupsToIgnore;

    void SuspendCrowdSteering(bool bSuspend);
};

// Size: 0x108
class UCrowdManager : public UCrowdManagerBase {
    /* 0x0030 */ ANavigationData* MyNavData;
    /* 0x0038 */ TArray<FCrowdAvoidanceConfig> AvoidanceConfig;
    /* 0x0048 */ TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns;
    /* 0x0058 */ int32_t MaxAgents;
    /* 0x005c */ float MaxAgentRadius;
    /* 0x0060 */ int32_t MaxAvoidedAgents;
    /* 0x0064 */ int32_t MaxAvoidedWalls;
    /* 0x0068 */ float NavmeshCheckInterval;
    /* 0x006c */ float PathOptimizationInterval;
    /* 0x0070 */ float SeparationDirClamp;
    /* 0x0074 */ float PathOffsetRadiusMultiplier;
    /* 0x0078 */ bool bResolveCollisions;
    /* 0x0100 */ UWorld* DebugDrawingWorld;
};

// Size: 0x408
class ADetourCrowdAIController : public AAIController {
};

enum class EAILockSource {
    Animation = 0,
    Logic = 1,
    Script = 2,
    Gameplay = 3,
    MAX = 4,
};

enum class EAIOptionFlag {
    Default = 0,
    Enable = 1,
    Disable = 2,
    MAX = 3,
};

enum class EAIParamType {
    Float = 0,
    Int = 1,
    Bool = 2,
    MAX = 3,
};

enum class EAIRequestPriority {
    SoftScript = 0,
    Logic = 1,
    HardScript = 2,
    Reaction = 3,
    Ultimate = 4,
    MAX = 5,
};

enum class EAISenseNotifyType {
    OnEveryPerception = 0,
    OnPerceptionChange = 1,
    EAISenseNotifyType_MAX = 2,
};

enum class EAITaskPriority {
    Lowest = 0,
    Low = 64,
    AutonomousAI = 127,
    High = 192,
    Ultimate = 254,
    EAITaskPriority_MAX = 255,
};

enum class EArithmeticKeyOperation {
    Equal = 0,
    NotEqual = 1,
    Less = 2,
    LessOrEqual = 3,
    Greater = 4,
    GreaterOrEqual = 5,
    EArithmeticKeyOperation_MAX = 6,
};

enum class EBTBlackboardRestart {
    ValueChange = 0,
    ResultChange = 1,
    EBTBlackboardRestart_MAX = 2,
};

enum class EBTChildIndex {
    FirstNode = 0,
    TaskNode = 1,
    EBTChildIndex_MAX = 2,
};

enum class EBTDecoratorLogic {
    Invalid = 0,
    Test = 1,
    And = 2,
    Or = 3,
    Not = 4,
    EBTDecoratorLogic_MAX = 5,
};

enum class EBTFlowAbortMode {
    None = 0,
    LowerPriority = 1,
    Self = 2,
    Both = 3,
    EBTFlowAbortMode_MAX = 4,
};

enum class EBTNodeResult {
    Succeeded = 0,
    Failed = 1,
    Aborted = 2,
    InProgress = 3,
    EBTNodeResult_MAX = 4,
};

enum class EBTParallelMode {
    AbortBackground = 0,
    WaitForBackground = 1,
    EBTParallelMode_MAX = 2,
};

enum class EBasicKeyOperation {
    Set = 0,
    NotSet = 1,
    EBasicKeyOperation_MAX = 2,
};

enum class EBlackBoardEntryComparison {
    Equal = 0,
    NotEqual = 1,
    EBlackBoardEntryComparison_MAX = 2,
};

enum class EEQSNormalizationType {
    Absolute = 0,
    RelativeToScores = 1,
    EEQSNormalizationType_MAX = 2,
};

enum class EEnvDirection {
    TwoPoints = 0,
    Rotation = 1,
    EEnvDirection_MAX = 2,
};

enum class EEnvOverlapShape {
    Box = 0,
    Sphere = 1,
    Capsule = 2,
    EEnvOverlapShape_MAX = 3,
};

enum class EEnvQueryHightlightMode {
    All = 0,
    Best5Pct = 1,
    Best25Pct = 2,
    EEnvQueryHightlightMode_MAX = 3,
};

enum class EEnvQueryParam {
    Float = 0,
    Int = 1,
    Bool = 2,
    EEnvQueryParam_MAX = 3,
};

enum class EEnvQueryRunMode {
    SingleResult = 0,
    RandomBest5Pct = 1,
    RandomBest25Pct = 2,
    AllMatching = 3,
    EEnvQueryRunMode_MAX = 4,
};

enum class EEnvQueryStatus {
    Processing = 0,
    Success = 1,
    Failed = 2,
    Aborted = 3,
    OwnerLost = 4,
    MissingParam = 5,
    EEnvQueryStatus_MAX = 6,
};

enum class EEnvQueryTestClamping {
    None = 0,
    SpecifiedValue = 1,
    FilterThreshold = 2,
    EEnvQueryTestClamping_MAX = 3,
};

enum class EEnvQueryTrace {
    None = 0,
    Navigation = 1,
    Geometry = 2,
    NavigationOverLedges = 3,
    EEnvQueryTrace_MAX = 4,
};

enum class EEnvTestCost {
    Low = 0,
    Medium = 1,
    High = 2,
    EEnvTestCost_MAX = 3,
};

enum class EEnvTestDistance {
    Distance3D = 0,
    Distance2D = 1,
    DistanceZ = 2,
    DistanceAbsoluteZ = 3,
    EEnvTestDistance_MAX = 4,
};

enum class EEnvTestDot {
    Dot3D = 0,
    Dot2D = 1,
    EEnvTestDot_MAX = 2,
};

enum class EEnvTestFilterOperator {
    AllPass = 0,
    AnyPass = 1,
    EEnvTestFilterOperator_MAX = 2,
};

enum class EEnvTestFilterType {
    Minimum = 0,
    Maximum = 1,
    Range = 2,
    Match = 3,
    EEnvTestFilterType_MAX = 4,
};

enum class EEnvTestPathfinding {
    PathExist = 0,
    PathCost = 1,
    PathLength = 2,
    EEnvTestPathfinding_MAX = 3,
};

enum class EEnvTestPurpose {
    Filter = 0,
    Score = 1,
    FilterAndScore = 2,
    EEnvTestPurpose_MAX = 3,
};

enum class EEnvTestScoreEquation {
    Linear = 0,
    Square = 1,
    InverseLinear = 2,
    SquareRoot = 3,
    Constant = 4,
    EEnvTestScoreEquation_MAX = 5,
};

enum class EEnvTestScoreOperator {
    AverageScore = 0,
    MinScore = 1,
    MaxScore = 2,
    Multiply = 3,
    EEnvTestScoreOperator_MAX = 4,
};

enum class EEnvTestWeight {
    None = 0,
    Square = 1,
    Inverse = 2,
    Unused = 3,
    Constant = 4,
    Skip = 5,
    EEnvTestWeight_MAX = 6,
};

enum class EEnvTraceShape {
    Line = 0,
    Box = 1,
    Sphere = 2,
    Capsule = 3,
    EEnvTraceShape_MAX = 4,
};

enum class EGenericAICheck {
    Less = 0,
    LessOrEqual = 1,
    Equal = 2,
    NotEqual = 3,
    GreaterOrEqual = 4,
    Greater = 5,
    IsTrue = 6,
    MAX = 7,
};

enum class EPathExistanceQueryType {
    NavmeshRaycast2D = 0,
    HierarchicalQuery = 1,
    RegularPathFinding = 2,
    EPathExistanceQueryType_MAX = 3,
};

enum class EPathFollowingAction {
    Error = 0,
    NoMove = 1,
    DirectMove = 2,
    PartialPath = 3,
    PathToGoal = 4,
    EPathFollowingAction_MAX = 5,
};

enum class EPathFollowingRequestResult {
    Failed = 0,
    AlreadyAtGoal = 1,
    RequestSuccessful = 2,
    EPathFollowingRequestResult_MAX = 3,
};

enum class EPathFollowingResult {
    Success = 0,
    Blocked = 1,
    OffPath = 2,
    Aborted = 3,
    Skipped_DEPRECATED = 4,
    Invalid = 5,
    EPathFollowingResult_MAX = 6,
};

enum class EPathFollowingStatus {
    Idle = 0,
    Waiting = 1,
    Paused = 2,
    Moving = 3,
    EPathFollowingStatus_MAX = 4,
};

enum class EPawnActionAbortState {
    NeverStarted = 0,
    NotBeingAborted = 1,
    MarkPendingAbort = 2,
    LatentAbortInProgress = 3,
    AbortDone = 4,
    MAX = 5,
};

enum class EPawnActionEventType {
    Invalid = 0,
    FailedToStart = 1,
    InstantAbort = 2,
    FinishedAborting = 3,
    FinishedExecution = 4,
    Push = 5,
    EPawnActionEventType_MAX = 6,
};

enum class EPawnActionFailHandling {
    RequireSuccess = 0,
    IgnoreFailure = 1,
    EPawnActionFailHandling_MAX = 2,
};

enum class EPawnActionMoveMode {
    UsePathfinding = 0,
    StraightLine = 1,
    EPawnActionMoveMode_MAX = 2,
};

enum class EPawnActionResult {
    NotStarted = 0,
    InProgress = 1,
    Success = 2,
    Failed = 3,
    Aborted = 4,
    EPawnActionResult_MAX = 5,
};

enum class EPawnSubActionTriggeringPolicy {
    CopyBeforeTriggering = 0,
    ReuseInstances = 1,
    EPawnSubActionTriggeringPolicy_MAX = 2,
};

enum class EPointOnCircleSpacingMethod {
    BySpaceBetween = 0,
    ByNumberOfPoints = 1,
    EPointOnCircleSpacingMethod_MAX = 2,
};

// Size: 0x50
struct FEQSParametrizedQueryExecutionRequest {
    /* 0x0000 */ UEnvQuery* QueryTemplate;
    /* 0x0008 */ TArray<FAIDynamicParam> QueryConfig;
    /* 0x0018 */ FBlackboardKeySelector EQSQueryBlackboardKey;
    /* 0x0048 */ uint8_t RunMode;
    /* 0x004c */ bool bUseBBKeyForQueryTemplate;
};

// Size: 0x30
class IEQSQueryResultSourceInterface : public UInterface {
};

// Size: 0x580
class UEQSRenderingComponent : public UPrimitiveComponent {
};

// Size: 0x640
class AEQSTestingPawn : public ACharacter {
    /* 0x05a0 */ UEnvQuery* QueryTemplate;
    /* 0x05a8 */ TArray<FEnvNamedValue> QueryParams;
    /* 0x05b8 */ TArray<FAIDynamicParam> QueryConfig;
    /* 0x05c8 */ float TimeLimitPerStep;
    /* 0x05cc */ int32_t StepToDebugDraw;
    /* 0x05d0 */ EEnvQueryHightlightMode HighlightMode;
    /* 0x05d4 */ bool bDrawLabels;
    /* 0x05d4 */ bool bDrawFailedItems;
    /* 0x05d4 */ bool bReRunQueryOnlyOnFinishedMove;
    /* 0x05d4 */ bool bShouldBeVisibleInGame;
    /* 0x05d4 */ bool bTickDuringGame;
    /* 0x05d8 */ uint8_t QueryingMode;
    /* 0x05e0 */ FNavAgentProperties NavAgentProperties;
    /* 0x0618 */ UEQSRenderingComponent* EdRenderComp;
};

enum class ETeamAttitude {
    Friendly = 0,
    Neutral = 1,
    Hostile = 2,
    ETeamAttitude_MAX = 3,
};

enum class ETextKeyOperation {
    Equal = 0,
    NotEqual = 1,
    Contain = 2,
    NotContain = 3,
    ETextKeyOperation_MAX = 4,
};

// Size: 0x20
struct FEnvDirection {
    /* 0x0000 */ UClass* LineFrom;
    /* 0x0008 */ UClass* LineTo;
    /* 0x0010 */ UClass* Rotation;
    /* 0x0018 */ uint8_t DirMode;
};

// Size: 0x14
struct FEnvNamedValue {
    /* 0x0000 */ FName ParamName;
    /* 0x000c */ EAIParamType ParamType;
    /* 0x0010 */ float Value;
};

// Size: 0x20
struct FEnvOverlapData {
    /* 0x0000 */ float ExtentX;
    /* 0x0004 */ float ExtentY;
    /* 0x0008 */ float ExtentZ;
    /* 0x000c */ FVector ShapeOffset;
    /* 0x0018 */ uint8_t OverlapChannel;
    /* 0x0019 */ uint8_t OverlapShape;
    /* 0x001c */ bool bOnlyBlockingHits;
    /* 0x001c */ bool bOverlapComplex;
    /* 0x001c */ bool bSkipOverlapQuerier;
};

// Size: 0x60
class UEnvQuery : public UDataAsset {
    /* 0x0038 */ UEdGraph* EdGraph;
    /* 0x0040 */ FName QueryName;
    /* 0x0050 */ TArray<UEnvQueryOption*> Options;
};

// Size: 0x30
class UEnvQueryContext : public UObject {
};

// Size: 0x38
class UEnvQueryContext_BlueprintBase : public UEnvQueryContext {

    void ProvideActorsSet(UObject* QuerierObject, AActor* QuerierActor, TArray<AActor*>& ResultingActorsSet) const;
    void ProvideLocationsSet(UObject* QuerierObject, AActor* QuerierActor, TArray<FVector>& ResultingLocationSet) const;
    void ProvideSingleActor(UObject* QuerierObject, AActor* QuerierActor, AActor*& ResultingActor) const;
    void ProvideSingleLocation(UObject* QuerierObject, AActor* QuerierActor, FVector& ResultingLocation) const;
};

// Size: 0x30
class UEnvQueryContext_Item : public UEnvQueryContext {
};

// Size: 0x30
class UEnvQueryContext_Querier : public UEnvQueryContext {
};

// Size: 0x30
class UEnvQueryDebugHelpers : public UObject {
};

// Size: 0x58
class UEnvQueryGenerator : public UEnvQueryNode {
    /* 0x0038 */ FString OptionName;
    /* 0x0048 */ UClass* ItemType;
    /* 0x0050 */ bool bAutoSortTests;
};

// Size: 0xe8
class UEnvQueryGenerator_ActorsOfClass : public UEnvQueryGenerator {
    /* 0x0058 */ UClass* SearchedActorClass;
    /* 0x0060 */ FAIDataProviderBoolValue GenerateOnlyActorsInRadius;
    /* 0x00a0 */ FAIDataProviderFloatValue SearchRadius;
    /* 0x00e0 */ UClass* SearchCenter;
};

// Size: 0x88
class UEnvQueryGenerator_BlueprintBase : public UEnvQueryGenerator {
    /* 0x0058 */ FText GeneratorsActionDescription;
    /* 0x0070 */ UClass* Context;
    /* 0x0078 */ UClass* GeneratedItemType;

    void AddGeneratedActor(AActor* GeneratedActor) const;
    void AddGeneratedVector(FVector GeneratedVector) const;
    void DoItemGeneration(const TArray<FVector>& ContextLocations) const;
    UObject* GetQuerier() const;
};

// Size: 0x78
class UEnvQueryGenerator_Composite : public UEnvQueryGenerator {
    /* 0x0058 */ TArray<UEnvQueryGenerator*> Generators;
    /* 0x0068 */ bool bAllowDifferentItemTypes;
    /* 0x0068 */ bool bHasMatchingItemType;
    /* 0x0070 */ UClass* ForcedItemType;
};

// Size: 0x198
class UEnvQueryGenerator_Cone : public UEnvQueryGenerator_ProjectedPoints {
    /* 0x0088 */ FAIDataProviderFloatValue AlignedPointsDistance;
    /* 0x00c8 */ FAIDataProviderFloatValue ConeDegrees;
    /* 0x0108 */ FAIDataProviderFloatValue AngleStep;
    /* 0x0148 */ FAIDataProviderFloatValue Range;
    /* 0x0188 */ UClass* CenterActor;
    /* 0x0190 */ bool bIncludeContextLocation;
};

// Size: 0x60
class UEnvQueryGenerator_CurrentLocation : public UEnvQueryGenerator {
    /* 0x0058 */ UClass* QueryContext;
};

// Size: 0x200
class UEnvQueryGenerator_Donut : public UEnvQueryGenerator_ProjectedPoints {
    /* 0x0088 */ FAIDataProviderFloatValue InnerRadius;
    /* 0x00c8 */ FAIDataProviderFloatValue OuterRadius;
    /* 0x0108 */ FAIDataProviderIntValue NumberOfRings;
    /* 0x0148 */ FAIDataProviderIntValue PointsPerRing;
    /* 0x0188 */ FEnvDirection ArcDirection;
    /* 0x01a8 */ FAIDataProviderFloatValue ArcAngle;
    /* 0x01e8 */ bool bUseSpiralPattern;
    /* 0x01f0 */ UClass* Center;
    /* 0x01f8 */ bool bDefineArc;
};

// Size: 0x240
class UEnvQueryGenerator_OnCircle : public UEnvQueryGenerator_ProjectedPoints {
    /* 0x0088 */ FAIDataProviderFloatValue CircleRadius;
    /* 0x00c8 */ FAIDataProviderFloatValue SpaceBetween;
    /* 0x0108 */ FAIDataProviderIntValue NumberOfPoints;
    /* 0x0148 */ EPointOnCircleSpacingMethod PointOnCircleSpacingMethod;
    /* 0x0150 */ FEnvDirection ArcDirection;
    /* 0x0170 */ FAIDataProviderFloatValue ArcAngle;
    /* 0x01b0 */ float AngleRadians;
    /* 0x01b8 */ UClass* CircleCenter;
    /* 0x01c0 */ bool bIgnoreAnyContextActorsWhenGeneratingCircle;
    /* 0x01c8 */ FAIDataProviderFloatValue CircleCenterZOffset;
    /* 0x0208 */ FEnvTraceData TraceData;
    /* 0x0238 */ bool bDefineArc;
};

// Size: 0x198
class UEnvQueryGenerator_PathingGrid : public UEnvQueryGenerator_SimpleGrid {
    /* 0x0110 */ FAIDataProviderBoolValue PathToItem;
    /* 0x0150 */ UClass* NavigationFilter;
    /* 0x0158 */ FAIDataProviderFloatValue ScanRangeMultiplier;
};

// Size: 0x88
class UEnvQueryGenerator_ProjectedPoints : public UEnvQueryGenerator {
    /* 0x0058 */ FEnvTraceData ProjectionData;
};

// Size: 0x110
class UEnvQueryGenerator_SimpleGrid : public UEnvQueryGenerator_ProjectedPoints {
    /* 0x0088 */ FAIDataProviderFloatValue GridSize;
    /* 0x00c8 */ FAIDataProviderFloatValue SpaceBetween;
    /* 0x0108 */ UClass* GenerateAround;
};

// Size: 0x88
class UEnvQueryInstanceBlueprintWrapper : public UObject {
    /* 0x0038 */ int32_t QueryID;
    /* 0x0060 */ UClass* ItemType;
    /* 0x0068 */ int32_t OptionIndex;
    /* 0x0070 */ FMulticastInlineDelegate OnQueryFinishedEvent;

    void EQSQueryDoneSignature__DelegateSignature(UEnvQueryInstanceBlueprintWrapper* QueryInstance, uint8_t QueryStatus);
    float GetItemScore(int32_t ItemIndex) const;
    bool GetQueryResultsAsActors(TArray<AActor*>& ResultActors) const;
    bool GetQueryResultsAsLocations(TArray<FVector>& ResultLocations) const;
    TArray<AActor*> GetResultsAsActors() const;
    TArray<FVector> GetResultsAsLocations() const;
    void SetNamedParam(FName ParamName, float Value);
};

// Size: 0x1f8
struct FEnvQueryInstanceCache {
    /* 0x0000 */ UEnvQuery* Template;
};

// Size: 0x38
class UEnvQueryItemType : public UObject {
};

// Size: 0x38
class UEnvQueryItemType_Actor : public UEnvQueryItemType_ActorBase {
};

// Size: 0x38
class UEnvQueryItemType_ActorBase : public UEnvQueryItemType_VectorBase {
};

// Size: 0x38
class UEnvQueryItemType_Direction : public UEnvQueryItemType_VectorBase {
};

// Size: 0x38
class UEnvQueryItemType_Point : public UEnvQueryItemType_VectorBase {
};

// Size: 0x38
class UEnvQueryItemType_VectorBase : public UEnvQueryItemType {
};

// Size: 0x1f8
class UEnvQueryManager : public UAISubsystem {
    /* 0x0150 */ TArray<FEnvQueryInstanceCache> InstanceCache;
    /* 0x0160 */ TArray<UEnvQueryContext*> LocalContexts;
    /* 0x0170 */ TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers;
    /* 0x01d4 */ float MaxAllowedTestingTime;
    /* 0x01d8 */ bool bTestQueriesUsingBreadth;
    /* 0x01dc */ int32_t QueryCountWarningThreshold;
    /* 0x01e0 */ double QueryCountWarningInterval;

    static UEnvQueryInstanceBlueprintWrapper* RunEQSQuery(UObject* WorldContextObject, UEnvQuery* QueryTemplate, UObject* Querier, uint8_t RunMode, UClass* WrapperClass);
};

// Size: 0x38
class UEnvQueryNode : public UObject {
    /* 0x0030 */ int32_t VerNum;
};

// Size: 0x48
class UEnvQueryOption : public UObject {
    /* 0x0030 */ UEnvQueryGenerator* Generator;
    /* 0x0038 */ TArray<UEnvQueryTest*> Tests;
};

// Size: 0x68
struct FEnvQueryRequest {
    /* 0x0000 */ UEnvQuery* QueryTemplate;
    /* 0x0008 */ UObject* Owner;
    /* 0x0010 */ UWorld* World;
};

// Size: 0x40
struct FEnvQueryResult {
    /* 0x0010 */ UClass* ItemType;
    /* 0x002c */ int32_t OptionIndex;
    /* 0x0030 */ int32_t QueryID;
};

// Size: 0x260
class UEnvQueryTest : public UEnvQueryNode {
    /* 0x0038 */ int32_t TestOrder;
    /* 0x003c */ uint8_t TestPurpose;
    /* 0x0040 */ FString TestComment;
    /* 0x0050 */ uint8_t MultipleContextFilterOp;
    /* 0x0051 */ uint8_t MultipleContextScoreOp;
    /* 0x0052 */ uint8_t FilterType;
    /* 0x0058 */ FAIDataProviderBoolValue BoolValue;
    /* 0x0098 */ FAIDataProviderFloatValue FloatValueMin;
    /* 0x00d8 */ FAIDataProviderFloatValue FloatValueMax;
    /* 0x0119 */ uint8_t ScoringEquation;
    /* 0x011a */ uint8_t ClampMinType;
    /* 0x011b */ uint8_t ClampMaxType;
    /* 0x011c */ EEQSNormalizationType NormalizationType;
    /* 0x0120 */ FAIDataProviderFloatValue ScoreClampMin;
    /* 0x0160 */ FAIDataProviderFloatValue ScoreClampMax;
    /* 0x01a0 */ FAIDataProviderFloatValue ScoringFactor;
    /* 0x01e0 */ FAIDataProviderFloatValue ReferenceValue;
    /* 0x0220 */ bool bDefineReferenceValue;
    /* 0x0258 */ bool bWorkOnFloatValues;
};

// Size: 0x270
class UEnvQueryTest_Distance : public UEnvQueryTest {
    /* 0x0260 */ uint8_t TestMode;
    /* 0x0268 */ UClass* DistanceTo;
};

// Size: 0x2a8
class UEnvQueryTest_Dot : public UEnvQueryTest {
    /* 0x0260 */ FEnvDirection LineA;
    /* 0x0280 */ FEnvDirection LineB;
    /* 0x02a0 */ EEnvTestDot TestMode;
    /* 0x02a1 */ bool bAbsoluteValue;
};

// Size: 0x2d0
class UEnvQueryTest_GameplayTags : public UEnvQueryTest {
    /* 0x0260 */ FGameplayTagQuery TagQueryToMatch;
    /* 0x02a8 */ bool bUpdatedToUseQuery;
    /* 0x02a9 */ EGameplayContainerMatchType TagsToMatch;
    /* 0x02b0 */ FGameplayTagContainer GameplayTags;
};

// Size: 0x280
class UEnvQueryTest_Overlap : public UEnvQueryTest {
    /* 0x0260 */ FEnvOverlapData OverlapData;
};

// Size: 0x2f8
class UEnvQueryTest_Pathfinding : public UEnvQueryTest {
    /* 0x0260 */ uint8_t TestMode;
    /* 0x0268 */ UClass* Context;
    /* 0x0270 */ FAIDataProviderBoolValue PathFromContext;
    /* 0x02b0 */ FAIDataProviderBoolValue SkipUnreachable;
    /* 0x02f0 */ UClass* FilterClass;
};

// Size: 0x338
class UEnvQueryTest_PathfindingBatch : public UEnvQueryTest_Pathfinding {
    /* 0x02f8 */ FAIDataProviderFloatValue ScanRangeMultiplier;
};

// Size: 0x290
class UEnvQueryTest_Project : public UEnvQueryTest {
    /* 0x0260 */ FEnvTraceData ProjectionData;
};

// Size: 0x260
class UEnvQueryTest_Random : public UEnvQueryTest {
};

// Size: 0x358
class UEnvQueryTest_Trace : public UEnvQueryTest {
    /* 0x0260 */ FEnvTraceData TraceData;
    /* 0x0290 */ FAIDataProviderBoolValue TraceFromContext;
    /* 0x02d0 */ FAIDataProviderFloatValue ItemHeightOffset;
    /* 0x0310 */ FAIDataProviderFloatValue ContextHeightOffset;
    /* 0x0350 */ UClass* Context;
};

// Size: 0x278
class UEnvQueryTest_Volume : public UEnvQueryTest {
    /* 0x0260 */ UClass* VolumeContext;
    /* 0x0268 */ UClass* VolumeClass;
    /* 0x0270 */ bool bDoComplexVolumeTest;
};

// Size: 0x30
class UEnvQueryTypes : public UObject {
};

// Size: 0x30
struct FEnvTraceData {
    /* 0x0000 */ int32_t VersionNum;
    /* 0x0008 */ UClass* NavigationFilter;
    /* 0x0010 */ float ProjectDown;
    /* 0x0014 */ float ProjectUp;
    /* 0x0018 */ float ExtentX;
    /* 0x001c */ float ExtentY;
    /* 0x0020 */ float ExtentZ;
    /* 0x0024 */ float PostProjectionVerticalOffset;
    /* 0x0028 */ uint8_t TraceChannel;
    /* 0x0029 */ uint8_t SerializedChannel;
    /* 0x002a */ uint8_t TraceShape;
    /* 0x002b */ uint8_t TraceMode;
    /* 0x002c */ bool bTraceComplex;
    /* 0x002c */ bool bOnlyBlockingHits;
    /* 0x002c */ bool bCanTraceOnNavMesh;
    /* 0x002c */ bool bCanTraceOnGeometry;
    /* 0x002c */ bool bCanDisableTrace;
    /* 0x002c */ bool bCanProjectDown;
};

enum class FAIDistanceType {
    Distance3D = 0,
    Distance2D = 1,
    DistanceZ = 2,
    MAX = 3,
};

// Size: 0x30
class IGenericTeamAgentInterface : public UInterface {
};

// Size: 0x1
struct FGenericTeamId {
    /* 0x0000 */ uint8_t TeamID;
};

// Size: 0x408
class AGridPathAIController : public AAIController {
};

// Size: 0x2b0
class UGridPathFollowingComponent : public UPathFollowingComponent {
    /* 0x0280 */ UNavLocalGridManager* GridManager;
};

// Size: 0x8
struct FIntervalCountdown {
    /* 0x0000 */ float Interval;
};

// Size: 0x50
class UNavFilter_AIControllerDefault : public UNavigationQueryFilter {
};

// Size: 0x358
class ANavLinkProxy : public AActor {
    /* 0x0308 */ TArray<FNavigationLink> PointLinks;
    /* 0x0318 */ TArray<FNavigationSegmentLink> SegmentLinks;
    /* 0x0328 */ UNavLinkCustomComponent* SmartLinkComp;
    /* 0x0330 */ bool bSmartLinkIsRelevant;
    /* 0x0338 */ UNavLinkRenderingComponent* EdRenderComp;
    /* 0x0340 */ UBillboardComponent* SpriteComponent;
    /* 0x0348 */ FMulticastInlineDelegate OnSmartLinkReached;

    void CopyEndPointsFromSimpleLinkToSmartLink();
    bool HasMovingAgents() const;
    bool IsSmartLinkEnabled() const;
    void ReceiveSmartLinkReached(AActor* Agent, const FVector& Destination);
    void ResumePathFollowing(AActor* Agent);
    void SetSmartLinkEnabled(bool bEnabled);
};

// Size: 0x60
class UNavLocalGridManager : public UObject {

    static int32_t AddLocalNavigationGridForBox(UObject* WorldContextObject, const FVector& Location, FVector Extent, FRotator Rotation, const int32_t Radius2D, const float Height, bool bRebuildGrids);
    static int32_t AddLocalNavigationGridForCapsule(UObject* WorldContextObject, const FVector& Location, float CapsuleRadius, float CapsuleHalfHeight, const int32_t Radius2D, const float Height, bool bRebuildGrids);
    static int32_t AddLocalNavigationGridForPoint(UObject* WorldContextObject, const FVector& Location, const int32_t Radius2D, const float Height, bool bRebuildGrids);
    static int32_t AddLocalNavigationGridForPoints(UObject* WorldContextObject, const TArray<FVector>& Locations, const int32_t Radius2D, const float Height, bool bRebuildGrids);
    static bool FindLocalNavigationGridPath(UObject* WorldContextObject, const FVector& Start, const FVector& End, TArray<FVector>& PathPoints);
    static void RemoveLocalNavigationGrid(UObject* WorldContextObject, int32_t GridId, bool bRebuildGrids);
    static bool SetLocalNavigationGridDensity(UObject* WorldContextObject, float CellSize);
};

// Size: 0x280
class UPathFollowingComponent : public UActorComponent {
    /* 0x0110 */ UNavMovementComponent* MovementComp;
    /* 0x0120 */ ANavigationData* MyNavData;

    uint8_t GetPathActionType() const;
    FVector GetPathDestination() const;
    void OnActorBump(AActor* SelfActor, AActor* OtherActor, FVector NormalImpulse, const FHitResult& Hit);
    void OnNavDataRegistered(ANavigationData* NavData);
};

// Size: 0x30
class UPathFollowingManager : public UObject {
};

// Size: 0x98
class UPawnAction : public UObject {
    /* 0x0030 */ UPawnAction* ChildAction;
    /* 0x0038 */ UPawnAction* ParentAction;
    /* 0x0040 */ UPawnActionsComponent* OwnerComponent;
    /* 0x0048 */ UObject* Instigator;
    /* 0x0050 */ UBrainComponent* BrainComp;
    /* 0x0088 */ bool bAllowNewSameClassInstance;
    /* 0x0088 */ bool bReplaceActiveSameClassInstance;
    /* 0x0088 */ bool bShouldPauseMovement;
    /* 0x0088 */ bool bAlwaysNotifyOnFinished;

    static UPawnAction* CreateActionInstance(UObject* WorldContextObject, UClass* ActionClass);
    void Finish(uint8_t WithResult);
    uint8_t GetActionPriority();
};

// Size: 0x18
struct FPawnActionEvent {
    /* 0x0000 */ UPawnAction* Action;
};

// Size: 0x8
struct FPawnActionStack {
    /* 0x0000 */ UPawnAction* TopAction;
};

// Size: 0x98
class UPawnAction_BlueprintBase : public UPawnAction {

    void ActionFinished(APawn* ControlledPawn, uint8_t WithResult);
    void ActionPause(APawn* ControlledPawn);
    void ActionResume(APawn* ControlledPawn);
    void ActionStart(APawn* ControlledPawn);
    void ActionTick(APawn* ControlledPawn, float DeltaSeconds);
};

// Size: 0xe8
class UPawnAction_Move : public UPawnAction {
    /* 0x0098 */ AActor* GoalActor;
    /* 0x00a0 */ FVector GoalLocation;
    /* 0x00ac */ float AcceptableRadius;
    /* 0x00b0 */ UClass* FilterClass;
    /* 0x00b8 */ bool bAllowStrafe;
    /* 0x00b8 */ bool bFinishOnOverlap;
    /* 0x00b8 */ bool bUsePathfinding;
    /* 0x00b8 */ bool bAllowPartialPath;
    /* 0x00b8 */ bool bProjectGoalToNavigation;
    /* 0x00b8 */ bool bUpdatePathToGoal;
    /* 0x00b8 */ bool bAbortChildActionOnPathChange;
};

// Size: 0xb8
class UPawnAction_Repeat : public UPawnAction {
    /* 0x0098 */ UPawnAction* ActionToRepeat;
    /* 0x00a0 */ UPawnAction* RecentActionCopy;
    /* 0x00a8 */ uint8_t ChildFailureHandlingMode;
};

// Size: 0xc0
class UPawnAction_Sequence : public UPawnAction {
    /* 0x0098 */ TArray<UPawnAction*> ActionSequence;
    /* 0x00a8 */ uint8_t ChildFailureHandlingMode;
    /* 0x00b0 */ UPawnAction* RecentActionCopy;
};

// Size: 0xa8
class UPawnAction_Wait : public UPawnAction {
    /* 0x0098 */ float TimeToWait;
};

// Size: 0xf8
class UPawnActionsComponent : public UActorComponent {
    /* 0x00c0 */ APawn* ControlledPawn;
    /* 0x00c8 */ TArray<FPawnActionStack> ActionStacks;
    /* 0x00d8 */ TArray<FPawnActionEvent> ActionEvents;
    /* 0x00e8 */ UPawnAction* CurrentAction;

    uint8_t K2_AbortAction(UPawnAction* ActionToAbort);
    uint8_t K2_ForceAbortAction(UPawnAction* ActionToAbort);
    static bool K2_PerformAction(APawn* Pawn, UPawnAction* Action, uint8_t Priority);
    bool K2_PushAction(UPawnAction* NewAction, uint8_t Priority, UObject* Instigator);
};

// Size: 0x108
class UPawnSensingComponent : public UActorComponent {
    /* 0x00c0 */ float HearingThreshold;
    /* 0x00c4 */ float LOSHearingThreshold;
    /* 0x00c8 */ float SightRadius;
    /* 0x00cc */ float SensingInterval;
    /* 0x00d0 */ float HearingMaxSoundAge;
    /* 0x00d4 */ bool bEnableSensingUpdates;
    /* 0x00d4 */ bool bOnlySensePlayers;
    /* 0x00d4 */ bool bSeePawns;
    /* 0x00d4 */ bool bHearNoises;
    /* 0x00e0 */ FMulticastInlineDelegate OnSeePawn;
    /* 0x00f0 */ FMulticastInlineDelegate OnHearNoise;
    /* 0x0100 */ float PeripheralVisionAngle;
    /* 0x0104 */ float PeripheralVisionCosine;

    float GetPeripheralVisionAngle() const;
    float GetPeripheralVisionCosine() const;
    void HearNoiseDelegate__DelegateSignature(APawn* Instigator, const FVector& Location, float Volume);
    void SeePawnDelegate__DelegateSignature(APawn* Pawn);
    void SetPeripheralVisionAngle(const float NewPeripheralVisionAngle);
    void SetSensingInterval(const float NewSensingInterval);
    void SetSensingUpdatesEnabled(const bool bEnabled);
};

// Size: 0x98
struct FRecastGraphWrapper {
    /* 0x0000 */ ARecastNavMesh* RecastNavMeshActor;
};

// Size: 0x30
class UVisualLoggerExtension : public UObject {
};

// Size: 0x60
class UMockAI : public UObject {
    /* 0x0040 */ UBlackboardComponent* BBComp;
    /* 0x0048 */ UBrainComponent* BrainComp;
    /* 0x0050 */ UAIPerceptionComponent* PerceptionComp;
    /* 0x0058 */ UPawnActionsComponent* PawnActionComp;
};

// Size: 0x78
class UMockAI_BT : public UMockAI {
    /* 0x0060 */ UBehaviorTreeComponent* BTComp;
};

// Size: 0x40
class UMockGameplayTaskOwner : public UObject {
    /* 0x0038 */ UGameplayTasksComponent* GTComponent;
};

// Size: 0x130
class UMockGameplayTasksComponent : public UGameplayTasksComponent {
};

// Size: 0x90
class UMockTask_Log : public UGameplayTask {
};

// Size: 0xe8
class UTestBTDecorator_Blackboard : public UBTDecorator_Blackboard {
    /* 0x00d8 */ int32_t LogIndexBecomeRelevant;
    /* 0x00dc */ int32_t LogIndexCeaseRelevant;
    /* 0x00e0 */ int32_t LogIndexCalculate;
};

// Size: 0x78
class UTestBTDecorator_CantExecute : public UBTDecorator {
};

// Size: 0x80
class UTestBTDecorator_DelayedAbort : public UBTDecorator {
    /* 0x0078 */ int32_t DelayTicks;
    /* 0x007c */ bool bOnlyOnce;
};

// Size: 0x98
class UTestBTService_Log : public UBTService {
    /* 0x0080 */ int32_t LogActivation;
    /* 0x0084 */ int32_t LogDeactivation;
    /* 0x0088 */ FName KeyNameTick;
    /* 0x0094 */ int32_t LogTick;
};

// Size: 0xb8
class UTestBTTask_LatentWithFlags : public UBTTaskNode {
    /* 0x0080 */ int32_t LogIndexExecuteStart;
    /* 0x0084 */ int32_t LogIndexExecuteFinish;
    /* 0x0088 */ int32_t LogIndexAbortStart;
    /* 0x008c */ int32_t LogIndexAbortFinish;
    /* 0x0090 */ int32_t ExecuteTicks;
    /* 0x0094 */ int32_t AbortTicks;
    /* 0x0098 */ FName KeyNameExecute;
    /* 0x00a4 */ FName KeyNameAbort;
    /* 0x00b0 */ uint8_t LogResult;
};

// Size: 0x90
class UTestBTTask_Log : public UBTTaskNode {
    /* 0x0080 */ int32_t LogIndex;
    /* 0x0084 */ int32_t LogFinished;
    /* 0x0088 */ int32_t ExecutionTicks;
    /* 0x008c */ uint8_t LogResult;
};

// Size: 0xa0
class UTestBTTask_SetFlag : public UBTTaskNode {
    /* 0x0080 */ FName KeyName;
    /* 0x008c */ bool bValue;
    /* 0x0090 */ FName OnAbortKeyName;
    /* 0x009c */ bool bOnAbortValue;
    /* 0x009d */ uint8_t TaskResult;
};

// Size: 0xa8
class UTestBTTask_SetValue : public UBTTaskNode {
    /* 0x0080 */ FName KeyName;
    /* 0x008c */ int32_t Value;
    /* 0x0090 */ FName OnAbortKeyName;
    /* 0x009c */ int32_t OnAbortValue;
    /* 0x00a0 */ uint8_t TaskResult;
};

// Size: 0xa8
class UTestPawnAction_CallFunction : public UTestPawnAction_Log {
};

// Size: 0xa0
class UTestPawnAction_Log : public UPawnAction {
};

// Size: 0xc
struct FActorLayer {
    /* 0x0000 */ FName Name;
};

// Size: 0x30
class ULayersBlueprintLibrary : public UBlueprintFunctionLibrary {

    static void AddActorToLayer(AActor* InActor, const FActorLayer& Layer);
    static TArray<AActor*> GetActors(UObject* WorldContextObject, const FActorLayer& ActorLayer);
    static void RemoveActorFromLayer(AActor* InActor, const FActorLayer& Layer);
};

// Size: 0x98
class UActorSequence : public UMovieSceneSequence {
    /* 0x0068 */ UMovieScene* MovieScene;
    /* 0x0070 */ FActorSequenceObjectReferenceMap ObjectReferences;
    /* 0x0090 */ bool bHasBeenInitialized;
};

// Size: 0xe8
class UActorSequenceComponent : public UActorComponent {
    /* 0x00c0 */ FMovieSceneSequencePlaybackSettings PlaybackSettings;
    /* 0x00d8 */ UActorSequence* Sequence;
    /* 0x00e0 */ UActorSequencePlayer* SequencePlayer;
};

// Size: 0x28
struct FActorSequenceObjectReference {
    /* 0x0000 */ EActorSequenceObjectReferenceType Type;
    /* 0x0004 */ FGuid ActorId;
    /* 0x0018 */ FString PathToComponent;
};

// Size: 0x20
struct FActorSequenceObjectReferenceMap {
    /* 0x0000 */ TArray<FGuid> BindingIds;
    /* 0x0010 */ TArray<FActorSequenceObjectReferences> References;
};

// Size: 0x10
struct FActorSequenceObjectReferences {
    /* 0x0000 */ TArray<FActorSequenceObjectReference> Array;
};

// Size: 0x500
class UActorSequencePlayer : public UMovieSceneSequencePlayer {
};

enum class EActorSequenceObjectReferenceType {
    ContextActor = 0,
    ExternalActor = 1,
    Component = 2,
    EActorSequenceObjectReferenceType_MAX = 3,
};

enum class EContentSourceCategory {
    BlueprintFeature = 0,
    CodeFeature = 1,
    EnterpriseFeature = 2,
    Content = 3,
    EnterpriseContent = 4,
    SharedPack = 5,
    Unknown = 6,
    EContentSourceCategory_MAX = 7,
};

enum class EFeaturePackDetailLevel {
    Standard = 0,
    High = 1,
    EFeaturePackDetailLevel_MAX = 2,
};

// Size: 0x20
struct FFeatureAdditionalFiles {
    /* 0x0000 */ FString DestinationFilesFolder;
    /* 0x0010 */ TArray<FString> AdditionalFilesList;
};

// Size: 0x20
struct FFeaturePackLevelSet {
    /* 0x0000 */ TArray<EFeaturePackDetailLevel> DetailLevels;
    /* 0x0010 */ FString MountName;
};

// Size: 0x98
class UAssetViewerSettings : public UObject {
    /* 0x0038 */ TArray<FPreviewSceneProfile> Profiles;
};

// Size: 0x40
class ULocalProfiles : public UObject {
    /* 0x0030 */ TArray<FPreviewSceneProfile> Profiles;
};

// Size: 0x640
struct FPreviewSceneProfile {
    /* 0x0000 */ FString ProfileName;
    /* 0x0010 */ bool bSharedProfile;
    /* 0x0011 */ bool bUseSkyLighting;
    /* 0x0014 */ float DirectionalLightIntensity;
    /* 0x0018 */ FLinearColor DirectionalLightColor;
    /* 0x0028 */ float SkyLightIntensity;
    /* 0x002c */ bool bRotateLightingRig;
    /* 0x002d */ bool bShowEnvironment;
    /* 0x002e */ bool bShowFloor;
    /* 0x0030 */ FLinearColor EnvironmentColor;
    /* 0x0040 */ float EnvironmentIntensity;
    /* 0x0048 */ TSoftObjectPtr<UTextureCube> EnvironmentCubeMap;
    /* 0x0078 */ FString EnvironmentCubeMapPath;
    /* 0x0088 */ bool bPostProcessingEnabled;
    /* 0x0090 */ FPostProcessSettings PostProcessingSettings;
    /* 0x0620 */ float LightingRigRotation;
    /* 0x0624 */ float RotationSpeed;
    /* 0x0628 */ FRotator DirectionalLightRotation;
};

// Size: 0x40
class USharedProfiles : public UObject {
    /* 0x0030 */ TArray<FPreviewSceneProfile> Profiles;
};

// Size: 0xb8
class UAlembicImportFactory : public UFactory {
    /* 0x00a8 */ UAbcImportSettings* ImportSettings;
    /* 0x00b0 */ bool bShowOption;
};

// Size: 0x88
class UAbcAssetImportData : public UAssetImportData {
    /* 0x0060 */ TArray<FString> TrackNames;
    /* 0x0070 */ FAbcSamplingSettings SamplingSettings;
};

// Size: 0x10
struct FAbcCompressionSettings {
    /* 0x0000 */ bool bMergeMeshes;
    /* 0x0001 */ bool bBakeMatrixAnimation;
    /* 0x0002 */ EBaseCalculationType BaseCalculationType;
    /* 0x0004 */ float PercentageOfTotalBases;
    /* 0x0008 */ int32_t MaxNumberOfBases;
    /* 0x000c */ float MinimumNumberOfVertexInfluencePercentage;
};

// Size: 0x1c
struct FAbcConversionSettings {
    /* 0x0000 */ EAbcConversionPreset Preset;
    /* 0x0001 */ bool bFlipU;
    /* 0x0002 */ bool bFlipV;
    /* 0x0004 */ FVector Scale;
    /* 0x0010 */ FVector Rotation;
};

// Size: 0x10
struct FAbcGeometryCacheSettings {
    /* 0x0000 */ bool bFlattenTracks;
    /* 0x0001 */ bool bApplyConstantTopologyOptimizations;
    /* 0x0002 */ bool bCalculateMotionVectorsDuringImport;
    /* 0x0003 */ EAbcGeometryCacheMotionVectorsImport MotionVectors;
    /* 0x0004 */ bool bOptimizeIndexBuffers;
    /* 0x0008 */ float CompressedPositionPrecision;
    /* 0x000c */ int32_t CompressedTextureCoordinatesNumberOfBits;
};

// Size: 0xa8
class UAbcImportSettings : public UObject {
    /* 0x0030 */ EAlembicImportType ImportType;
    /* 0x0034 */ FAbcSamplingSettings SamplingSettings;
    /* 0x004c */ FAbcNormalGenerationSettings NormalGenerationSettings;
    /* 0x0058 */ FAbcMaterialSettings MaterialSettings;
    /* 0x005c */ FAbcCompressionSettings CompressionSettings;
    /* 0x006c */ FAbcStaticMeshSettings StaticMeshSettings;
    /* 0x0070 */ FAbcGeometryCacheSettings GeometryCacheSettings;
    /* 0x0080 */ FAbcConversionSettings ConversionSettings;
};

// Size: 0x2
struct FAbcMaterialSettings {
    /* 0x0000 */ bool bCreateMaterials;
    /* 0x0001 */ bool bFindMaterials;
};

// Size: 0xc
struct FAbcNormalGenerationSettings {
    /* 0x0000 */ bool bForceOneSmoothingGroupPerObject;
    /* 0x0004 */ float HardEdgeAngleThreshold;
    /* 0x0008 */ bool bRecomputeNormals;
    /* 0x0009 */ bool bIgnoreDegenerateTriangles;
    /* 0x000a */ bool bSkipComputingTangents;
};

// Size: 0x18
struct FAbcSamplingSettings {
    /* 0x0000 */ EAlembicSamplingType SamplingType;
    /* 0x0004 */ int32_t FrameSteps;
    /* 0x0008 */ float TimeSteps;
    /* 0x000c */ int32_t FrameStart;
    /* 0x0010 */ int32_t FrameEnd;
    /* 0x0014 */ bool bSkipEmpty;
};

// Size: 0x3
struct FAbcStaticMeshSettings {
    /* 0x0000 */ bool bMergeMeshes;
    /* 0x0001 */ bool bPropagateMatrixTransformations;
    /* 0x0002 */ bool bGenerateLightmapUVs;
};

// Size: 0xa8
class UAlembicTestCommandlet : public UCommandlet {
};

enum class EAbcConversionPreset {
    Maya = 0,
    Max = 1,
    Custom = 2,
    EAbcConversionPreset_MAX = 3,
};

enum class EAbcGeometryCacheMotionVectorsImport {
    NoMotionVectors = 0,
    ImportAbcVelocitiesAsMotionVectors = 1,
    CalculateMotionVectorsDuringImport = 2,
    EAbcGeometryCacheMotionVectorsImport_MAX = 3,
};

enum class EAlembicImportType {
    StaticMesh = 0,
    GeometryCache = 1,
    Skeletal = 2,
    EAlembicImportType_MAX = 3,
};

enum class EAlembicSamplingType {
    PerFrame = 0,
    PerXFrames = 1,
    PerTimeStep = 2,
    EAlembicSamplingType_MAX = 3,
};

enum class EBaseCalculationType {
    None = 0,
    PercentageBased = 1,
    FixedNumber = 2,
    NoCompression = 3,
    EBaseCalculationType_MAX = 4,
};

// Size: 0x88
class UAndroidFileMediaSourceFactory : public UFactory {
};

// Size: 0x38
class UAndroidMediaSettings : public UObject {
    /* 0x0030 */ bool CacheableVideoSampleBuffers;
};

// Size: 0x50
class UAndroidPermissionCallbackProxy : public UObject {
    /* 0x0030 */ FMulticastInlineDelegate OnPermissionsGrantedDynamicDelegate;
};

// Size: 0x30
class UAndroidPermissionFunctionLibrary : public UBlueprintFunctionLibrary {

    static UAndroidPermissionCallbackProxy* AcquirePermissions(const TArray<FString>& Permissions);
    static bool CheckPermission(FString permission);
};

// Size: 0x90
class UAndroidSDKSettings : public UObject {
    /* 0x0030 */ FDirectoryPath SDKPath;
    /* 0x0040 */ FDirectoryPath NDKPath;
    /* 0x0050 */ FDirectoryPath JavaPath;
    /* 0x0060 */ FString SDKAPILevel;
    /* 0x0070 */ FString NDKAPILevel;
};

// Size: 0x2f0
class UAndroidRuntimeSettings : public UObject {
    /* 0x0030 */ FString PackageName;
    /* 0x0040 */ int32_t StoreVersion;
    /* 0x0044 */ int32_t StoreVersionOffsetArmV7;
    /* 0x0048 */ int32_t StoreVersionOffsetArm64;
    /* 0x004c */ int32_t StoreVersionOffsetX8664;
    /* 0x0050 */ FString ApplicationDisplayName;
    /* 0x0060 */ FString VersionDisplayName;
    /* 0x0070 */ int32_t MinSDKVersion;
    /* 0x0074 */ int32_t TargetSDKVersion;
    /* 0x0078 */ uint8_t InstallLocation;
    /* 0x0079 */ bool bEnableGradle;
    /* 0x007a */ bool bEnableLint;
    /* 0x007b */ bool bPackageDataInsideApk;
    /* 0x007c */ bool bCreateAllPlatformsInstall;
    /* 0x007d */ bool bDisableVerifyOBBOnStartUp;
    /* 0x007e */ bool bForceSmallOBBFiles;
    /* 0x007f */ bool bAllowLargeOBBFiles;
    /* 0x0080 */ bool bAllowPatchOBBFile;
    /* 0x0081 */ bool bAllowOverflowOBBFiles;
    /* 0x0082 */ bool bUseExternalFilesDir;
    /* 0x0083 */ bool bPublicLogFiles;
    /* 0x0084 */ uint8_t Orientation;
    /* 0x0088 */ float MaxAspectRatio;
    /* 0x008c */ bool bUseDisplayCutout;
    /* 0x008d */ bool bRestoreNotificationsOnReboot;
    /* 0x008e */ bool bFullScreen;
    /* 0x008f */ bool bEnableNewKeyboard;
    /* 0x0090 */ uint8_t DepthBufferPreference;
    /* 0x0091 */ bool bValidateTextureFormats;
    /* 0x0092 */ bool bEnableBundle;
    /* 0x0093 */ bool bEnableUniversalAPK;
    /* 0x0094 */ bool bBundleABISplit;
    /* 0x0095 */ bool bBundleLanguageSplit;
    /* 0x0096 */ bool bBundleDensitySplit;
    /* 0x0098 */ TArray<FString> ExtraManifestNodeTags;
    /* 0x00a8 */ TArray<FString> ExtraApplicationNodeTags;
    /* 0x00b8 */ FString ExtraApplicationSettings;
    /* 0x00c8 */ TArray<FString> ExtraActivityNodeTags;
    /* 0x00d8 */ FString ExtraActivitySettings;
    /* 0x00e8 */ TArray<FString> ExtraPermissions;
    /* 0x00f8 */ bool bAndroidVoiceEnabled;
    /* 0x0100 */ TArray<uint8_t> PackageForOculusMobile;
    /* 0x0110 */ bool bRemoveOSIG;
    /* 0x0118 */ TArray<uint8_t> GoogleVRCaps;
    /* 0x0128 */ bool bGoogleVRSustainedPerformance;
    /* 0x0130 */ FString KeyStore;
    /* 0x0140 */ FString KeyAlias;
    /* 0x0150 */ FString KeyStorePassword;
    /* 0x0160 */ FString KeyPassword;
    /* 0x0170 */ bool bBuildForArmV7;
    /* 0x0171 */ bool bBuildForArm64;
    /* 0x0172 */ bool bBuildForX8664;
    /* 0x0173 */ bool bBuildForES31;
    /* 0x0174 */ bool bSupportsVulkan;
    /* 0x0175 */ bool bSupportsVulkanSM5;
    /* 0x0176 */ uint8_t ClangSanitizer;
    /* 0x0177 */ bool bAndroidOpenGLSupportsBackbufferSampling;
    /* 0x0178 */ bool bDetectVulkanByDefault;
    /* 0x0179 */ bool bBuildWithHiddenSymbolVisibility;
    /* 0x017a */ bool bSaveSymbols;
    /* 0x017b */ bool bForceLDLinker;
    /* 0x017c */ bool bEnableGooglePlaySupport;
    /* 0x017d */ bool bUseGetAccounts;
    /* 0x0180 */ FString GamesAppID;
    /* 0x0190 */ TArray<FGooglePlayAchievementMapping> AchievementMap;
    /* 0x01a0 */ TArray<FGooglePlayLeaderboardMapping> LeaderboardMap;
    /* 0x01b0 */ bool bEnableSnapshots;
    /* 0x01b1 */ bool bSupportAdMob;
    /* 0x01b8 */ FString AdMobAdUnitID;
    /* 0x01c8 */ TArray<FString> AdMobAdUnitIDs;
    /* 0x01d8 */ FString GooglePlayLicenseKey;
    /* 0x01e8 */ FString GCMClientSenderID;
    /* 0x01f8 */ bool bShowLaunchImage;
    /* 0x01f9 */ bool bAllowIMU;
    /* 0x01fa */ bool bAllowControllers;
    /* 0x01fb */ bool bBlockAndroidKeysOnControllers;
    /* 0x01fc */ bool bControllersBlockDeviceFeedback;
    /* 0x01fd */ uint8_t AndroidAudio;
    /* 0x0200 */ int32_t AudioSampleRate;
    /* 0x0204 */ int32_t AudioCallbackBufferFrameSize;
    /* 0x0208 */ int32_t AudioNumBuffersToEnqueue;
    /* 0x020c */ int32_t AudioMaxChannels;
    /* 0x0210 */ int32_t AudioNumSourceWorkers;
    /* 0x0218 */ FString SpatializationPlugin;
    /* 0x0228 */ FString ReverbPlugin;
    /* 0x0238 */ FString OcclusionPlugin;
    /* 0x0248 */ FPlatformRuntimeAudioCompressionOverrides CompressionOverrides;
    /* 0x0258 */ bool bUseAudioStreamCaching;
    /* 0x025c */ int32_t CacheSizeKB;
    /* 0x0260 */ int32_t MaxChunkSizeOverrideKB;
    /* 0x0264 */ bool bResampleForDevice;
    /* 0x0268 */ int32_t SoundCueCookQualityIndex;
    /* 0x026c */ float MaxSampleRate;
    /* 0x0270 */ float HighSampleRate;
    /* 0x0274 */ float MedSampleRate;
    /* 0x0278 */ float LowSampleRate;
    /* 0x027c */ float MinSampleRate;
    /* 0x0280 */ float CompressionQualityModifier;
    /* 0x0284 */ float AutoStreamingThreshold;
    /* 0x0288 */ uint8_t AndroidGraphicsDebugger;
    /* 0x0290 */ FDirectoryPath MaliGraphicsDebuggerPath;
    /* 0x02a0 */ bool bEnableMaliPerfCounters;
    /* 0x02a1 */ bool bMultiTargetFormat_ETC2;
    /* 0x02a2 */ bool bMultiTargetFormat_DXT;
    /* 0x02a3 */ bool bMultiTargetFormat_ASTC;
    /* 0x02a4 */ float TextureFormatPriority_ETC2;
    /* 0x02a8 */ float TextureFormatPriority_DXT;
    /* 0x02ac */ float TextureFormatPriority_ASTC;
    /* 0x02b0 */ FString SDKAPILevelOverride;
    /* 0x02c0 */ FString NDKAPILevelOverride;
    /* 0x02d0 */ bool bStreamLandscapeMeshLODs;
    /* 0x02d1 */ bool bEnableDomStorage;
};

enum class EAndroidAudio {
    Default = 0,
    OGG = 1,
    ADPCM = 2,
    EAndroidAudio_MAX = 3,
};

enum class EAndroidDepthBufferPreference {
    Default = 0,
    Bits16 = 16,
    Bits24 = 24,
    Bits32 = 32,
    EAndroidDepthBufferPreference_MAX = 33,
};

enum class EAndroidGraphicsDebugger {
    None = 0,
    Mali = 1,
    Adreno = 2,
    EAndroidGraphicsDebugger_MAX = 3,
};

enum class EAndroidInstallLocation {
    InternalOnly = 0,
    PreferExternal = 1,
    Auto = 2,
    EAndroidInstallLocation_MAX = 3,
};

enum class EAndroidScreenOrientation {
    Portrait = 0,
    ReversePortrait = 1,
    SensorPortrait = 2,
    Landscape = 3,
    ReverseLandscape = 4,
    SensorLandscape = 5,
    Sensor = 6,
    FullSensor = 7,
    EAndroidScreenOrientation_MAX = 8,
};

enum class EClangSanitizer {
    None = 0,
    Address = 1,
    HwAddress = 2,
    UndefinedBehavior = 3,
    UndefinedBehaviorMinimal = 4,
    EClangSanitizer_MAX = 5,
};

enum class EGoogleVRCaps {
    Cardboard = 0,
    Daydream33 = 1,
    Daydream63 = 2,
    Daydream66 = 3,
    EGoogleVRCaps_MAX = 4,
};

enum class EGoogleVRMode {
    Cardboard = 0,
    Daydream = 1,
    DaydreamAndCardboard = 2,
    EGoogleVRMode_MAX = 3,
};

enum class EOculusMobileDevice {
    Quest = 1,
    Quest2 = 2,
    EOculusMobileDevice_MAX = 3,
};

// Size: 0x20
struct FGooglePlayAchievementMapping {
    /* 0x0000 */ FString Name;
    /* 0x0010 */ FString AchievementID;
};

// Size: 0x20
struct FGooglePlayLeaderboardMapping {
    /* 0x0000 */ FString Name;
    /* 0x0010 */ FString LeaderboardID;
};

// Size: 0x80
struct FAnimBlueprintFunctionPinInfo {
    /* 0x0000 */ FName Name;
    /* 0x0010 */ FEdGraphPinType Type;
};

// Size: 0x30
class UAnimBlueprintPostCompileValidation : public UObject {
};

// Size: 0x120
struct FAnimGraphNodePropertyBinding {
    /* 0x0000 */ FEdGraphPinType PinType;
    /* 0x0070 */ FEdGraphPinType PromotedPinType;
    /* 0x00e0 */ FName PropertyName;
    /* 0x00f0 */ FText PathAsText;
    /* 0x0108 */ TArray<FString> PropertyPath;
    /* 0x0118 */ EAnimGraphNodePropertyBindingType Type;
    /* 0x011c */ bool bIsBound;
    /* 0x011d */ bool bIsPromotion;
};

// Size: 0x3d0
class UAnimGraphNode_AimOffsetLookAt : public UAnimGraphNode_BlendSpaceBase {
    /* 0x0180 */ FAnimNode_AimOffsetLookAt Node;
};

// Size: 0x6f0
class UAnimGraphNode_AnimDynamics : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_AnimDynamics Node;
    /* 0x0630 */ bool bPreviewLive;
    /* 0x0631 */ bool bShowLinearLimits;
    /* 0x0632 */ bool bShowAngularLimits;
    /* 0x0633 */ bool bShowPlanarLimit;
    /* 0x0634 */ bool bShowSphericalLimit;
    /* 0x0635 */ bool bShowCollisionSpheres;
    /* 0x0638 */ USkeletalMeshComponent* LastPreviewComponent;
};

// Size: 0x250
class UAnimGraphNode_ApplyAdditive : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_ApplyAdditive Node;
};

// Size: 0x2b0
class UAnimGraphNode_ApplyLimits : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_ApplyLimits Node;
};

// Size: 0x258
class UAnimGraphNode_ApplyMeshSpaceAdditive : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_ApplyMeshSpaceAdditive Node;
};

// Size: 0x180
class UAnimGraphNode_AssetPlayerBase : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimationGroupReference SyncGroup;
};

// Size: 0x170
class UAnimGraphNode_Base : public UK2Node {
    /* 0x00c8 */ TArray<FOptionalPinFromProperty> ShowPinForProperties;
    /* 0x00d8 */ TMap<FName, FAnimGraphNodePropertyBinding> PropertyBindings;
    /* 0x0128 */ EBlueprintUsage BlueprintUsage;
};

// Size: 0x1e8
class UAnimGraphNode_BlendBoneByChannel : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_BlendBoneByChannel BlendNode;
};

// Size: 0x178
class UAnimGraphNode_BlendListBase : public UAnimGraphNode_Base {
};

// Size: 0x218
class UAnimGraphNode_BlendListByBool : public UAnimGraphNode_BlendListBase {
    /* 0x0178 */ FAnimNode_BlendListByBool Node;
};

// Size: 0x268
class UAnimGraphNode_BlendListByEnum : public UAnimGraphNode_BlendListBase {
    /* 0x0180 */ FAnimNode_BlendListByEnum Node;
    /* 0x0230 */ UEnum* BoundEnum;
    /* 0x0238 */ TArray<FName> VisibleEnumEntries;
};

// Size: 0x218
class UAnimGraphNode_BlendListByInt : public UAnimGraphNode_BlendListBase {
    /* 0x0178 */ FAnimNode_BlendListByInt Node;
};

// Size: 0x180
class UAnimGraphNode_BlendSpaceBase : public UAnimGraphNode_AssetPlayerBase {
};

// Size: 0x2f8
class UAnimGraphNode_BlendSpaceEvaluator : public UAnimGraphNode_BlendSpaceBase {
    /* 0x0180 */ FAnimNode_BlendSpaceEvaluator Node;
};

// Size: 0x2f0
class UAnimGraphNode_BlendSpacePlayer : public UAnimGraphNode_BlendSpaceBase {
    /* 0x0180 */ FAnimNode_BlendSpacePlayer Node;
};

// Size: 0x2f0
class UAnimGraphNode_BoneDrivenController : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_BoneDrivenController Node;
};

// Size: 0x3f0
class UAnimGraphNode_CCDIK : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_CCDIK Node;
};

// Size: 0x198
class UAnimGraphNode_ComponentToLocalSpace : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_ConvertComponentToLocalSpace Node;
};

// Size: 0x3d0
class UAnimGraphNode_Constraint : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_Constraint Node;
};

// Size: 0x340
class UAnimGraphNode_CopyBone : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_CopyBone Node;
};

// Size: 0x2c8
class UAnimGraphNode_CopyBoneDelta : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_CopyBoneDelta Node;
};

// Size: 0x348
class UAnimGraphNode_CopyPoseFromMesh : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_CopyPoseFromMesh Node;
};

// Size: 0x1b8
class UAnimGraphNode_CurveSource : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_CurveSource Node;
};

// Size: 0x198
class UAnimGraphNode_CustomProperty : public UAnimGraphNode_Base {
    /* 0x0178 */ TArray<FName> KnownExposableProperties;
    /* 0x0188 */ TArray<FName> ExposedPropertyNames;
};

// Size: 0x1b0
class UAnimGraphNode_CustomTransitionResult : public UAnimGraphNode_StateResult {
};

// Size: 0x3b0
class UAnimGraphNode_Fabrik : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_Fabrik Node;
};

// Size: 0x2f8
class UAnimGraphNode_HandIKRetargeting : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_HandIKRetargeting Node;
};

// Size: 0x188
class UAnimGraphNode_IdentityPose : public UAnimGraphNode_RefPoseBase {
};

// Size: 0x1e8
class UAnimGraphNode_Inertialization : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_Inertialization Node;
};

// Size: 0x240
class UAnimGraphNode_LayeredBoneBlend : public UAnimGraphNode_BlendListBase {
    /* 0x0178 */ FAnimNode_LayeredBoneBlend Node;
};

// Size: 0x2c0
class UAnimGraphNode_LegIK : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_LegIK Node;
};

// Size: 0x248
class UAnimGraphNode_LinkedAnimGraph : public UAnimGraphNode_LinkedAnimGraphBase {
    /* 0x0198 */ FAnimNode_LinkedAnimGraph Node;
};

// Size: 0x198
class UAnimGraphNode_LinkedAnimGraphBase : public UAnimGraphNode_CustomProperty {
};

// Size: 0x290
class UAnimGraphNode_LinkedAnimLayer : public UAnimGraphNode_LinkedAnimGraphBase {
    /* 0x0198 */ FAnimNode_LinkedAnimLayer Node;
    /* 0x0278 */ FGuid InterfaceGuid;
};

// Size: 0x2f0
class UAnimGraphNode_LinkedInputPose : public UAnimGraphNode_Base {
    /* 0x0178 */ FAnimNode_LinkedInputPose Node;
    /* 0x02a0 */ TArray<FAnimBlueprintFunctionPinInfo> Inputs;
    /* 0x02b0 */ FMemberReference FunctionReference;
    /* 0x02e8 */ int32_t InputPoseIndex;
};

// Size: 0x188
class UAnimGraphNode_LocalRefPose : public UAnimGraphNode_RefPoseBase {
};

// Size: 0x198
class UAnimGraphNode_LocalToComponentSpace : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_ConvertLocalToComponentSpace Node;
};

// Size: 0x510
class UAnimGraphNode_LookAt : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_LookAt Node;
};

// Size: 0x1b8
class UAnimGraphNode_MakeDynamicAdditive : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_MakeDynamicAdditive Node;
};

// Size: 0x180
class UAnimGraphNode_MeshRefPose : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_MeshSpaceRefPose Node;
};

// Size: 0x358
class UAnimGraphNode_ModifyBone : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_ModifyBone Node;
};

// Size: 0x1d0
class UAnimGraphNode_ModifyCurve : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_ModifyCurve Node;
};

// Size: 0x1c8
class UAnimGraphNode_MultiWayBlend : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_MultiWayBlend Node;
};

// Size: 0x2d0
class UAnimGraphNode_ObserveBone : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_ObserveBone Node;
};

// Size: 0x240
class UAnimGraphNode_PoseBlendNode : public UAnimGraphNode_PoseHandler {
    /* 0x0180 */ FAnimNode_PoseBlendNode Node;
};

// Size: 0x248
class UAnimGraphNode_PoseByName : public UAnimGraphNode_AssetPlayerBase {
    /* 0x0180 */ FAnimNode_PoseByName Node;
};

// Size: 0x3d0
class UAnimGraphNode_PoseDriver : public UAnimGraphNode_PoseHandler {
    /* 0x0180 */ FAnimNode_PoseDriver Node;
    /* 0x0320 */ float AxisLength;
    /* 0x0324 */ int32_t ConeSubdivision;
    /* 0x0328 */ bool bDrawDebugCones;
    /* 0x0348 */ USkeletalMeshComponent* LastPreviewComponent;
};

// Size: 0x180
class UAnimGraphNode_PoseHandler : public UAnimGraphNode_AssetPlayerBase {
};

// Size: 0x220
class UAnimGraphNode_PoseSnapshot : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_PoseSnapshot Node;
};

// Size: 0x1e8
class UAnimGraphNode_RandomPlayer : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_RandomPlayer Node;
};

// Size: 0x188
class UAnimGraphNode_RefPoseBase : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_RefPose Node;
};

// Size: 0x2a0
class UAnimGraphNode_ResetRoot : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_ResetRoot Node;
};

// Size: 0xa20
class UAnimGraphNode_RigidBody : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_RigidBody Node;
};

// Size: 0x1b0
class UAnimGraphNode_Root : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_Root Node;
};

// Size: 0x218
class UAnimGraphNode_RotateRootBone : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_RotateRootBone Node;
};

// Size: 0x340
class UAnimGraphNode_RotationMultiplier : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_RotationMultiplier Node;
};

// Size: 0x3a8
class UAnimGraphNode_RotationOffsetBlendSpace : public UAnimGraphNode_BlendSpaceBase {
    /* 0x0180 */ FAnimNode_RotationOffsetBlendSpace Node;
};

// Size: 0x300
class UAnimGraphNode_SaveCachedPose : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_SaveCachedPose Node;
    /* 0x02d0 */ FString CacheName;
};

// Size: 0x1f8
class UAnimGraphNode_ScaleChainLength : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_ScaleChainLength Node;
};

// Size: 0x1f8
class UAnimGraphNode_SequenceEvaluator : public UAnimGraphNode_AssetPlayerBase {
    /* 0x0180 */ FAnimNode_SequenceEvaluator Node;
};

// Size: 0x298
class UAnimGraphNode_SequencePlayer : public UAnimGraphNode_AssetPlayerBase {
    /* 0x0180 */ FAnimNode_SequencePlayer Node;
};

// Size: 0x170
class UAnimGraphNode_SkeletalControlBase : public UAnimGraphNode_Base {
};

// Size: 0x248
class UAnimGraphNode_Slot : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_Slot Node;
};

// Size: 0x4c0
class UAnimGraphNode_SplineIK : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_SplineIK Node;
};

// Size: 0x378
class UAnimGraphNode_SpringBone : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_SpringBone Node;
};

// Size: 0x248
class UAnimGraphNode_StateMachine : public UAnimGraphNode_StateMachineBase {
    /* 0x0198 */ FAnimNode_StateMachine Node;
};

// Size: 0x198
class UAnimGraphNode_StateMachineBase : public UAnimGraphNode_Base {
    /* 0x0170 */ UAnimationStateMachineGraph* EditorStateMachineGraph;
};

// Size: 0x1b0
class UAnimGraphNode_StateResult : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_StateResult Node;
};

// Size: 0x4e0
class UAnimGraphNode_Trail : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_Trail Node;
};

// Size: 0x268
class UAnimGraphNode_TransitionPoseEvaluator : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_TransitionPoseEvaluator Node;
};

// Size: 0x198
class UAnimGraphNode_TransitionResult : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_TransitionResult Node;
};

// Size: 0x310
class UAnimGraphNode_TwistCorrectiveNode : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_TwistCorrectiveNode Node;
};

// Size: 0x4b0
class UAnimGraphNode_TwoBoneIK : public UAnimGraphNode_SkeletalControlBase {
    /* 0x0170 */ FAnimNode_TwoBoneIK Node;
    /* 0x0420 */ bool bEnableDebugDraw;
};

// Size: 0x248
class UAnimGraphNode_TwoWayBlend : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_TwoWayBlend BlendNode;
};

// Size: 0x1c0
class UAnimGraphNode_UseCachedPose : public UAnimGraphNode_Base {
    /* 0x0170 */ FAnimNode_UseCachedPose Node;
    /* 0x01a8 */ TWeakObjectPtr<UAnimGraphNode_SaveCachedPose> SaveCachedPoseNode;
    /* 0x01b0 */ FString NameOfCache;
};

// Size: 0x300
class UAnimPreviewAttacheInstance : public UAnimInstance {
};

// Size: 0x9f0
struct FAnimPreviewAttacheInstanceProxy : public FAnimInstanceProxy {
};

// Size: 0x320
class UAnimPreviewInstance : public UAnimSingleNodeInstance {
    /* 0x0318 */ uint8_t MontagePreviewType;
    /* 0x031c */ int32_t MontagePreviewStartSectionIdx;
};

// Size: 0xc90
struct FAnimPreviewInstanceProxy : public FAnimSingleNodeInstanceProxy {
};

// Size: 0xd0
class UAnimStateConduitNode : public UAnimStateNodeBase {
    /* 0x00c8 */ UEdGraph* BoundGraph;
};

// Size: 0xc8
class UAnimStateEntryNode : public UEdGraphNode {
};

// Size: 0x380
class UAnimStateNode : public UAnimStateNodeBase {
    /* 0x00c8 */ UEdGraph* BoundGraph;
    /* 0x00d0 */ uint8_t StateType;
    /* 0x00d8 */ FAnimNotifyEvent StateEntered;
    /* 0x01b8 */ FAnimNotifyEvent StateLeft;
    /* 0x0298 */ FAnimNotifyEvent StateFullyBlended;
    /* 0x0378 */ bool bAlwaysResetOnEntry;
};

// Size: 0xc8
class UAnimStateNodeBase : public UEdGraphNode {
};

// Size: 0x400
class UAnimStateTransitionNode : public UAnimStateNodeBase {
    /* 0x00c8 */ UEdGraph* BoundGraph;
    /* 0x00d0 */ UEdGraph* CustomTransitionGraph;
    /* 0x00d8 */ int32_t PriorityOrder;
    /* 0x00dc */ float CrossfadeDuration;
    /* 0x00e0 */ uint8_t CrossfadeMode;
    /* 0x00e1 */ EAlphaBlendOption BlendMode;
    /* 0x00e8 */ UCurveFloat* CustomBlendCurve;
    /* 0x00f0 */ UBlendProfile* BlendProfile;
    /* 0x00f8 */ bool bAutomaticRuleBasedOnSequencePlayerInState;
    /* 0x00f9 */ uint8_t LogicType;
    /* 0x0100 */ FAnimNotifyEvent TransitionStart;
    /* 0x01e0 */ FAnimNotifyEvent TransitionEnd;
    /* 0x02c0 */ FAnimNotifyEvent TransitionInterrupt;
    /* 0x03a0 */ bool Bidirectional;
    /* 0x03a1 */ bool bSharedRules;
    /* 0x03a2 */ bool bSharedCrossfade;
    /* 0x03a8 */ FString SharedRulesName;
    /* 0x03b8 */ FGuid SharedRulesGuid;
    /* 0x03c8 */ FLinearColor SharedColor;
    /* 0x03d8 */ FString SharedCrossfadeName;
    /* 0x03e8 */ FGuid SharedCrossfadeGuid;
    /* 0x03f8 */ int32_t SharedCrossfadeIdx;
};

// Size: 0x40
class UAnimationConduitGraphSchema : public UEdGraphSchema_K2 {
};

// Size: 0xd8
class UAnimationCustomTransitionGraph : public UAnimationGraph {
    /* 0x00d0 */ UAnimGraphNode_CustomTransitionResult* MyResultNode;
};

// Size: 0xa8
class UAnimationCustomTransitionSchema : public UAnimationGraphSchema {
};

// Size: 0xd0
class UAnimationGraph : public UEdGraph {
    /* 0x00c8 */ FAnimGraphBlendOptions BlendOptions;
};

// Size: 0xa8
class UAnimationGraphSchema : public UEdGraphSchema_K2 {
    /* 0x0040 */ FString PN_SequenceName;
    /* 0x0050 */ FName NAME_NeverAsPin;
    /* 0x005c */ FName NAME_PinHiddenByDefault;
    /* 0x0068 */ FName NAME_PinShownByDefault;
    /* 0x0074 */ FName NAME_AlwaysAsPin;
    /* 0x0080 */ FName NAME_CustomizeProperty;
    /* 0x008c */ FName NAME_OnEvaluate;
    /* 0x0098 */ FName DefaultEvaluationHandlerName;
};

// Size: 0xd8
class UAnimationStateGraph : public UAnimationGraph {
    /* 0x00d0 */ UAnimGraphNode_StateResult* MyResultNode;
};

// Size: 0xa8
class UAnimationStateGraphSchema : public UAnimationGraphSchema {
};

// Size: 0xc0
class UAnimationStateMachineGraph : public UEdGraph {
    /* 0x00b0 */ UAnimStateEntryNode* EntryNode;
    /* 0x00b8 */ UAnimGraphNode_StateMachineBase* OwnerAnimGraphNode;
};

// Size: 0x30
class UAnimationStateMachineSchema : public UEdGraphSchema {
};

// Size: 0xd8
class UAnimationTransitionGraph : public UAnimationGraph {
    /* 0x00d0 */ UAnimGraphNode_TransitionResult* MyResultNode;
};

// Size: 0x40
class UAnimationTransitionSchema : public UEdGraphSchema_K2 {
};

// Size: 0x30
class IClassVariableCreator : public UInterface {
};

enum class EAnimGraphNodePropertyBindingType {
    None = 0,
    Property = 1,
    Function = 2,
    EAnimGraphNodePropertyBindingType_MAX = 3,
};

enum class EAnimStateType {
    AST_SingleAnimation = 0,
    AST_BlendGraph = 1,
    AST_MAX = 2,
};

enum class EBlueprintUsage {
    NoProperties = 0,
    DoesNotUseBlueprint = 1,
    UsesBlueprint = 2,
    EBlueprintUsage_MAX = 3,
};

enum class EMontagePreviewType {
    EMPT_Normal = 0,
    EMPT_AllSections = 1,
    EMPT_MAX = 2,
};

enum class ETransitionGetter {
    AnimationAsset_GetCurrentTime = 0,
    AnimationAsset_GetLength = 1,
    AnimationAsset_GetCurrentTimeFraction = 2,
    AnimationAsset_GetTimeFromEnd = 3,
    AnimationAsset_GetTimeFromEndFraction = 4,
    CurrentState_ElapsedTime = 5,
    CurrentState_GetBlendWeight = 6,
    CurrentTransitionDuration = 7,
    ArbitraryState_GetBlendWeight = 8,
    ETransitionGetter_MAX = 9,
};

// Size: 0x100
struct FEdGraphSchemaAction_NewStateComment : public FEdGraphSchemaAction {
};

// Size: 0x108
struct FEdGraphSchemaAction_NewStateNode : public FEdGraphSchemaAction {
};

// Size: 0x1a0
class UK2Node_AnimGetter : public UK2Node_CallFunction {
    /* 0x0158 */ UAnimGraphNode_Base* SourceNode;
    /* 0x0160 */ UAnimStateNodeBase* SourceStateNode;
    /* 0x0168 */ UClass* GetterClass;
    /* 0x0170 */ UAnimBlueprint* SourceAnimBlueprint;
    /* 0x0178 */ FText CachedTitle;
    /* 0x0190 */ TArray<FString> Contexts;
};

// Size: 0xf8
class UK2Node_PlayMontage : public UK2Node_BaseAsyncTask {
};

// Size: 0xe0
class UK2Node_TransitionRuleGetter : public UK2Node {
    /* 0x00c8 */ uint8_t GetterType;
    /* 0x00d0 */ UAnimGraphNode_Base* AssociatedAnimAssetPlayerNode;
    /* 0x00d8 */ UAnimStateNode* AssociatedStateNode;
};

// Size: 0x50
struct FNodeSpawnData {
    /* 0x0000 */ FText CachedTitle;
    /* 0x0018 */ UAnimGraphNode_Base* SourceNode;
    /* 0x0020 */ UAnimStateNodeBase* SourceStateNode;
    /* 0x0028 */ UClass* AnimInstanceClass;
    /* 0x0030 */ UAnimBlueprint* SourceBlueprint;
    /* 0x0038 */ UField* Getter;
    /* 0x0040 */ FString GetterContextString;
};

// Size: 0x2c
struct FAngularRangeLimit {
    /* 0x0000 */ FVector LimitMin;
    /* 0x000c */ FVector LimitMax;
    /* 0x0018 */ FBoneReference Bone;
};

// Size: 0xa0
struct FAnimLegIKData {
};

// Size: 0x34
struct FAnimLegIKDefinition {
    /* 0x0000 */ FBoneReference IKFootBone;
    /* 0x0014 */ FBoneReference FKFootBone;
    /* 0x0028 */ int32_t NumBonesInLimb;
    /* 0x002c */ float MinRotationAngle;
    /* 0x0030 */ uint8_t FootBoneForwardAxis;
    /* 0x0031 */ uint8_t HingeRotationAxis;
    /* 0x0032 */ bool bEnableRotationLimit;
    /* 0x0033 */ bool bEnableKneeTwistCorrection;
};

// Size: 0x1d0
struct FAnimNode_AimOffsetLookAt : public FAnimNode_BlendSpacePlayer {
    /* 0x0150 */ FPoseLink BasePose;
    /* 0x0168 */ int32_t LODThreshold;
    /* 0x016c */ FName SourceSocketName;
    /* 0x0178 */ FName PivotSocketName;
    /* 0x0184 */ FVector LookAtLocation;
    /* 0x0190 */ FVector SocketAxis;
    /* 0x019c */ float Alpha;
};

// Size: 0x4c0
struct FAnimNode_AnimDynamics : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ float LinearDampingOverride;
    /* 0x0124 */ float AngularDampingOverride;
    /* 0x0190 */ FBoneReference RelativeSpaceBone;
    /* 0x01a4 */ FBoneReference BoundBone;
    /* 0x01b8 */ FBoneReference ChainEnd;
    /* 0x01cc */ FVector BoxExtents;
    /* 0x01d8 */ FVector LocalJointOffset;
    /* 0x01e4 */ float GravityScale;
    /* 0x01e8 */ FVector GravityOverride;
    /* 0x01f4 */ float LinearSpringConstant;
    /* 0x01f8 */ float AngularSpringConstant;
    /* 0x01fc */ float WindScale;
    /* 0x0200 */ FVector ComponentLinearAccScale;
    /* 0x020c */ FVector ComponentLinearVelScale;
    /* 0x0218 */ FVector ComponentAppliedLinearAccClamp;
    /* 0x0224 */ float AngularBiasOverride;
    /* 0x0228 */ int32_t NumSolverIterationsPreUpdate;
    /* 0x022c */ int32_t NumSolverIterationsPostUpdate;
    /* 0x0230 */ FAnimPhysConstraintSetup ConstraintSetup;
    /* 0x0288 */ TArray<FAnimPhysSphericalLimit> SphericalLimits;
    /* 0x0298 */ float SphereCollisionRadius;
    /* 0x029c */ FVector ExternalForce;
    /* 0x02a8 */ TArray<FAnimPhysPlanarLimit> PlanarLimits;
    /* 0x02b8 */ AnimPhysCollisionType CollisionType;
    /* 0x02b9 */ AnimPhysSimSpaceType SimulationSpace;
    /* 0x02bc */ bool bUseSphericalLimits;
    /* 0x02bc */ bool bUsePlanarLimit;
    /* 0x02bc */ bool bDoUpdate;
    /* 0x02bc */ bool bDoEval;
    /* 0x02bc */ bool bOverrideLinearDamping;
    /* 0x02bc */ bool bOverrideAngularBias;
    /* 0x02bc */ bool bOverrideAngularDamping;
    /* 0x02bc */ bool bEnableWind;
    /* 0x02bd */ bool bUseGravityOverride;
    /* 0x02bd */ bool bLinearSpring;
    /* 0x02bd */ bool bAngularSpring;
    /* 0x02bd */ bool bChain;
    /* 0x02c0 */ FRotationRetargetingInfo RetargetingSettings;
};

// Size: 0xe0
struct FAnimNode_ApplyAdditive : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink Base;
    /* 0x0028 */ FPoseLink Additive;
    /* 0x0040 */ float Alpha;
    /* 0x0044 */ FInputScaleBias AlphaScaleBias;
    /* 0x004c */ int32_t LODThreshold;
    /* 0x0050 */ FInputAlphaBoolBlend AlphaBoolBlend;
    /* 0x0098 */ FName AlphaCurveName;
    /* 0x00a4 */ FInputScaleBiasClamp AlphaScaleBiasClamp;
    /* 0x00d8 */ EAnimAlphaInputType AlphaInputType;
    /* 0x00d9 */ bool bAlphaBoolEnabled;
};

// Size: 0x140
struct FAnimNode_ApplyLimits : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ TArray<FAngularRangeLimit> AngularRangeLimits;
    /* 0x0130 */ TArray<FVector> AngularOffsets;
};

// Size: 0x78
struct FAnimNode_BlendBoneByChannel : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink A;
    /* 0x0028 */ FPoseLink B;
    /* 0x0040 */ TArray<FBlendBoneByChannelEntry> BoneDefinitions;
    /* 0x0060 */ float Alpha;
    /* 0x0068 */ FInputScaleBias AlphaScaleBias;
    /* 0x0070 */ uint8_t TransformsSpace;
};

// Size: 0x98
struct FAnimNode_BlendListBase : public FAnimNode_Base {
    /* 0x0010 */ TArray<FPoseLink> BlendPose;
    /* 0x0020 */ TArray<float> BlendTime;
    /* 0x0030 */ EBlendListTransitionType TransitionType;
    /* 0x0031 */ EAlphaBlendOption BlendType;
    /* 0x0032 */ bool bResetChildOnActivation;
    /* 0x0038 */ UCurveFloat* CustomBlendCurve;
    /* 0x0040 */ UBlendProfile* BlendProfile;
};

// Size: 0xa0
struct FAnimNode_BlendListByBool : public FAnimNode_BlendListBase {
    /* 0x0098 */ bool bActiveValue;
};

// Size: 0xb0
struct FAnimNode_BlendListByEnum : public FAnimNode_BlendListBase {
    /* 0x0098 */ TArray<int32_t> EnumToPoseIndex;
    /* 0x00a8 */ uint8_t ActiveEnumValue;
};

// Size: 0xa0
struct FAnimNode_BlendListByInt : public FAnimNode_BlendListBase {
    /* 0x0098 */ int32_t ActiveChildIndex;
};

// Size: 0xf8
struct FAnimNode_BlendSpaceEvaluator : public FAnimNode_BlendSpacePlayer {
    /* 0x00f0 */ float NormalizedTime;
};

// Size: 0xf0
struct FAnimNode_BlendSpacePlayer : public FAnimNode_AssetPlayerBase {
    /* 0x0040 */ float X;
    /* 0x0044 */ float Y;
    /* 0x0048 */ float Z;
    /* 0x004c */ float PlayRate;
    /* 0x0050 */ bool bLoop;
    /* 0x0051 */ bool bResetPlayTimeWhenBlendSpaceChanges;
    /* 0x0054 */ float StartPosition;
    /* 0x0058 */ UBlendSpaceBase* BlendSpace;
    /* 0x00e8 */ UBlendSpaceBase* PreviousBlendSpace;
};

// Size: 0x180
struct FAnimNode_BoneDrivenController : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference SourceBone;
    /* 0x0138 */ UCurveFloat* DrivingCurve;
    /* 0x0140 */ float Multiplier;
    /* 0x0144 */ float RangeMin;
    /* 0x0148 */ float RangeMax;
    /* 0x014c */ float RemappedMin;
    /* 0x0150 */ float RemappedMax;
    /* 0x0154 */ FName ParameterName;
    /* 0x0160 */ FBoneReference TargetBone;
    /* 0x0174 */ uint8_t TargetComponent;
    /* 0x0175 */ EDrivenDestinationMode DestinationMode;
    /* 0x0176 */ EDrivenBoneModificationMode ModificationMode;
    /* 0x0177 */ uint8_t SourceComponent;
    /* 0x0178 */ bool bUseRange;
    /* 0x0178 */ bool bAffectTargetTranslationX;
    /* 0x0178 */ bool bAffectTargetTranslationY;
    /* 0x0178 */ bool bAffectTargetTranslationZ;
    /* 0x0178 */ bool bAffectTargetRotationX;
    /* 0x0178 */ bool bAffectTargetRotationY;
    /* 0x0178 */ bool bAffectTargetRotationZ;
    /* 0x0178 */ bool bAffectTargetScaleX;
    /* 0x0179 */ bool bAffectTargetScaleY;
    /* 0x0179 */ bool bAffectTargetScaleZ;
};

// Size: 0x200
struct FAnimNode_CCDIK : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FVector EffectorLocation;
    /* 0x012c */ uint8_t EffectorLocationSpace;
    /* 0x0130 */ FBoneSocketTarget EffectorTarget;
    /* 0x01a0 */ FBoneReference TipBone;
    /* 0x01b4 */ FBoneReference RootBone;
    /* 0x01c8 */ float Precision;
    /* 0x01cc */ int32_t MaxIterations;
    /* 0x01d0 */ bool bStartFromTail;
    /* 0x01d1 */ bool bEnableRotationLimit;
    /* 0x01d8 */ TArray<float> RotationLimitPerJoints;
};

// Size: 0x1e0
struct FAnimNode_Constraint : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference BoneToModify;
    /* 0x0138 */ TArray<FConstraint> ConstraintSetup;
    /* 0x0148 */ TArray<float> ConstraintWeights;
};

// Size: 0x150
struct FAnimNode_CopyBone : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference SourceBone;
    /* 0x0134 */ FBoneReference TargetBone;
    /* 0x0148 */ bool bCopyTranslation;
    /* 0x0149 */ bool bCopyRotation;
    /* 0x014a */ bool bCopyScale;
    /* 0x014b */ uint8_t ControlSpace;
};

// Size: 0x158
struct FAnimNode_CopyBoneDelta : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference SourceBone;
    /* 0x0134 */ FBoneReference TargetBone;
    /* 0x0148 */ bool bCopyTranslation;
    /* 0x0149 */ bool bCopyRotation;
    /* 0x014a */ bool bCopyScale;
    /* 0x014b */ CopyBoneDeltaMode CopyMode;
    /* 0x014c */ float TranslationMultiplier;
    /* 0x0150 */ float RotationMultiplier;
    /* 0x0154 */ float ScaleMultiplier;
};

// Size: 0x1d8
struct FAnimNode_CopyPoseFromMesh : public FAnimNode_Base {
    /* 0x0010 */ TWeakObjectPtr<USkeletalMeshComponent> SourceMeshComponent;
    /* 0x0018 */ bool bUseAttachedParent;
    /* 0x0018 */ bool bCopyCurves;
    /* 0x0019 */ bool bCopyCustomAttributes;
    /* 0x001a */ bool bUseMeshPose;
    /* 0x001c */ FName RootBoneToCopy;
};

// Size: 0x48
struct FAnimNode_CurveSource : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink SourcePose;
    /* 0x0028 */ FName SourceBinding;
    /* 0x0034 */ float Alpha;
    /* 0x0038 */ TScriptInterface<ICurveSourceInterface> CurveSource;
};

// Size: 0x240
struct FAnimNode_Fabrik : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FTransform EffectorTransform;
    /* 0x0150 */ FBoneSocketTarget EffectorTarget;
    /* 0x01c0 */ FBoneReference TipBone;
    /* 0x01d4 */ FBoneReference RootBone;
    /* 0x01e8 */ float Precision;
    /* 0x01ec */ int32_t MaxIterations;
    /* 0x01f0 */ uint8_t EffectorTransformSpace;
    /* 0x01f1 */ uint8_t EffectorRotationSource;
    /* 0x01f2 */ bool bEnableDebugDraw;
    /* 0x01f4 */ FBoneReference EffectorTransformBone;
};

// Size: 0x188
struct FAnimNode_HandIKRetargeting : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference RightHandFK;
    /* 0x0134 */ FBoneReference LeftHandFK;
    /* 0x0148 */ FBoneReference RightHandIK;
    /* 0x015c */ FBoneReference LeftHandIK;
    /* 0x0170 */ TArray<FBoneReference> IKBonesToMove;
    /* 0x0180 */ float HandFKWeight;
};

// Size: 0xc8
struct FAnimNode_LayeredBoneBlend : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink BasePose;
    /* 0x0028 */ TArray<FPoseLink> BlendPoses;
    /* 0x0038 */ TArray<FInputBlendPose> LayerSetup;
    /* 0x0048 */ TArray<float> BlendWeights;
    /* 0x0058 */ bool bMeshSpaceRotationBlend;
    /* 0x0059 */ bool bMeshSpaceScaleBlend;
    /* 0x005a */ uint8_t CurveBlendOption;
    /* 0x005b */ bool bBlendRootMotionBasedOnRootBone;
    /* 0x0060 */ int32_t LODThreshold;
    /* 0x0068 */ TArray<FPerBoneBlendWeight> PerBoneBlendWeights;
    /* 0x0078 */ FGuid SkeletonGuid;
    /* 0x0088 */ FGuid VirtualBoneGuid;
};

// Size: 0x150
struct FAnimNode_LegIK : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ float ReachPrecision;
    /* 0x0124 */ int32_t MaxIterations;
    /* 0x0128 */ TArray<FAnimLegIKDefinition> LegsDefinition;
};

// Size: 0x320
struct FAnimNode_LookAt : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference BoneToModify;
    /* 0x0140 */ FBoneSocketTarget LookAtTarget;
    /* 0x01b0 */ FVector LookAtLocation;
    /* 0x01bc */ FAxis LookAt_Axis;
    /* 0x01cc */ bool bUseLookUpAxis;
    /* 0x01cd */ uint8_t InterpolationType;
    /* 0x01d0 */ FAxis LookUp_Axis;
    /* 0x01e0 */ float LookAtClamp;
    /* 0x01e4 */ float InterpolationTime;
    /* 0x01e8 */ float InterpolationTriggerThreashold;
    /* 0x01ec */ FBoneReference LookAtBone;
    /* 0x0200 */ FName LookAtSocket;
    /* 0x020c */ uint8_t LookAtAxis;
    /* 0x0210 */ FVector CustomLookAtAxis;
    /* 0x021c */ uint8_t LookUpAxis;
    /* 0x0220 */ FVector CustomLookUpAxis;
};

// Size: 0x48
struct FAnimNode_MakeDynamicAdditive : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink Base;
    /* 0x0028 */ FPoseLink Additive;
    /* 0x0040 */ bool bMeshSpaceAdditive;
};

// Size: 0x10
struct FAnimNode_MeshSpaceRefPose : public FAnimNode_Base {
};

// Size: 0x160
struct FAnimNode_ModifyBone : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference BoneToModify;
    /* 0x0134 */ FVector Translation;
    /* 0x0140 */ FRotator Rotation;
    /* 0x014c */ FVector Scale;
    /* 0x0158 */ uint8_t TranslationMode;
    /* 0x0159 */ uint8_t RotationMode;
    /* 0x015a */ uint8_t ScaleMode;
    /* 0x015b */ uint8_t TranslationSpace;
    /* 0x015c */ uint8_t RotationSpace;
    /* 0x015d */ uint8_t ScaleSpace;
};

// Size: 0x60
struct FAnimNode_ModifyCurve : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink SourcePose;
    /* 0x0028 */ TArray<float> CurveValues;
    /* 0x0038 */ TArray<FName> CurveNames;
    /* 0x0058 */ float Alpha;
    /* 0x005c */ EModifyCurveApplyMode ApplyMode;
};

// Size: 0x50
struct FAnimNode_MultiWayBlend : public FAnimNode_Base {
    /* 0x0010 */ TArray<FPoseLink> Poses;
    /* 0x0020 */ TArray<float> DesiredAlphas;
    /* 0x0040 */ FInputScaleBias AlphaScaleBias;
    /* 0x0048 */ bool bAdditiveNode;
    /* 0x0049 */ bool bNormalizeAlpha;
};

// Size: 0x160
struct FAnimNode_ObserveBone : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference BoneToObserve;
    /* 0x0134 */ uint8_t DisplaySpace;
    /* 0x0135 */ bool bRelativeToRefPose;
    /* 0x0138 */ FVector Translation;
    /* 0x0144 */ FRotator Rotation;
    /* 0x0150 */ FVector Scale;
};

// Size: 0xb0
struct FAnimNode_PoseBlendNode : public FAnimNode_PoseHandler {
    /* 0x0088 */ FPoseLink SourcePose;
    /* 0x00a0 */ EAlphaBlendOption BlendOption;
    /* 0x00a8 */ UCurveFloat* CustomCurve;
};

// Size: 0xa8
struct FAnimNode_PoseByName : public FAnimNode_PoseHandler {
    /* 0x0088 */ FName PoseName;
    /* 0x0094 */ float PoseWeight;
};

// Size: 0x1a0
struct FAnimNode_PoseDriver : public FAnimNode_PoseHandler {
    /* 0x0088 */ FPoseLink SourcePose;
    /* 0x00a0 */ TArray<FBoneReference> SourceBones;
    /* 0x00b0 */ TArray<FBoneReference> OnlyDriveBones;
    /* 0x00c0 */ TArray<FPoseDriverTarget> PoseTargets;
    /* 0x0100 */ FBoneReference EvalSpaceBone;
    /* 0x0114 */ FRBFParams RBFParams;
    /* 0x0140 */ FBoneReference SourceBone;
    /* 0x0154 */ uint8_t TwistAxis;
    /* 0x0155 */ EPoseDriverType Type;
    /* 0x0158 */ float RadialScaling;
    /* 0x015c */ EPoseDriverSource DriveSource;
    /* 0x015d */ EPoseDriverOutput DriveOutput;
    /* 0x015e */ bool bOnlyDriveSelectedBones;
    /* 0x0164 */ bool bSoloDrivenOnly;
    /* 0x0168 */ int32_t LODThreshold;
};

// Size: 0x88
struct FAnimNode_PoseHandler : public FAnimNode_AssetPlayerBase {
    /* 0x0040 */ UPoseAsset* PoseAsset;
};

// Size: 0xb0
struct FAnimNode_PoseSnapshot : public FAnimNode_Base {
    /* 0x0010 */ FName SnapshotName;
    /* 0x0020 */ FPoseSnapshot Snapshot;
    /* 0x0060 */ ESnapshotSourceMode Mode;
};

// Size: 0x78
struct FAnimNode_RandomPlayer : public FAnimNode_Base {
    /* 0x0010 */ TArray<FRandomPlayerSequenceEntry> Entries;
    /* 0x0070 */ bool bShuffleMode;
};

// Size: 0x18
struct FAnimNode_RefPose : public FAnimNode_Base {
    /* 0x0010 */ uint8_t RefPoseType;
};

// Size: 0x130
struct FAnimNode_ResetRoot : public FAnimNode_SkeletalControlBase {
};

// Size: 0x8b0
struct FAnimNode_RigidBody : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ UPhysicsAsset* OverridePhysicsAsset;
    /* 0x01c8 */ FVector OverrideWorldGravity;
    /* 0x01d4 */ FVector ExternalForce;
    /* 0x01e0 */ FVector ComponentLinearAccScale;
    /* 0x01ec */ FVector ComponentLinearVelScale;
    /* 0x01f8 */ FVector ComponentAppliedLinearAccClamp;
    /* 0x0204 */ FSimSpaceSettings SimSpaceSettings;
    /* 0x0244 */ float CachedBoundsScale;
    /* 0x0248 */ FBoneReference BaseBoneRef;
    /* 0x025c */ uint8_t OverlapChannel;
    /* 0x025d */ ESimulationSpace SimulationSpace;
    /* 0x025e */ bool bForceDisableCollisionBetweenConstraintBodies;
    /* 0x0260 */ bool bEnableWorldGeometry;
    /* 0x0260 */ bool bOverrideWorldGravity;
    /* 0x0260 */ bool bTransferBoneVelocities;
    /* 0x0260 */ bool bFreezeIncomingPoseOnStart;
    /* 0x0260 */ bool bClampLinearTranslationLimitToRefPose;
    /* 0x0264 */ float WorldSpaceMinimumScale;
    /* 0x0268 */ float EvaluationResetTime;
    /* 0x026d */ bool bComponentSpaceSimulation;
};

// Size: 0xa8
struct FAnimNode_RotateRootBone : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink BasePose;
    /* 0x0028 */ float Pitch;
    /* 0x002c */ float Yaw;
    /* 0x0030 */ FInputScaleBiasClamp PitchScaleBiasClamp;
    /* 0x0060 */ FInputScaleBiasClamp YawScaleBiasClamp;
    /* 0x0090 */ FRotator MeshToComponent;
};

// Size: 0x150
struct FAnimNode_RotationMultiplier : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference TargetBone;
    /* 0x0134 */ FBoneReference SourceBone;
    /* 0x0148 */ float Multiplier;
    /* 0x014c */ uint8_t RotationAxisToRefer;
    /* 0x014d */ bool bIsAdditive;
};

// Size: 0x1a8
struct FAnimNode_RotationOffsetBlendSpace : public FAnimNode_BlendSpacePlayer {
    /* 0x00f0 */ FPoseLink BasePose;
    /* 0x0108 */ int32_t LODThreshold;
    /* 0x010c */ float Alpha;
    /* 0x0110 */ FInputScaleBias AlphaScaleBias;
    /* 0x0118 */ FInputAlphaBoolBlend AlphaBoolBlend;
    /* 0x0160 */ FName AlphaCurveName;
    /* 0x016c */ FInputScaleBiasClamp AlphaScaleBiasClamp;
    /* 0x01a0 */ EAnimAlphaInputType AlphaInputType;
    /* 0x01a1 */ bool bAlphaBoolEnabled;
};

// Size: 0x88
struct FAnimNode_ScaleChainLength : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink InputPose;
    /* 0x0028 */ float DefaultChainLength;
    /* 0x002c */ FBoneReference ChainStartBone;
    /* 0x0040 */ FBoneReference ChainEndBone;
    /* 0x0054 */ FVector TargetLocation;
    /* 0x0060 */ float Alpha;
    /* 0x0068 */ FInputScaleBias AlphaScaleBias;
    /* 0x0070 */ EScaleChainInitialLength ChainInitialLength;
};

// Size: 0x58
struct FAnimNode_SequenceEvaluator : public FAnimNode_AssetPlayerBase {
    /* 0x0040 */ UAnimSequenceBase* Sequence;
    /* 0x0048 */ float ExplicitTime;
    /* 0x004c */ bool bShouldLoop;
    /* 0x004d */ bool bTeleportToExplicitTime;
    /* 0x004e */ uint8_t ReinitializationBehavior;
    /* 0x0050 */ float StartPosition;
};

// Size: 0x120
struct FAnimNode_SkeletalControlBase : public FAnimNode_Base {
    /* 0x0010 */ FComponentSpacePoseLink ComponentPose;
    /* 0x0028 */ int32_t LODThreshold;
    /* 0x002c */ float ActualAlpha;
    /* 0x0030 */ EAnimAlphaInputType AlphaInputType;
    /* 0x0031 */ bool bAlphaBoolEnabled;
    /* 0x0034 */ float Alpha;
    /* 0x0038 */ FInputScaleBias AlphaScaleBias;
    /* 0x0040 */ FInputAlphaBoolBlend AlphaBoolBlend;
    /* 0x0088 */ FName AlphaCurveName;
    /* 0x0094 */ FInputScaleBiasClamp AlphaScaleBiasClamp;
};

// Size: 0x58
struct FAnimNode_Slot : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink Source;
    /* 0x0028 */ FName SlotName;
    /* 0x0034 */ bool bAlwaysUpdateSourcePose;
};

// Size: 0x2d0
struct FAnimNode_SplineIK : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference StartBone;
    /* 0x0134 */ FBoneReference EndBone;
    /* 0x0148 */ ESplineBoneAxis BoneAxis;
    /* 0x0149 */ bool bAutoCalculateSpline;
    /* 0x014c */ int32_t PointCount;
    /* 0x0150 */ TArray<FTransform> ControlPoints;
    /* 0x0160 */ float Roll;
    /* 0x0164 */ float TwistStart;
    /* 0x0168 */ float TwistEnd;
    /* 0x0170 */ FAlphaBlend TwistBlend;
    /* 0x01a0 */ float Stretch;
    /* 0x01a4 */ float Offset;
};

// Size: 0x188
struct FAnimNode_SpringBone : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference SpringBone;
    /* 0x0134 */ float MaxDisplacement;
    /* 0x0138 */ float SpringStiffness;
    /* 0x013c */ float SpringDamping;
    /* 0x0140 */ float ErrorResetThresh;
    /* 0x0180 */ bool bNoZSpring;
    /* 0x0181 */ bool bLimitDisplacement;
    /* 0x0181 */ bool bTranslateX;
    /* 0x0181 */ bool bTranslateY;
    /* 0x0181 */ bool bTranslateZ;
    /* 0x0181 */ bool bRotateX;
    /* 0x0181 */ bool bRotateY;
    /* 0x0181 */ bool bRotateZ;
};

// Size: 0x40
struct FAnimNode_StateResult : public FAnimNode_Root {
};

// Size: 0x2f0
struct FAnimNode_Trail : public FAnimNode_SkeletalControlBase {
    /* 0x0150 */ FBoneReference TrailBone;
    /* 0x0164 */ int32_t ChainLength;
    /* 0x0168 */ uint8_t ChainBoneAxis;
    /* 0x0169 */ bool bInvertChainBoneAxis;
    /* 0x0169 */ bool bLimitStretch;
    /* 0x0169 */ bool bLimitRotation;
    /* 0x0169 */ bool bUsePlanarLimit;
    /* 0x0169 */ bool bActorSpaceFakeVel;
    /* 0x0169 */ bool bReorientParentToChild;
    /* 0x0169 */ bool bEnableDebug;
    /* 0x016a */ bool bShowBaseMotion;
    /* 0x016a */ bool bShowTrailLocation;
    /* 0x016a */ bool bShowLimit;
    /* 0x016c */ float DebugLifeTime;
    /* 0x0170 */ float TrailRelaxation;
    /* 0x0174 */ float MaxDeltaTime;
    /* 0x0178 */ float RelaxationSpeedScale;
    /* 0x0180 */ FRuntimeFloatCurve TrailRelaxationSpeed;
    /* 0x0208 */ FInputScaleBiasClamp RelaxationSpeedScaleInputProcessor;
    /* 0x0238 */ TArray<FRotationLimit> RotationLimits;
    /* 0x0248 */ TArray<FVector> RotationOffsets;
    /* 0x0258 */ TArray<FAnimPhysPlanarLimit> PlanarLimits;
    /* 0x0268 */ float StretchLimit;
    /* 0x026c */ FVector FakeVelocity;
    /* 0x0278 */ FBoneReference BaseJoint;
    /* 0x028c */ float TrailBoneRotationBlendAlpha;
    /* 0x0290 */ float LastBoneRotationAnimAlphaBlend;
};

// Size: 0x1a0
struct FAnimNode_TwistCorrectiveNode : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FReferenceBoneFrame BaseFrame;
    /* 0x0144 */ FReferenceBoneFrame TwistFrame;
    /* 0x0168 */ FAxis TwistPlaneNormalAxis;
    /* 0x0178 */ float RangeMax;
    /* 0x017c */ float RemappedMin;
    /* 0x0180 */ float RemappedMax;
    /* 0x0184 */ FAnimCurveParam Curve;
};

// Size: 0x2b0
struct FAnimNode_TwoBoneIK : public FAnimNode_SkeletalControlBase {
    /* 0x0120 */ FBoneReference IKBone;
    /* 0x0134 */ float StartStretchRatio;
    /* 0x0138 */ float MaxStretchScale;
    /* 0x013c */ FVector2D StretchLimits;
    /* 0x0144 */ bool bNoTwist;
    /* 0x0148 */ FName JointTargetSpaceBoneName;
    /* 0x0154 */ FName EffectorSpaceBoneName;
    /* 0x0160 */ FVector EffectorLocation;
    /* 0x0170 */ FBoneSocketTarget EffectorTarget;
    /* 0x01e0 */ FVector JointTargetLocation;
    /* 0x01f0 */ FBoneSocketTarget JointTarget;
    /* 0x0260 */ FAxis TwistAxis;
    /* 0x0270 */ uint8_t EffectorLocationSpace;
    /* 0x0271 */ uint8_t JointTargetLocationSpace;
    /* 0x0272 */ bool bAllowStretching;
    /* 0x0272 */ bool bTakeRotationFromEffectorSpace;
    /* 0x0272 */ bool bMaintainEffectorRelRot;
    /* 0x0272 */ bool bAllowTwist;
};

// Size: 0xd8
struct FAnimNode_TwoWayBlend : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink A;
    /* 0x0028 */ FPoseLink B;
    /* 0x0040 */ EAnimAlphaInputType AlphaInputType;
    /* 0x0041 */ bool bAlphaBoolEnabled;
    /* 0x0041 */ bool bResetChildOnActivation;
    /* 0x0044 */ float Alpha;
    /* 0x0048 */ FInputScaleBias AlphaScaleBias;
    /* 0x0050 */ FInputAlphaBoolBlend AlphaBoolBlend;
    /* 0x0098 */ FName AlphaCurveName;
    /* 0x00a4 */ FInputScaleBiasClamp AlphaScaleBiasClamp;
};

// Size: 0x50
class UAnimNotify_PlayMontageNotify : public UAnimNotify {
    /* 0x0040 */ FName NotifyName;
};

// Size: 0x48
class UAnimNotify_PlayMontageNotifyWindow : public UAnimNotifyState {
    /* 0x0038 */ FName NotifyName;
};

enum class AnimPhysAngularConstraintType {
    Angular = 0,
    Cone = 1,
    AnimPhysAngularConstraintType_MAX = 2,
};

// Size: 0x54
struct FAnimPhysConstraintSetup {
    /* 0x0000 */ AnimPhysLinearConstraintType LinearXLimitType;
    /* 0x0001 */ AnimPhysLinearConstraintType LinearYLimitType;
    /* 0x0002 */ AnimPhysLinearConstraintType LinearZLimitType;
    /* 0x0004 */ FVector LinearAxesMin;
    /* 0x0010 */ FVector LinearAxesMax;
    /* 0x001c */ AnimPhysAngularConstraintType AngularConstraintType;
    /* 0x001d */ AnimPhysTwistAxis TwistAxis;
    /* 0x001e */ AnimPhysTwistAxis AngularTargetAxis;
    /* 0x0020 */ float ConeAngle;
    /* 0x0024 */ float AngularXAngle;
    /* 0x0028 */ float AngularYAngle;
    /* 0x002c */ float AngularZAngle;
    /* 0x0030 */ FVector AngularLimitsMin;
    /* 0x003c */ FVector AngularLimitsMax;
    /* 0x0048 */ FVector AngularTarget;
};

enum class AnimPhysLinearConstraintType {
    Free = 0,
    Limited = 1,
    AnimPhysLinearConstraintType_MAX = 2,
};

// Size: 0x50
struct FAnimPhysPlanarLimit {
    /* 0x0000 */ FBoneReference DrivingBone;
    /* 0x0020 */ FTransform PlaneTransform;
};

enum class AnimPhysSimSpaceType {
    Component = 0,
    Actor = 1,
    World = 2,
    RootRelative = 3,
    BoneRelative = 4,
    AnimPhysSimSpaceType_MAX = 5,
};

// Size: 0x28
struct FAnimPhysSphericalLimit {
    /* 0x0000 */ FBoneReference DrivingBone;
    /* 0x0014 */ FVector SphereLocalOffset;
    /* 0x0020 */ float LimitRadius;
    /* 0x0024 */ ESphericalLimitType LimitType;
};

// Size: 0x300
class UAnimSequencerInstance : public UAnimInstance {
};

// Size: 0xae0
struct FAnimSequencerInstanceProxy : public FAnimInstanceProxy {
};

// Size: 0x2c
struct FBlendBoneByChannelEntry {
    /* 0x0000 */ FBoneReference SourceBone;
    /* 0x0014 */ FBoneReference TargetBone;
    /* 0x0028 */ bool bBlendTranslation;
    /* 0x0029 */ bool bBlendRotation;
    /* 0x002a */ bool bBlendScale;
};

// Size: 0x70
struct FBoneSocketTarget {
    /* 0x0000 */ bool bUseSocket;
    /* 0x0004 */ FBoneReference BoneReference;
    /* 0x0020 */ FSocketReference SocketReference;
};

// Size: 0x20
struct FConstraint {
    /* 0x0000 */ FBoneReference TargetBone;
    /* 0x0014 */ EConstraintOffsetOption OffsetOption;
    /* 0x0015 */ ETransformConstraintType TransformType;
    /* 0x0016 */ FFilterOptionPerAxis PerAxis;
};

enum class CopyBoneDeltaMode {
    Accumulate = 0,
    Copy = 1,
    CopyBoneDeltaMode_MAX = 2,
};

enum class EBlendListTransitionType {
    StandardBlend = 0,
    Inertialization = 1,
    EBlendListTransitionType_MAX = 2,
};

enum class EBoneModificationMode {
    BMM_Ignore = 0,
    BMM_Replace = 1,
    BMM_Additive = 2,
    BMM_MAX = 3,
};

enum class EConstraintOffsetOption {
    None = 0,
    Offset_RefPose = 1,
    EConstraintOffsetOption_MAX = 2,
};

enum class EDrivenBoneModificationMode {
    AddToInput = 0,
    ReplaceComponent = 1,
    AddToRefPose = 2,
    EDrivenBoneModificationMode_MAX = 3,
};

enum class EDrivenDestinationMode {
    Bone = 0,
    MorphTarget = 1,
    MaterialParameter = 2,
    EDrivenDestinationMode_MAX = 3,
};

enum class EEasingFuncType {
    Linear = 0,
    Sinusoidal = 1,
    Cubic = 2,
    QuadraticInOut = 3,
    CubicInOut = 4,
    HermiteCubic = 5,
    QuarticInOut = 6,
    QuinticInOut = 7,
    CircularIn = 8,
    CircularOut = 9,
    CircularInOut = 10,
    ExpIn = 11,
    ExpOut = 12,
    ExpInOut = 13,
    CustomCurve = 14,
    EEasingFuncType_MAX = 15,
};

enum class EInterpolationBlend {
    Linear = 0,
    Cubic = 1,
    Sinusoidal = 2,
    EaseInOutExponent2 = 3,
    EaseInOutExponent3 = 4,
    EaseInOutExponent4 = 5,
    EaseInOutExponent5 = 6,
    MAX = 7,
};

enum class EModifyCurveApplyMode {
    Add = 0,
    Scale = 1,
    Blend = 2,
    WeightedMovingAverage = 3,
    RemapCurve = 4,
    EModifyCurveApplyMode_MAX = 5,
};

enum class EPoseDriverOutput {
    DrivePoses = 0,
    DriveCurves = 1,
    EPoseDriverOutput_MAX = 2,
};

enum class EPoseDriverSource {
    Rotation = 0,
    Translation = 1,
    EPoseDriverSource_MAX = 2,
};

enum class EPoseDriverType {
    SwingAndTwist = 0,
    SwingOnly = 1,
    Translation = 2,
    EPoseDriverType_MAX = 3,
};

enum class ERBFDistanceMethod {
    Euclidean = 0,
    Quaternion = 1,
    SwingAngle = 2,
    TwistAngle = 3,
    DefaultMethod = 4,
    ERBFDistanceMethod_MAX = 5,
};

enum class ERBFFunctionType {
    Gaussian = 0,
    Exponential = 1,
    Linear = 2,
    Cubic = 3,
    Quintic = 4,
    DefaultFunction = 5,
    ERBFFunctionType_MAX = 6,
};

enum class ERBFNormalizeMethod {
    OnlyNormalizeAboveOne = 0,
    AlwaysNormalize = 1,
    NormalizeWithinMedian = 2,
    NoNormalization = 3,
    ERBFNormalizeMethod_MAX = 4,
};

enum class ERBFSolverType {
    Additive = 0,
    Interpolative = 1,
    ERBFSolverType_MAX = 2,
};

enum class ERefPoseType {
    EIT_LocalSpace = 0,
    EIT_Additive = 1,
    EIT_MAX = 2,
};

enum class ERotationComponent {
    EulerX = 0,
    EulerY = 1,
    EulerZ = 2,
    QuaternionAngle = 3,
    SwingAngle = 4,
    TwistAngle = 5,
    ERotationComponent_MAX = 6,
};

enum class EScaleChainInitialLength {
    FixedDefaultLengthValue = 0,
    Distance = 1,
    ChainLength = 2,
    EScaleChainInitialLength_MAX = 3,
};

enum class ESequenceEvalReinit {
    NoReset = 0,
    StartPosition = 1,
    ExplicitTime = 2,
    ESequenceEvalReinit_MAX = 3,
};

enum class ESimulationSpace {
    ComponentSpace = 0,
    WorldSpace = 1,
    BaseBoneSpace = 2,
    ESimulationSpace_MAX = 3,
};

enum class ESnapshotSourceMode {
    NamedSnapshot = 0,
    SnapshotPin = 1,
    ESnapshotSourceMode_MAX = 2,
};

enum class ESphericalLimitType {
    Inner = 0,
    Outer = 1,
    ESphericalLimitType_MAX = 2,
};

enum class ESplineBoneAxis {
    None = 0,
    X = 1,
    Y = 2,
    Z = 3,
    ESplineBoneAxis_MAX = 4,
};

// Size: 0x38
struct FIKChain {
};

// Size: 0x40
struct FIKChainLink {
};

// Size: 0x30
class UKismetAnimationLibrary : public UBlueprintFunctionLibrary {

    static float K2_CalculateVelocityFromPositionHistory(float DeltaSeconds, FVector Position, FPositionHistory& History, int32_t NumberOfSamples, float VelocityMin, float VelocityMax);
    static float K2_CalculateVelocityFromSockets(float DeltaSeconds, USkeletalMeshComponent* Component, const FName SocketOrBoneName, const FName ReferenceSocketOrBone, uint8_t SocketSpace, FVector OffsetInBoneSpace, FPositionHistory& History, int32_t NumberOfSamples, float VelocityMin, float VelocityMax, EEasingFuncType EasingType, const FRuntimeFloatCurve& CustomCurve);
    static FVector K2_DirectionBetweenSockets(const USkeletalMeshComponent* Component, const FName SocketOrBoneNameFrom, const FName SocketOrBoneNameTo);
    static float K2_DistanceBetweenTwoSocketsAndMapRange(const USkeletalMeshComponent* Component, const FName SocketOrBoneNameA, uint8_t SocketSpaceA, const FName SocketOrBoneNameB, uint8_t SocketSpaceB, bool bRemapRange, float InRangeMin, float InRangeMax, float OutRangeMin, float OutRangeMax);
    static float K2_EndProfilingTimer(bool bLog, FString LogPrefix);
    static FTransform K2_LookAt(const FTransform& CurrentTransform, const FVector& TargetPosition, FVector LookAtVector, bool bUseUpVector, FVector UpVector, float ClampConeInDegree);
    static float K2_MakePerlinNoiseAndRemap(float Value, float RangeOutMin, float RangeOutMax);
    static FVector K2_MakePerlinNoiseVectorAndRemap(float X, float Y, float Z, float RangeOutMinX, float RangeOutMaxX, float RangeOutMinY, float RangeOutMaxY, float RangeOutMinZ, float RangeOutMaxZ);
    static void K2_StartProfilingTimer();
    static void K2_TwoBoneIK(const FVector& RootPos, const FVector& JointPos, const FVector& EndPos, const FVector& JointTarget, const FVector& Effector, FVector& OutJointPos, FVector& OutEndPos, bool bAllowStretching, float StartStretchRatio, float MaxStretchScale);
};

// Size: 0xb0
class UPlayMontageCallbackProxy : public UObject {
    /* 0x0030 */ FMulticastInlineDelegate OnCompleted;
    /* 0x0040 */ FMulticastInlineDelegate OnBlendOut;
    /* 0x0050 */ FMulticastInlineDelegate OnInterrupted;
    /* 0x0060 */ FMulticastInlineDelegate OnNotifyBegin;
    /* 0x0070 */ FMulticastInlineDelegate OnNotifyEnd;

    static UPlayMontageCallbackProxy* CreateProxyObjectForPlayMontage(USkeletalMeshComponent* InSkeletalMeshComponent, UAnimMontage* MontageToPlay, float PlayRate, float StartingPosition, FName StartingSection);
    void OnMontageBlendingOut(UAnimMontage* Montage, bool bInterrupted);
    void OnMontageEnded(UAnimMontage* Montage, bool bInterrupted);
    void OnNotifyBeginReceived(FName NotifyName, const FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
    void OnNotifyEndReceived(FName NotifyName, const FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
};

// Size: 0xc0
struct FPoseDriverTarget {
    /* 0x0000 */ TArray<FPoseDriverTransform> BoneTransforms;
    /* 0x0010 */ FRotator TargetRotation;
    /* 0x001c */ float TargetScale;
    /* 0x0020 */ ERBFDistanceMethod DistanceMethod;
    /* 0x0021 */ ERBFFunctionType FunctionType;
    /* 0x0022 */ bool bApplyCustomCurve;
    /* 0x0028 */ FRichCurve CustomCurve;
    /* 0x00a8 */ FName DrivenName;
    /* 0x00bc */ bool bIsHidden;
};

// Size: 0x18
struct FPoseDriverTransform {
    /* 0x0000 */ FVector TargetTranslation;
    /* 0x000c */ FRotator TargetRotation;
};

// Size: 0x30
struct FPositionHistory {
    /* 0x0000 */ TArray<FVector> Positions;
    /* 0x0010 */ float Range;
};

// Size: 0x10
struct FRBFEntry {
    /* 0x0000 */ TArray<float> Values;
};

// Size: 0x2c
struct FRBFParams {
    /* 0x0000 */ int32_t TargetDimensions;
    /* 0x0004 */ ERBFSolverType SolverType;
    /* 0x0008 */ float Radius;
    /* 0x000c */ bool bAutomaticRadius;
    /* 0x000d */ ERBFFunctionType Function;
    /* 0x000e */ ERBFDistanceMethod DistanceMethod;
    /* 0x000f */ uint8_t TwistAxis;
    /* 0x0010 */ float WeightThreshold;
    /* 0x0014 */ ERBFNormalizeMethod NormalizeMethod;
    /* 0x0018 */ FVector MedianReference;
    /* 0x0024 */ float MedianMin;
    /* 0x0028 */ float MedianMax;
};

// Size: 0xa0
struct FRBFTarget : public FRBFEntry {
    /* 0x0010 */ float ScaleFactor;
    /* 0x0014 */ bool bApplyCustomCurve;
    /* 0x0018 */ FRichCurve CustomCurve;
    /* 0x0098 */ ERBFDistanceMethod DistanceMethod;
    /* 0x0099 */ ERBFFunctionType FunctionType;
};

// Size: 0x50
struct FRandomPlayerSequenceEntry {
    /* 0x0000 */ UAnimSequence* Sequence;
    /* 0x0008 */ float ChanceToPlay;
    /* 0x000c */ int32_t MinLoopCount;
    /* 0x0010 */ int32_t MaxLoopCount;
    /* 0x0014 */ float MinPlayRate;
    /* 0x0018 */ float MaxPlayRate;
    /* 0x0020 */ FAlphaBlend BlendIn;
};

// Size: 0x24
struct FReferenceBoneFrame {
    /* 0x0000 */ FBoneReference Bone;
    /* 0x0014 */ FAxis Axis;
};

// Size: 0x18
struct FRotationLimit {
    /* 0x0000 */ FVector LimitMin;
    /* 0x000c */ FVector LimitMax;
};

// Size: 0x130
struct FRotationRetargetingInfo {
    /* 0x0000 */ bool bEnabled;
    /* 0x0010 */ FTransform Source;
    /* 0x0040 */ FTransform Target;
    /* 0x0070 */ ERotationComponent RotationComponent;
    /* 0x0074 */ FVector TwistAxis;
    /* 0x0080 */ bool bUseAbsoluteAngle;
    /* 0x0084 */ float SourceMinimum;
    /* 0x0088 */ float SourceMaximum;
    /* 0x008c */ float TargetMinimum;
    /* 0x0090 */ float TargetMaximum;
    /* 0x0094 */ EEasingFuncType EasingType;
    /* 0x0098 */ FRuntimeFloatCurve CustomCurve;
    /* 0x0120 */ bool bFlipEasing;
    /* 0x0124 */ float EasingWeight;
    /* 0x0128 */ bool bClamp;
};

// Size: 0x30
class ISequencerAnimationSupport : public UInterface {
};

// Size: 0x40
struct FSimSpaceSettings {
    /* 0x0000 */ float MasterAlpha;
    /* 0x0004 */ float VelocityScaleZ;
    /* 0x0008 */ float MaxLinearVelocity;
    /* 0x000c */ float MaxAngularVelocity;
    /* 0x0010 */ float MaxLinearAcceleration;
    /* 0x0014 */ float MaxAngularAcceleration;
    /* 0x0018 */ float ExternalLinearDrag;
    /* 0x001c */ FVector ExternalLinearDragV;
    /* 0x0028 */ FVector ExternalLinearVelocity;
    /* 0x0034 */ FVector ExternalAngularVelocity;
};

// Size: 0x50
struct FSocketReference {
    /* 0x0030 */ FName SocketName;
};

// Size: 0x18
struct FSplineIKCachedBoneData {
    /* 0x0000 */ FBoneReference Bone;
    /* 0x0014 */ int32_t RefSkeletonIndex;
};

// Size: 0x40
struct FAimConstraintDescription : public FConstraintDescriptionEx {
    /* 0x0010 */ FAxis LookAt_Axis;
    /* 0x0020 */ FAxis LookUp_Axis;
    /* 0x0030 */ bool bUseLookUp;
    /* 0x0034 */ FVector LookUpTarget;
};

// Size: 0x80
class UAnimationDataSourceRegistry : public UObject {
    /* 0x0030 */ TMap<FName, TWeakObjectPtr<UObject>> DataSources;
};

// Size: 0x10
struct FAxis {
    /* 0x0000 */ FVector Axis;
    /* 0x000c */ bool bInLocalSpace;
};

// Size: 0x80
struct FCCDIKChainLink {
};

// Size: 0x80
struct FConstraintData {
    /* 0x0000 */ FConstraintDescriptor Constraint;
    /* 0x0010 */ float Weight;
    /* 0x0014 */ bool bMaintainOffset;
    /* 0x0020 */ FTransform Offset;
    /* 0x0050 */ FTransform CurrentTransform;
};

// Size: 0xd
struct FConstraintDescription {
    /* 0x0000 */ bool bTranslation;
    /* 0x0001 */ bool bRotation;
    /* 0x0002 */ bool bScale;
    /* 0x0003 */ bool bParent;
    /* 0x0004 */ FFilterOptionPerAxis TranslationAxes;
    /* 0x0007 */ FFilterOptionPerAxis RotationAxes;
    /* 0x000a */ FFilterOptionPerAxis ScaleAxes;
};

// Size: 0x10
struct FConstraintDescriptionEx {
    /* 0x0008 */ FFilterOptionPerAxis AxesFilterOption;
};

// Size: 0x10
struct FConstraintDescriptor {
    /* 0x0000 */ EConstraintType Type;
};

// Size: 0x60
struct FConstraintOffset {
    /* 0x0000 */ FVector Translation;
    /* 0x0010 */ FQuat Rotation;
    /* 0x0020 */ FVector Scale;
    /* 0x0030 */ FTransform Parent;
};

enum class EConstraintType {
    Transform = 0,
    Aim = 1,
    MAX = 2,
};

enum class ETransformConstraintType {
    Translation = 0,
    Rotation = 1,
    Scale = 2,
    Parent = 3,
    ETransformConstraintType_MAX = 4,
};

// Size: 0x24
struct FEulerTransform {
    /* 0x0000 */ FVector Location;
    /* 0x000c */ FRotator Rotation;
    /* 0x0018 */ FVector Scale;
};

// Size: 0x38
struct FFABRIKChainLink {
};

// Size: 0x3
struct FFilterOptionPerAxis {
    /* 0x0000 */ bool bX;
    /* 0x0001 */ bool bY;
    /* 0x0002 */ bool bZ;
};

// Size: 0x10
struct FNodeChain {
    /* 0x0000 */ TArray<FName> Nodes;
};

// Size: 0x70
struct FNodeHierarchyData {
    /* 0x0000 */ TArray<FNodeObject> Nodes;
    /* 0x0010 */ TArray<FTransform> Transforms;
    /* 0x0020 */ TMap<FName, int32_t> NodeNameToIndexMapping;
};

// Size: 0x78
struct FNodeHierarchyWithUserData {
    /* 0x0008 */ FNodeHierarchyData Hierarchy;
};

// Size: 0x18
struct FNodeObject {
    /* 0x0000 */ FName Name;
    /* 0x000c */ FName ParentName;
};

// Size: 0x30
struct FTransformConstraint {
    /* 0x0000 */ FConstraintDescription Operator;
    /* 0x0010 */ FName SourceNode;
    /* 0x001c */ FName TargetNode;
    /* 0x0028 */ float Weight;
    /* 0x002c */ bool bMaintainOffset;
};

// Size: 0x18
struct FTransformConstraintDescription : public FConstraintDescriptionEx {
    /* 0x0010 */ ETransformConstraintType TransformType;
};

// Size: 0x9
struct FTransformFilter {
    /* 0x0000 */ FFilterOptionPerAxis TranslationFilter;
    /* 0x0003 */ FFilterOptionPerAxis RotationFilter;
    /* 0x0006 */ FFilterOptionPerAxis ScaleFilter;
};

// Size: 0x20
struct FTransformNoScale {
    /* 0x0000 */ FVector Location;
    /* 0x0010 */ FQuat Rotation;
};

// Size: 0x30
class UAnimationBlueprintLibrary : public UBlueprintFunctionLibrary {

    static UAnimNotify* AddAnimationNotifyEvent(UAnimSequence* AnimationSequence, FName NotifyTrackName, float StartTime, UClass* NotifyClass);
    static void AddAnimationNotifyEventObject(UAnimSequence* AnimationSequence, float StartTime, const UAnimNotify* Notify, FName NotifyTrackName);
    static UAnimNotifyState* AddAnimationNotifyStateEvent(UAnimSequence* AnimationSequence, FName NotifyTrackName, float StartTime, float Duration, UClass* NotifyStateClass);
    static void AddAnimationNotifyStateEventObject(UAnimSequence* AnimationSequence, float StartTime, float Duration, const UAnimNotifyState* NotifyState, FName NotifyTrackName);
    static void AddAnimationNotifyTrack(UAnimSequence* AnimationSequence, FName NotifyTrackName, FLinearColor TrackColor);
    static void AddAnimationSyncMarker(UAnimSequence* AnimationSequence, FName MarkerName, float Time, FName NotifyTrackName);
    static void AddCurve(UAnimSequence* AnimationSequence, FName CurveName, ERawCurveTrackTypes CurveType, bool bMetaDataCurve);
    static void AddFloatCurveKey(UAnimSequence* AnimationSequence, FName CurveName, const float Time, const float Value);
    static void AddFloatCurveKeys(UAnimSequence* AnimationSequence, FName CurveName, const TArray<float>& Times, const TArray<float>& Values);
    static void AddMetaData(UAnimSequence* AnimationSequence, UClass* MetaDataClass, const UAnimMetaData*& MetaDataInstance);
    static void AddMetaDataObject(UAnimSequence* AnimationSequence, const UAnimMetaData* MetaDataObject);
    static void AddTransformationCurveKey(UAnimSequence* AnimationSequence, FName CurveName, const float Time, const FTransform& Transform);
    static void AddTransformationCurveKeys(UAnimSequence* AnimationSequence, FName CurveName, const TArray<float>& Times, const TArray<FTransform>& Transforms);
    static void AddVectorCurveKey(UAnimSequence* AnimationSequence, FName CurveName, const float Time, const FVector Vector);
    static void AddVectorCurveKeys(UAnimSequence* AnimationSequence, FName CurveName, const TArray<float>& Times, const TArray<FVector>& Vectors);
    static void AddVirtualBone(const UAnimSequence* AnimationSequence, FName SourceBoneName, FName TargetBoneName, FName& VirtualBoneName);
    static bool ContainsMetaDataOfClass(const UAnimSequence* AnimationSequence, UClass* MetaDataClass);
    static void CopyAnimNotifiesFromSequence(UAnimSequence* SrcAnimSequence, UAnimSequence* DestAnimSequence);
    static void DoesBoneNameExist(UAnimSequence* AnimationSequence, FName BoneName, bool& bExists);
    static bool DoesCurveExist(UAnimSequence* AnimationSequence, FName CurveName, ERawCurveTrackTypes CurveType);
    static void FinalizeBoneAnimation(UAnimSequence* AnimationSequence);
    static void FindBonePathToRoot(const UAnimSequence* AnimationSequence, FName BoneName, TArray<FName>& BonePath);
    static void GetAdditiveAnimationType(const UAnimSequence* AnimationSequence, uint8_t& AdditiveAnimationType);
    static void GetAdditiveBasePoseType(const UAnimSequence* AnimationSequence, uint8_t& AdditiveBasePoseType);
    static float GetAnimNotifyEventTriggerTime(const FAnimNotifyEvent& NotifyEvent);
    static void GetAnimationCurveNames(const UAnimSequence* AnimationSequence, ERawCurveTrackTypes CurveType, TArray<FName>& CurveNames);
    static void GetAnimationInterpolationType(const UAnimSequence* AnimationSequence, EAnimInterpolationType& InterpolationType);
    static void GetAnimationNotifyEventNames(const UAnimSequence* AnimationSequence, TArray<FName>& EventNames);
    static void GetAnimationNotifyEvents(const UAnimSequence* AnimationSequence, TArray<FAnimNotifyEvent>& NotifyEvents);
    static void GetAnimationNotifyEventsForTrack(const UAnimSequence* AnimationSequence, FName NotifyTrackName, TArray<FAnimNotifyEvent>& Events);
    static void GetAnimationNotifyTrackNames(const UAnimSequence* AnimationSequence, TArray<FName>& TrackNames);
    static void GetAnimationSyncMarkers(const UAnimSequence* AnimationSequence, TArray<FAnimSyncMarker>& Markers);
    static void GetAnimationSyncMarkersForTrack(const UAnimSequence* AnimationSequence, FName NotifyTrackName, TArray<FAnimSyncMarker>& Markers);
    static void GetAnimationTrackNames(const UAnimSequence* AnimationSequence, TArray<FName>& TrackNames);
    static void GetBoneCompressionSettings(const UAnimSequence* AnimationSequence, UAnimBoneCompressionSettings*& CompressionSettings);
    static void GetBonePoseForFrame(const UAnimSequence* AnimationSequence, FName BoneName, int32_t Frame, bool bExtractRootMotion, FTransform& Pose);
    static void GetBonePoseForTime(const UAnimSequence* AnimationSequence, FName BoneName, float Time, bool bExtractRootMotion, FTransform& Pose);
    static void GetBonePosesForFrame(const UAnimSequence* AnimationSequence, TArray<FName> BoneNames, int32_t Frame, bool bExtractRootMotion, TArray<FTransform>& Poses, const USkeletalMesh* PreviewMesh);
    static void GetBonePosesForTime(const UAnimSequence* AnimationSequence, TArray<FName> BoneNames, float Time, bool bExtractRootMotion, TArray<FTransform>& Poses, const USkeletalMesh* PreviewMesh);
    static void GetCurveCompressionSettings(const UAnimSequence* AnimationSequence, UAnimCurveCompressionSettings*& CompressionSettings);
    static void GetFloatKeys(UAnimSequence* AnimationSequence, FName CurveName, TArray<float>& Times, TArray<float>& Values);
    static void GetFrameAtTime(const UAnimSequence* AnimationSequence, const float Time, int32_t& Frame);
    static void GetMetaData(const UAnimSequence* AnimationSequence, const TArray<UAnimMetaData*>& MetaData);
    static void GetMetaDataOfClass(const UAnimSequence* AnimationSequence, UClass* MetaDataClass, const TArray<UAnimMetaData*>& MetaDataOfClass);
    static void GetNumFrames(const UAnimSequence* AnimationSequence, int32_t& NumFrames);
    static void GetRateScale(const UAnimSequence* AnimationSequence, float& RateScale);
    static void GetRawTrackData(const UAnimSequence* AnimationSequence, const FName TrackName, TArray<FVector>& PositionKeys, TArray<FQuat>& RotationKeys, TArray<FVector>& ScalingKeys);
    static void GetRawTrackPositionData(const UAnimSequence* AnimationSequence, const FName TrackName, TArray<FVector>& PositionData);
    static void GetRawTrackRotationData(const UAnimSequence* AnimationSequence, const FName TrackName, TArray<FQuat>& RotationData);
    static void GetRawTrackScaleData(const UAnimSequence* AnimationSequence, const FName TrackName, TArray<FVector>& ScaleData);
    static void GetRootMotionLockType(const UAnimSequence* AnimationSequence, uint8_t& LockType);
    static void GetSequenceLength(const UAnimSequence* AnimationSequence, float& Length);
    static void GetTimeAtFrame(const UAnimSequence* AnimationSequence, const int32_t Frame, float& Time);
    static void GetTransformationKeys(UAnimSequence* AnimationSequence, FName CurveName, TArray<float>& Times, TArray<FTransform>& Values);
    static void GetUniqueMarkerNames(const UAnimSequence* AnimationSequence, TArray<FName>& MarkerNames);
    static void GetVectorKeys(UAnimSequence* AnimationSequence, FName CurveName, TArray<float>& Times, TArray<FVector>& Values);
    static bool IsRootMotionEnabled(const UAnimSequence* AnimationSequence);
    static bool IsRootMotionLockForced(const UAnimSequence* AnimationSequence);
    static bool IsValidAnimNotifyTrackName(const UAnimSequence* AnimationSequence, FName NotifyTrackName);
    static bool IsValidAnimationSyncMarkerName(const UAnimSequence* AnimationSequence, FName MarkerName);
    static bool IsValidRawAnimationTrackName(const UAnimSequence* AnimationSequence, const FName TrackName);
    static void IsValidTime(const UAnimSequence* AnimationSequence, const float Time, bool& IsValid);
    static void RemoveAllAnimationNotifyTracks(UAnimSequence* AnimationSequence);
    static void RemoveAllAnimationSyncMarkers(UAnimSequence* AnimationSequence);
    static void RemoveAllBoneAnimation(UAnimSequence* AnimationSequence);
    static void RemoveAllCurveData(UAnimSequence* AnimationSequence);
    static void RemoveAllMetaData(UAnimSequence* AnimationSequence);
    static void RemoveAllVirtualBones(const UAnimSequence* AnimationSequence);
    static int32_t RemoveAnimationNotifyEventsByName(UAnimSequence* AnimationSequence, FName NotifyName);
    static int32_t RemoveAnimationNotifyEventsByTrack(UAnimSequence* AnimationSequence, FName NotifyTrackName);
    static void RemoveAnimationNotifyTrack(UAnimSequence* AnimationSequence, FName NotifyTrackName);
    static int32_t RemoveAnimationSyncMarkersByName(UAnimSequence* AnimationSequence, FName MarkerName);
    static int32_t RemoveAnimationSyncMarkersByTrack(UAnimSequence* AnimationSequence, FName NotifyTrackName);
    static void RemoveBoneAnimation(UAnimSequence* AnimationSequence, FName BoneName, bool bIncludeChildren, bool bFinalize);
    static void RemoveCurve(UAnimSequence* AnimationSequence, FName CurveName, bool bRemoveNameFromSkeleton);
    static void RemoveMetaData(UAnimSequence* AnimationSequence, const UAnimMetaData* MetaDataObject);
    static void RemoveMetaDataOfClass(UAnimSequence* AnimationSequence, UClass* MetaDataClass);
    static void RemoveVirtualBone(const UAnimSequence* AnimationSequence, FName VirtualBoneName);
    static void RemoveVirtualBones(const UAnimSequence* AnimationSequence, TArray<FName> VirtualBoneNames);
    static void ReplaceAnimNotifies(UAnimSequenceBase* AnimationSequence, UClass* OldNotifyClass, UClass* NewNotifyClass, FDelegate OnNotifyReplaced);
    static void ReplaceAnimNotifyStates(UAnimSequenceBase* AnimationSequence, UClass* OldNotifyClass, UClass* NewNotifyClass, FDelegate OnNotifyStateReplaced);
    static void SetAdditiveAnimationType(UAnimSequence* AnimationSequence, const uint8_t AdditiveAnimationType);
    static void SetAdditiveBasePoseType(UAnimSequence* AnimationSequence, const uint8_t AdditiveBasePoseType);
    static void SetAnimationInterpolationType(UAnimSequence* AnimationSequence, EAnimInterpolationType InterpolationType);
    static void SetBoneCompressionSettings(UAnimSequence* AnimationSequence, UAnimBoneCompressionSettings* CompressionSettings);
    static void SetCurveCompressionSettings(UAnimSequence* AnimationSequence, UAnimCurveCompressionSettings* CompressionSettings);
    static void SetIsRootMotionLockForced(UAnimSequence* AnimationSequence, bool bForced);
    static void SetRateScale(UAnimSequence* AnimationSequence, float RateScale);
    static void SetRootMotionEnabled(UAnimSequence* AnimationSequence, bool bEnabled);
    static void SetRootMotionLockType(UAnimSequence* AnimationSequence, uint8_t RootMotionLockType);
};

// Size: 0x70
class UAnimationModifier : public UObject {
    /* 0x0040 */ FGuid RevisionGuid;
    /* 0x0050 */ FGuid AppliedGuid;
    /* 0x0060 */ int32_t StoredNativeRevision;
    /* 0x0068 */ UAnimationModifier* PreviouslyAppliedModifier;

    void OnApply(UAnimSequence* AnimationSequence);
    void OnRevert(UAnimSequence* AnimationSequence);
};

// Size: 0x40
class UAnimationModifiersAssetUserData : public UAssetUserData {
    /* 0x0030 */ TArray<UAnimationModifier*> AnimationModifierInstances;
};

enum class ESmartNameContainerType {
    SNCT_CurveMapping = 0,
    SNCT_TrackCurveMapping = 1,
    SNCT_MAX = 2,
};

// Size: 0x310
class UAnimSharingAdditiveInstance : public UAnimInstance {
    /* 0x02f8 */ TWeakObjectPtr<USkeletalMeshComponent> BaseComponent;
    /* 0x0300 */ TWeakObjectPtr<UAnimSequence> AdditiveAnimation;
    /* 0x0308 */ float Alpha;
    /* 0x030c */ bool bStateBool;
};

// Size: 0x120
class UAnimSharingInstance : public UObject {
    /* 0x0030 */ TArray<AActor*> RegisteredActors;
    /* 0x0090 */ UAnimationSharingStateProcessor* StateProcessor;
    /* 0x00d0 */ TArray<UAnimSequence*> UsedAnimationSequences;
    /* 0x00f0 */ UEnum* StateEnum;
    /* 0x00f8 */ AActor* SharingActor;
};

// Size: 0x320
class UAnimSharingStateInstance : public UAnimInstance {
    /* 0x02f8 */ UAnimSequence* AnimationToPlay;
    /* 0x0300 */ float PermutationTimeOffset;
    /* 0x0304 */ float PlayRate;
    /* 0x0308 */ bool bStateBool;
    /* 0x0310 */ UAnimSharingInstance* Instance;

    void GetInstancedActors(TArray<AActor*>& Actors);
};

// Size: 0x310
class UAnimSharingTransitionInstance : public UAnimInstance {
    /* 0x02f8 */ TWeakObjectPtr<USkeletalMeshComponent> FromComponent;
    /* 0x0300 */ TWeakObjectPtr<USkeletalMeshComponent> ToComponent;
    /* 0x0308 */ float BlendTime;
    /* 0x030c */ bool bBlendBool;
};

// Size: 0xc0
struct FAnimationSetup {
    /* 0x0000 */ UAnimSequence* AnimSequence;
    /* 0x0008 */ UClass* AnimBlueprint;
    /* 0x0010 */ FPerPlatformInt NumRandomizedInstances;
    /* 0x0068 */ FPerPlatformBool Enabled;
};

// Size: 0x1e0
class UAnimationSharingManager : public UObject {
    /* 0x0030 */ TArray<USkeleton*> Skeletons;
    /* 0x0040 */ TArray<UAnimSharingInstance*> PerSkeletonData;

    static bool AnimationSharingEnabled();
    static bool CreateAnimationSharingManager(UObject* WorldContextObject, const UAnimationSharingSetup* Setup);
    static UAnimationSharingManager* GetAnimationSharingManager(UObject* WorldContextObject);
    void RegisterActorWithSkeletonBP(AActor* InActor, const USkeleton* SharingSkeleton);
};

// Size: 0x160
struct FAnimationSharingScalability {
    /* 0x0000 */ FPerPlatformBool UseBlendTransitions;
    /* 0x0058 */ FPerPlatformFloat BlendSignificanceValue;
    /* 0x00b0 */ FPerPlatformInt MaximumNumberConcurrentBlends;
    /* 0x0108 */ FPerPlatformFloat TickSignificanceValue;
};

// Size: 0x1a0
class UAnimationSharingSetup : public UObject {
    /* 0x0030 */ TArray<FPerSkeletonAnimationSharingSetup> SkeletonSetups;
    /* 0x0040 */ FAnimationSharingScalability ScalabilitySettings;
};

// Size: 0x60
class UAnimationSharingStateProcessor : public UObject {
    /* 0x0030 */ TSoftObjectPtr<UEnum> AnimationStateEnum;

    UEnum* GetAnimationStateEnum();
    void ProcessActorState(int32_t& OutState, AActor* InActor, uint8_t CurrentState, uint8_t OnDemandState, bool& bShouldProcess);
};

// Size: 0x88
struct FAnimationStateEntry {
    /* 0x0000 */ uint8_t State;
    /* 0x0008 */ TArray<FAnimationSetup> AnimationSetups;
    /* 0x0018 */ bool bOnDemand;
    /* 0x0019 */ bool bAdditive;
    /* 0x001c */ float BlendTime;
    /* 0x0020 */ bool bReturnToPreviousState;
    /* 0x0021 */ bool bSetNextState;
    /* 0x0022 */ uint8_t NextState;
    /* 0x0028 */ FPerPlatformInt MaximumNumberOfConcurrentInstances;
    /* 0x0080 */ float WiggleTimePercentage;
    /* 0x0084 */ bool bRequiresCurves;
};

// Size: 0x38
struct FPerSkeletonAnimationSharingSetup {
    /* 0x0000 */ USkeleton* Skeleton;
    /* 0x0008 */ USkeletalMesh* SkeletalMesh;
    /* 0x0010 */ UClass* BlendAnimBlueprint;
    /* 0x0018 */ UClass* AdditiveAnimBlueprint;
    /* 0x0020 */ UClass* StateProcessorClass;
    /* 0x0028 */ TArray<FAnimationStateEntry> AnimationStates;
};

// Size: 0x30
struct FTickAnimationSharingFunction : public FTickFunction {
};

// Size: 0x88
class UAnimationSharingSetupFactory : public UFactory {
};

// Size: 0x30
class IAppleImageInterface : public UInterface {
};

// Size: 0x90
class UAppleImageUtilsBaseAsyncTaskBlueprintProxy : public UObject {
    /* 0x0038 */ FMulticastInlineDelegate OnSuccess;
    /* 0x0048 */ FMulticastInlineDelegate OnFailure;
    /* 0x0068 */ FAppleImageUtilsImageConversionResult ConversionResult;

    static UAppleImageUtilsBaseAsyncTaskBlueprintProxy* CreateProxyObjectForConvertToHEIF(UTexture* SourceImage, int32_t Quality, bool bWantColor, bool bUseGpu, float Scale, ETextureRotationDirection Rotate);
    static UAppleImageUtilsBaseAsyncTaskBlueprintProxy* CreateProxyObjectForConvertToJPEG(UTexture* SourceImage, int32_t Quality, bool bWantColor, bool bUseGpu, float Scale, ETextureRotationDirection Rotate);
    static UAppleImageUtilsBaseAsyncTaskBlueprintProxy* CreateProxyObjectForConvertToPNG(UTexture* SourceImage, bool bWantColor, bool bUseGpu, float Scale, ETextureRotationDirection Rotate);
    static UAppleImageUtilsBaseAsyncTaskBlueprintProxy* CreateProxyObjectForConvertToTIFF(UTexture* SourceImage, bool bWantColor, bool bUseGpu, float Scale, ETextureRotationDirection Rotate);
};

// Size: 0x20
struct FAppleImageUtilsImageConversionResult {
    /* 0x0000 */ FString Error;
    /* 0x0010 */ TArray<uint8_t> ImageData;
};

enum class EAppleTextureType {
    Unknown = 0,
    Image = 1,
    PixelBuffer = 2,
    Surface = 3,
    MetalTexture = 4,
    EAppleTextureType_MAX = 5,
};

enum class ETextureRotationDirection {
    None = 0,
    Left = 1,
    Right = 2,
    Down = 3,
    LeftMirrored = 4,
    RightMirrored = 5,
    DownMirrored = 6,
    UpMirrored = 7,
    ETextureRotationDirection_MAX = 8,
};

// Size: 0xf8
class UK2Node_ConvertToHEIF : public UK2Node_BaseAsyncTask {
};

// Size: 0xf8
class UK2Node_ConvertToJPEG : public UK2Node_BaseAsyncTask {
};

// Size: 0xf8
class UK2Node_ConvertToPNG : public UK2Node_BaseAsyncTask {
};

// Size: 0xf8
class UK2Node_ConvertToTIFF : public UK2Node_BaseAsyncTask {
};

// Size: 0xb50
class UArchVisCharMovementComponent : public UCharacterMovementComponent {
    /* 0x0b00 */ FRotator RotationalAcceleration;
    /* 0x0b0c */ FRotator RotationalDeceleration;
    /* 0x0b18 */ FRotator MaxRotationalVelocity;
    /* 0x0b24 */ float MinPitch;
    /* 0x0b28 */ float MaxPitch;
    /* 0x0b2c */ float WalkingFriction;
    /* 0x0b30 */ float WalkingSpeed;
    /* 0x0b34 */ float WalkingAcceleration;
};

// Size: 0x600
class AArchVisCharacter : public ACharacter {
    /* 0x0598 */ FString LookUpAxisName;
    /* 0x05a8 */ FString LookUpAtRateAxisName;
    /* 0x05b8 */ FString TurnAxisName;
    /* 0x05c8 */ FString TurnAtRateAxisName;
    /* 0x05d8 */ FString MoveForwardAxisName;
    /* 0x05e8 */ FString MoveRightAxisName;
    /* 0x05f8 */ float MouseSensitivityScale_Pitch;
    /* 0x05fc */ float MouseSensitivityScale_Yaw;
};

// Size: 0x180
class UEdGraphNode_Reference : public UEdGraphNode {
};

// Size: 0x180
class UEdGraph_ReferenceViewer : public UEdGraph {
};

// Size: 0x30
class UReferenceViewerSchema : public UEdGraphSchema {
};

// Size: 0x30
class IAssetRegistry : public UInterface {

    bool GetAllAssets(TArray<FAssetData>& OutAssetData, bool bIncludeOnlyOnDiskAssets) const;
    void GetAllCachedPaths(TArray<FString>& OutPathList) const;
    FAssetData GetAssetByObjectPath(const FName ObjectPath, bool bIncludeOnlyOnDiskAssets) const;
    bool GetAssets(const FARFilter& Filter, TArray<FAssetData>& OutAssetData) const;
    bool GetAssetsByClass(FName ClassName, TArray<FAssetData>& OutAssetData, bool bSearchSubClasses) const;
    bool GetAssetsByPackageName(FName PackageName, TArray<FAssetData>& OutAssetData, bool bIncludeOnlyOnDiskAssets) const;
    bool GetAssetsByPath(FName PackagePath, TArray<FAssetData>& OutAssetData, bool bRecursive, bool bIncludeOnlyOnDiskAssets) const;
    void GetSubPaths(FString InBasePath, TArray<FString>& OutPathList, bool bInRecurse) const;
    bool HasAssets(const FName PackagePath, const bool bRecursive) const;
    bool IsLoadingAssets() const;
    bool K2_GetDependencies(FName PackageName, const FAssetRegistryDependencyOptions& DependencyOptions, TArray<FName>& OutDependencies) const;
    bool K2_GetReferencers(FName PackageName, const FAssetRegistryDependencyOptions& ReferenceOptions, TArray<FName>& OutReferencers) const;
    void PrioritizeSearchPath(FString PathToPrioritize);
    void RunAssetsThroughFilter(TArray<FAssetData>& AssetDataList, const FARFilter& Filter) const;
    void ScanFilesSynchronous(const TArray<FString>& InFilePaths, bool bForceRescan);
    void ScanModifiedAssetFiles(const TArray<FString>& InFilePaths);
    void ScanPathsSynchronous(const TArray<FString>& InPaths, bool bForceRescan);
    void SearchAllAssets(bool bSynchronousSearch);
    void UseFilterToExcludeAssets(TArray<FAssetData>& AssetDataList, const FARFilter& Filter) const;
    void WaitForCompletion();
};

// Size: 0x5
struct FAssetRegistryDependencyOptions {
    /* 0x0000 */ bool bIncludeSoftPackageReferences;
    /* 0x0001 */ bool bIncludeHardPackageReferences;
    /* 0x0002 */ bool bIncludeSearchableNames;
    /* 0x0003 */ bool bIncludeSoftManagementReferences;
    /* 0x0004 */ bool bIncludeHardManagementReferences;
};

// Size: 0x30
class UAssetRegistryHelpers : public UObject {

    static FAssetData CreateAssetData(const UObject* InAsset, bool bAllowBlueprintClass);
    static UObject* GetAsset(const FAssetData& InAssetData);
    static TScriptInterface<IAssetRegistry> GetAssetRegistry();
    static UClass* GetClass(const FAssetData& InAssetData);
    static FString GetExportTextName(const FAssetData& InAssetData);
    static FString GetFullName(const FAssetData& InAssetData);
    static bool GetTagValue(const FAssetData& InAssetData, const FName& InTagName, FString& OutTagValue);
    static bool IsAssetLoaded(const FAssetData& InAssetData);
    static bool IsRedirector(const FAssetData& InAssetData);
    static bool IsUAsset(const FAssetData& InAssetData);
    static bool IsValid(const FAssetData& InAssetData);
    static FARFilter SetFilterTagsAndValues(const FARFilter& InFilter, const TArray<FTagAndValue>& InTagsAndValues);
    static FSoftObjectPath ToSoftObjectPath(const FAssetData& InAssetData);
};

// Size: 0x8c8
class UAssetRegistryImpl : public UObject {
};

// Size: 0x20
struct FTagAndValue {
    /* 0x0000 */ FName Tag;
    /* 0x0010 */ FString Value;
};

// Size: 0x38
class UAssetTagsSubsystem : public UEngineSubsystem {

    bool AddAssetDataToCollection(const FName Name, const FAssetData& AssetData);
    bool AddAssetDatasToCollection(const FName Name, const TArray<FAssetData>& AssetDatas);
    bool AddAssetPtrToCollection(const FName Name, const UObject* AssetPtr);
    bool AddAssetPtrsToCollection(const FName Name, const TArray<UObject*>& AssetPtrs);
    bool AddAssetToCollection(const FName Name, const FName AssetPathName);
    bool AddAssetsToCollection(const FName Name, const TArray<FName>& AssetPathNames);
    bool CollectionExists(const FName Name);
    bool CreateCollection(const FName Name, const ECollectionScriptingShareType ShareType);
    bool DestroyCollection(const FName Name);
    bool EmptyCollection(const FName Name);
    TArray<FAssetData> GetAssetsInCollection(const FName Name);
    TArray<FName> GetCollections();
    TArray<FName> GetCollectionsContainingAsset(const FName AssetPathName);
    TArray<FName> GetCollectionsContainingAssetData(const FAssetData& AssetData);
    TArray<FName> GetCollectionsContainingAssetPtr(const UObject* AssetPtr);
    bool RemoveAssetDataFromCollection(const FName Name, const FAssetData& AssetData);
    bool RemoveAssetDatasFromCollection(const FName Name, const TArray<FAssetData>& AssetDatas);
    bool RemoveAssetFromCollection(const FName Name, const FName AssetPathName);
    bool RemoveAssetPtrFromCollection(const FName Name, const UObject* AssetPtr);
    bool RemoveAssetPtrsFromCollection(const FName Name, const TArray<UObject*>& AssetPtrs);
    bool RemoveAssetsFromCollection(const FName Name, const TArray<FName>& AssetPathNames);
    bool RenameCollection(const FName Name, const FName NewName);
    bool ReparentCollection(const FName Name, const FName NewParentName);
};

enum class ECollectionScriptingShareType {
    Local = 0,
    Private = 1,
    Shared = 2,
    ECollectionScriptingShareType_MAX = 3,
};

// Size: 0x138
class UAdvancedCopyCustomization : public UObject {
};

// Size: 0x40
struct FAdvancedCopyMap {
    /* 0x0000 */ FSoftClassPath ClassToCopy;
    /* 0x0020 */ FSoftClassPath AdvancedCopyCustomization;
};

// Size: 0x38
struct FAdvancedCopyParams {
};

// Size: 0x70
struct FAssetRenameData {
    /* 0x0000 */ TWeakObjectPtr<UObject> Asset;
    /* 0x0008 */ FString NewPackagePath;
    /* 0x0018 */ FString NewName;
    /* 0x0028 */ FSoftObjectPath OldObjectPath;
    /* 0x0048 */ FSoftObjectPath NewObjectPath;
    /* 0x0068 */ bool bOnlyFixSoftReferences;
};

// Size: 0x30
class IAssetTools : public UInterface {

    UObject* CreateAsset(FString AssetName, FString PackagePath, UClass* AssetClass, UFactory* Factory, FName CallingContext);
    UObject* CreateAssetWithDialog(FString AssetName, FString PackagePath, UClass* AssetClass, UFactory* Factory, FName CallingContext);
    void CreateUniqueAssetName(FString InBasePackageName, FString InSuffix, FString& OutPackageName, FString& OutAssetName);
    UObject* DuplicateAsset(FString AssetName, FString PackagePath, UObject* OriginalObject);
    UObject* DuplicateAssetWithDialog(FString AssetName, FString PackagePath, UObject* OriginalObject);
    UObject* DuplicateAssetWithDialogAndTitle(FString AssetName, FString PackagePath, UObject* OriginalObject, FText DialogTitle);
    void ExportAssets(const TArray<FString>& AssetsToExport, FString ExportPath);
    void ExportAssetsWithDialog(const TArray<FString>& AssetsToExport, bool bPromptForIndividualFilenames);
    void FindSoftReferencesToObject(FSoftObjectPath TargetObject, TArray<UObject*>& ReferencingObjects);
    void ImportAssetTasks(const TArray<UAssetImportTask*>& ImportTasks);
    TArray<UObject*> ImportAssetsAutomated(const UAutomatedAssetImportData* ImportData);
    TArray<UObject*> ImportAssetsWithDialog(FString DestinationPath);
    void OpenEditorForAssets(const TArray<UObject*>& Assets);
    bool RenameAssets(const TArray<FAssetRenameData>& AssetsAndNames);
    EAssetRenameResult RenameAssetsWithDialog(const TArray<FAssetRenameData>& AssetsAndNames, bool bAutoCheckout);
    void RenameReferencingSoftObjectPaths(const TArray<UPackage*> PackagesToCheck, const TMap<FSoftObjectPath, FSoftObjectPath>& AssetRedirectorMap);
};

// Size: 0x30
class UAssetToolsHelpers : public UObject {

    static TScriptInterface<IAssetTools> GetAssetTools();
};

// Size: 0x110
class UAssetToolsImpl : public UObject {
};

// Size: 0x70
class UAssetToolsSettings : public UDeveloperSettings {
    /* 0x0060 */ TArray<FAdvancedCopyMap> AdvancedCopyCustomizations;
};

enum class EAssetRenameResult {
    Failure = 0,
    Success = 1,
    Pending = 2,
    EAssetRenameResult_MAX = 3,
};

// Size: 0x30
class UAudioAnalyzerAsset : public UObject {
};

// Size: 0xd0
class UAudioAnalyzerNRT : public UAudioAnalyzerAsset {
    /* 0x0030 */ USoundWave* Sound;
    /* 0x0038 */ float DurationInSeconds;

    void AnalyzeAudio();
};

// Size: 0x48
class UAudioAnalyzerNRTSettings : public UAudioAnalyzerAsset {
};

// Size: 0xb8
class UAudioCapture : public UAudioGenerator {

    bool GetAudioCaptureDeviceInfo(FAudioCaptureDeviceInfo& OutInfo);
    bool IsCapturingAudio();
    void StartCapturingAudio();
    void StopCapturingAudio();
};

// Size: 0x7e0
class UAudioCaptureComponent : public USynthComponent {
    /* 0x0720 */ int32_t JitterLatencyFrames;
};

// Size: 0x14
struct FAudioCaptureDeviceInfo {
    /* 0x0000 */ FName DeviceName;
    /* 0x000c */ int32_t NumInputChannels;
    /* 0x0010 */ int32_t SampleRate;
};

// Size: 0x30
class UAudioCaptureFunctionLibrary : public UBlueprintFunctionLibrary {

    static UAudioCapture* CreateAudioCapture();
};

// Size: 0x88
class UAudioBusFactory : public UFactory {
};

// Size: 0x88
class UDialogueVoiceFactory : public UFactory {
};

// Size: 0xb0
class UDialogueWaveFactory : public UFactory {
    /* 0x0088 */ USoundWave* InitialSoundWave;
    /* 0x0090 */ UDialogueVoice* InitialSpeakerVoice;
    /* 0x0098 */ bool HasSetInitialTargetVoice;
    /* 0x00a0 */ TArray<UDialogueVoice*> InitialTargetVoices;
};

// Size: 0x88
class UEndpointSubmixFactory : public UFactory {
};

// Size: 0xd8
class UReimportSoundFactory : public USoundFactory {
};

// Size: 0x88
class UReverbEffectFactory : public UFactory {
};

// Size: 0x88
class USoundAttenuationFactory : public UFactory {
};

// Size: 0x88
class USoundClassFactory : public UFactory {
};

// Size: 0xb8
class USoundClassGraph : public UEdGraph {
};

// Size: 0xe0
class USoundClassGraphNode : public UEdGraphNode {
    /* 0x00c8 */ USoundClass* SoundClass;
};

// Size: 0x30
class USoundClassGraphSchema : public UEdGraphSchema {
};

// Size: 0x110
struct FSoundClassGraphSchemaAction_NewNode : public FEdGraphSchemaAction {
};

// Size: 0x88
class USoundConcurrencyFactory : public UFactory {
};

// Size: 0xb8
class USoundCueFactoryNew : public UFactory {
    /* 0x0088 */ USoundWave* InitialSoundWave;
    /* 0x0090 */ TArray<TWeakObjectPtr<USoundWave>> InitialSoundWaves;
    /* 0x00a0 */ UDialogueWave* InitialDialogueWave;
    /* 0x00a8 */ TArray<TWeakObjectPtr<UDialogueWave>> InitialDialogueWaves;
};

// Size: 0xb0
class USoundCueGraph : public UEdGraph {
};

// Size: 0xd0
class USoundCueGraphNode : public USoundCueGraphNode_Base {
    /* 0x00c8 */ USoundNode* SoundNode;
};

// Size: 0xc8
class USoundCueGraphNode_Base : public UEdGraphNode {
};

// Size: 0xc8
class USoundCueGraphNode_Root : public USoundCueGraphNode_Base {
};

// Size: 0x30
class USoundCueGraphSchema : public UEdGraphSchema {
};

// Size: 0x100
struct FSoundCueGraphSchemaAction_NewComment : public FEdGraphSchemaAction {
};

// Size: 0x108
struct FSoundCueGraphSchemaAction_NewFromSelected : public FSoundCueGraphSchemaAction_NewNode {
};

// Size: 0x108
struct FSoundCueGraphSchemaAction_NewNode : public FEdGraphSchemaAction {
    /* 0x0100 */ UClass* SoundNodeClass;
};

// Size: 0x100
struct FSoundCueGraphSchemaAction_Paste : public FEdGraphSchemaAction {
};

// Size: 0x400
class USoundEffectPresetUserWidget : public UUserWidget {
    /* 0x03f8 */ USoundEffectPreset* Preset;

    void OnPresetChanged(FName PropertyName);
};

// Size: 0x38
class USoundEffectSourcePresetClassTemplate : public UClassTemplate {
};

// Size: 0x38
class USoundEffectSubmixPresetClassTemplate : public UClassTemplate {
};

// Size: 0xb0
class USoundFactory : public UFactory {
    /* 0x0088 */ bool bAutoCreateCue;
    /* 0x0088 */ bool bIncludeAttenuationNode;
    /* 0x0088 */ bool bIncludeLoopingNode;
    /* 0x0088 */ bool bIncludeModulatorNode;
    /* 0x008c */ float CueVolume;
    /* 0x0090 */ FString CuePackageSuffix;
};

// Size: 0x88
class USoundMixFactory : public UFactory {
};

// Size: 0x88
class USoundSourceBusFactory : public UFactory {
};

// Size: 0x88
class USoundSourceEffectChainFactory : public UFactory {
};

// Size: 0x90
class USoundSourceEffectFactory : public UFactory {
    /* 0x0088 */ UClass* SoundEffectSourcepresetClass;
};

// Size: 0x90
class USoundSubmixEffectFactory : public UFactory {
    /* 0x0088 */ UClass* SoundEffectSubmixPresetClass;
};

// Size: 0x88
class USoundSubmixFactory : public UFactory {
};

// Size: 0xc8
class USoundSubmixGraph : public UEdGraph {
    /* 0x00b0 */ USoundSubmixBase* RootSoundSubmix;
    /* 0x00b8 */ TArray<USoundSubmixBase*> StaleRoots;
};

// Size: 0xe0
class USoundSubmixGraphNode : public UEdGraphNode {
    /* 0x00c8 */ USoundSubmixBase* SoundSubmix;
};

// Size: 0x30
class USoundSubmixGraphSchema : public UEdGraphSchema {
};

// Size: 0x110
struct FSoundSubmixGraphSchemaAction_NewNode : public FEdGraphSchemaAction {
};

// Size: 0x88
class USoundfieldEndpointSubmixFactory : public UFactory {
};

// Size: 0x88
class USoundfieldSubmixFactory : public UFactory {
};

// Size: 0x38
class USynthComponentClassTemplate : public UClassTemplate {
};

// Size: 0x30
class UAudioEndpointSettingsBase : public UObject {
};

// Size: 0x30
class UDummyEndpointSettings : public UAudioEndpointSettingsBase {
};

// Size: 0x30
class UOcclusionPluginSourceSettingsBase : public UObject {
};

// Size: 0x30
class UReverbPluginSourceSettingsBase : public UObject {
};

// Size: 0x30
class USoundModulatorBase : public UObject {
};

// Size: 0x38
class USoundfieldEffectBase : public UObject {
    /* 0x0030 */ USoundfieldEffectSettingsBase* Settings;
};

// Size: 0x30
class USoundfieldEffectSettingsBase : public UObject {
};

// Size: 0x30
class USoundfieldEncodingSettingsBase : public UObject {
};

// Size: 0x30
class USoundfieldEndpointSettingsBase : public UObject {
};

// Size: 0x30
class USpatializationPluginSourceSettingsBase : public UObject {
};

// Size: 0xb0
class UAudioGenerator : public UObject {
};

// Size: 0x30
class UAudioMixerBlueprintLibrary : public UBlueprintFunctionLibrary {

    static void AddMasterSubmixEffect(const UObject* WorldContextObject, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void AddSourceEffectToPresetChain(const UObject* WorldContextObject, USoundEffectSourcePresetChain* PresetChain, FSourceEffectChainEntry Entry);
    static int32_t AddSubmixEffect(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void ClearMasterSubmixEffects(const UObject* WorldContextObject);
    static void ClearSubmixEffectChainOverride(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, float FadeTimeSec);
    static void ClearSubmixEffects(const UObject* WorldContextObject, USoundSubmix* SoundSubmix);
    static void GetMagnitudeForFrequencies(const UObject* WorldContextObject, const TArray<float>& Frequencies, TArray<float>& Magnitudes, USoundSubmix* SubmixToAnalyze);
    static int32_t GetNumberOfEntriesInSourceEffectChain(const UObject* WorldContextObject, USoundEffectSourcePresetChain* PresetChain);
    static void GetPhaseForFrequencies(const UObject* WorldContextObject, const TArray<float>& Frequencies, TArray<float>& Phases, USoundSubmix* SubmixToAnalyze);
    static bool IsAudioBusActive(const UObject* WorldContextObject, UAudioBus* AudioBus);
    static TArray<FSoundSubmixSpectralAnalysisBandSettings> MakeFullSpectrumSpectralAnalysisBandSettings(int32_t InNumBands, float InMinimumFrequency, float InMaximumFrequency, int32_t InAttackTimeMsec, int32_t InReleaseTimeMsec);
    static TArray<FSoundSubmixSpectralAnalysisBandSettings> MakeMusicalSpectralAnalysisBandSettings(int32_t InNumSemitones, EMusicalNoteName InStartingMusicalNote, int32_t InStartingOctave, int32_t InAttackTimeMsec, int32_t InReleaseTimeMsec);
    static TArray<FSoundSubmixSpectralAnalysisBandSettings> MakePresetSpectralAnalysisBandSettings(EAudioSpectrumBandPresetType InBandPresetType, int32_t InNumBands, int32_t InAttackTimeMsec, int32_t InReleaseTimeMsec);
    static void PauseRecordingOutput(const UObject* WorldContextObject, USoundSubmix* SubmixToPause);
    static void PrimeSoundCueForPlayback(USoundCue* SoundCue);
    static void PrimeSoundForPlayback(USoundWave* SoundWave, const FDelegate OnLoadCompletion);
    static void RemoveMasterSubmixEffect(const UObject* WorldContextObject, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void RemoveSourceEffectFromPresetChain(const UObject* WorldContextObject, USoundEffectSourcePresetChain* PresetChain, int32_t EntryIndex);
    static void RemoveSubmixEffect(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void RemoveSubmixEffectAtIndex(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, int32_t SubmixChainIndex);
    static void RemoveSubmixEffectPreset(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void RemoveSubmixEffectPresetAtIndex(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, int32_t SubmixChainIndex);
    static void ReplaceSoundEffectSubmix(const UObject* WorldContextObject, USoundSubmix* InSoundSubmix, int32_t SubmixChainIndex, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void ReplaceSubmixEffect(const UObject* WorldContextObject, USoundSubmix* InSoundSubmix, int32_t SubmixChainIndex, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void ResumeRecordingOutput(const UObject* WorldContextObject, USoundSubmix* SubmixToPause);
    static void SetBypassSourceEffectChainEntry(const UObject* WorldContextObject, USoundEffectSourcePresetChain* PresetChain, int32_t EntryIndex, bool bBypassed);
    static void SetSubmixEffectChainOverride(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, TArray<USoundEffectSubmixPreset*> SubmixEffectPresetChain, float FadeTimeSec);
    static void StartAnalyzingOutput(const UObject* WorldContextObject, USoundSubmix* SubmixToAnalyze, EFFTSize FFTSize, EFFTPeakInterpolationMethod InterpolationMethod, EFFTWindowType WindowType, float HopSize, EAudioSpectrumType SpectrumType);
    static void StartAudioBus(const UObject* WorldContextObject, UAudioBus* AudioBus);
    static void StartRecordingOutput(const UObject* WorldContextObject, float ExpectedDuration, USoundSubmix* SubmixToRecord);
    static void StopAnalyzingOutput(const UObject* WorldContextObject, USoundSubmix* SubmixToStopAnalyzing);
    static void StopAudioBus(const UObject* WorldContextObject, UAudioBus* AudioBus);
    static USoundWave* StopRecordingOutput(const UObject* WorldContextObject, EAudioRecordingExportType ExportType, FString Name, FString Path, USoundSubmix* SubmixToRecord, USoundWave* ExistingSoundWaveToOverwrite);
    static float TrimAudioCache(float InMegabytesToFree);
};

enum class EMusicalNoteName {
    C = 0,
    Db = 1,
    D = 2,
    Eb = 3,
    E = 4,
    F = 5,
    Gb = 6,
    G = 7,
    Ab = 8,
    A = 9,
    Bb = 10,
    B = 11,
    EMusicalNoteName_MAX = 12,
};

enum class EQuarztClockManagerType {
    AudioEngine = 0,
    QuartzSubsystem = 1,
    Count = 2,
    EQuarztClockManagerType_MAX = 3,
};

enum class ESubmixEffectDynamicsChannelLinkMode {
    Disabled = 0,
    Average = 1,
    Peak = 2,
    Count = 3,
    ESubmixEffectDynamicsChannelLinkMode_MAX = 4,
};

enum class ESubmixEffectDynamicsKeySource {
    Default = 0,
    AudioBus = 1,
    Submix = 2,
    Count = 3,
    ESubmixEffectDynamicsKeySource_MAX = 4,
};

enum class ESubmixEffectDynamicsPeakMode {
    MeanSquared = 0,
    RootMeanSquared = 1,
    Peak = 2,
    Count = 3,
    ESubmixEffectDynamicsPeakMode_MAX = 4,
};

enum class ESubmixEffectDynamicsProcessorType {
    Compressor = 0,
    Limiter = 1,
    Expander = 2,
    Gate = 3,
    Count = 4,
    ESubmixEffectDynamicsProcessorType_MAX = 5,
};

// Size: 0x1a0
class UQuartzClockHandle : public UObject {
    /* 0x0170 */ UQuartzSubsystem* QuartzSubsystem;
    /* 0x0198 */ UWorld* WorldPtr;

    float GetBeatsPerMinute(const UObject* WorldContextObject) const;
    FQuartzTransportTimeStamp GetCurrentTimestamp(const UObject* WorldContextObject);
    float GetDurationOfQuantizationTypeInSeconds(const UObject* WorldContextObject, const EQuartzCommandQuantization& QuantizationType, float Multiplier);
    float GetEstimatedRunTime(const UObject* WorldContextObject);
    float GetMillisecondsPerTick(const UObject* WorldContextObject) const;
    float GetSecondsPerTick(const UObject* WorldContextObject) const;
    float GetThirtySecondNotesPerMinute(const UObject* WorldContextObject) const;
    float GetTicksPerSecond(const UObject* WorldContextObject) const;
    bool IsClockRunning(const UObject* WorldContextObject);
    void PauseClock(const UObject* WorldContextObject, UQuartzClockHandle*& ClockHandle);
    void ResetTransport(const UObject* WorldContextObject, const FDelegate& InDelegate);
    void ResetTransportQuantized(const UObject* WorldContextObject, FQuartzQuantizationBoundary InQuantizationBoundary, const FDelegate& InDelegate, UQuartzClockHandle*& ClockHandle);
    void ResumeClock(const UObject* WorldContextObject, UQuartzClockHandle*& ClockHandle);
    void SetBeatsPerMinute(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& delegate, UQuartzClockHandle*& ClockHandle, float BeatsPerMinute);
    void SetMillisecondsPerTick(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& delegate, UQuartzClockHandle*& ClockHandle, float MillisecondsPerTick);
    void SetSecondsPerTick(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& delegate, UQuartzClockHandle*& ClockHandle, float SecondsPerTick);
    void SetThirtySecondNotesPerMinute(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& delegate, UQuartzClockHandle*& ClockHandle, float ThirtySecondsNotesPerMinute);
    void SetTicksPerSecond(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& delegate, UQuartzClockHandle*& ClockHandle, float TicksPerSecond);
    void StartClock(const UObject* WorldContextObject, UQuartzClockHandle*& ClockHandle);
    void StartOtherClock(const UObject* WorldContextObject, FName OtherClockName, FQuartzQuantizationBoundary InQuantizationBoundary, const FDelegate& InDelegate);
    void StopClock(const UObject* WorldContextObject, bool CancelPendingEvents, UQuartzClockHandle*& ClockHandle);
    void SubscribeToAllQuantizationEvents(const UObject* WorldContextObject, const FDelegate& OnQuantizationEvent, UQuartzClockHandle*& ClockHandle);
    void SubscribeToQuantizationEvent(const UObject* WorldContextObject, EQuartzCommandQuantization InQuantizationBoundary, const FDelegate& OnQuantizationEvent, UQuartzClockHandle*& ClockHandle);
    void UnsubscribeFromAllTimeDivisions(const UObject* WorldContextObject, UQuartzClockHandle*& ClockHandle);
    void UnsubscribeFromTimeDivision(const UObject* WorldContextObject, EQuartzCommandQuantization InQuantizationBoundary, UQuartzClockHandle*& ClockHandle);
};

// Size: 0x160
class UQuartzSubsystem : public UTickableWorldSubsystem {

    UQuartzClockHandle* CreateNewClock(const UObject* WorldContextObject, FName ClockName, FQuartzClockSettings InSettings, bool bOverrideSettingsIfClockExists, bool bUseAudioEngineClockManager);
    void DeleteClockByHandle(const UObject* WorldContextObject, UQuartzClockHandle*& InClockHandle);
    void DeleteClockByName(const UObject* WorldContextObject, FName ClockName);
    bool DoesClockExist(const UObject* WorldContextObject, FName ClockName);
    float GetAudioRenderThreadToGameThreadAverageLatency();
    float GetAudioRenderThreadToGameThreadMaxLatency();
    float GetAudioRenderThreadToGameThreadMinLatency();
    FQuartzTransportTimeStamp GetCurrentClockTimestamp(const UObject* WorldContextObject, const FName& InClockName);
    float GetDurationOfQuantizationTypeInSeconds(const UObject* WorldContextObject, FName ClockName, const EQuartzCommandQuantization& QuantizationType, float Multiplier);
    float GetEstimatedClockRunTime(const UObject* WorldContextObject, const FName& InClockName);
    float GetGameThreadToAudioRenderThreadAverageLatency(const UObject* WorldContextObject);
    float GetGameThreadToAudioRenderThreadMaxLatency(const UObject* WorldContextObject);
    float GetGameThreadToAudioRenderThreadMinLatency(const UObject* WorldContextObject);
    UQuartzClockHandle* GetHandleForClock(const UObject* WorldContextObject, FName ClockName);
    float GetRoundTripAverageLatency(const UObject* WorldContextObject);
    float GetRoundTripMaxLatency(const UObject* WorldContextObject);
    float GetRoundTripMinLatency(const UObject* WorldContextObject);
    bool IsClockRunning(const UObject* WorldContextObject, FName ClockName);
    bool IsQuartzEnabled();
};

// Size: 0xc
struct FSubmixEffectDynamicProcessorFilterSettings {
    /* 0x0000 */ bool bEnabled;
    /* 0x0004 */ float Cutoff;
    /* 0x0008 */ float GainDb;
};

// Size: 0x158
class USubmixEffectDynamicsProcessorPreset : public USoundEffectSubmixPreset {
    /* 0x00f8 */ FSubmixEffectDynamicsProcessorSettings Settings;

    void ResetKey();
    void SetAudioBus(UAudioBus* AudioBus);
    void SetExternalSubmix(USoundSubmix* Submix);
    void SetSettings(const FSubmixEffectDynamicsProcessorSettings& Settings);
};

// Size: 0x60
struct FSubmixEffectDynamicsProcessorSettings {
    /* 0x0000 */ ESubmixEffectDynamicsProcessorType DynamicsProcessorType;
    /* 0x0001 */ ESubmixEffectDynamicsPeakMode PeakMode;
    /* 0x0002 */ ESubmixEffectDynamicsChannelLinkMode LinkMode;
    /* 0x0004 */ float InputGainDb;
    /* 0x0008 */ float ThresholdDb;
    /* 0x000c */ float Ratio;
    /* 0x0010 */ float KneeBandwidthDb;
    /* 0x0014 */ float LookAheadMsec;
    /* 0x0018 */ float AttackTimeMsec;
    /* 0x001c */ float ReleaseTimeMsec;
    /* 0x0020 */ ESubmixEffectDynamicsKeySource KeySource;
    /* 0x0028 */ UAudioBus* ExternalAudioBus;
    /* 0x0030 */ USoundSubmix* ExternalSubmix;
    /* 0x0038 */ bool bChannelLinked;
    /* 0x0038 */ bool bAnalogMode;
    /* 0x0038 */ bool bBypass;
    /* 0x0038 */ bool bKeyAudition;
    /* 0x003c */ float KeyGainDb;
    /* 0x0040 */ float OutputGainDb;
    /* 0x0044 */ FSubmixEffectDynamicProcessorFilterSettings KeyHighshelf;
    /* 0x0050 */ FSubmixEffectDynamicProcessorFilterSettings KeyLowshelf;
};

// Size: 0x10
struct FSubmixEffectEQBand {
    /* 0x0000 */ float Frequency;
    /* 0x0004 */ float Bandwidth;
    /* 0x0008 */ float GainDb;
    /* 0x000c */ bool bEnabled;
};

// Size: 0x118
class USubmixEffectReverbPreset : public USoundEffectSubmixPreset {
    /* 0x00d8 */ FSubmixEffectReverbSettings Settings;

    void SetSettings(const FSubmixEffectReverbSettings& InSettings);
    void SetSettingsWithReverbEffect(const UReverbEffect* InReverbEffect, const float WetLevel, const float DryLevel);
};

// Size: 0x40
struct FSubmixEffectReverbSettings {
    /* 0x0000 */ bool bBypassEarlyReflections;
    /* 0x0004 */ float ReflectionsDelay;
    /* 0x0008 */ float GainHF;
    /* 0x000c */ float ReflectionsGain;
    /* 0x0010 */ bool bBypassLateReflections;
    /* 0x0014 */ float LateDelay;
    /* 0x0018 */ float DecayTime;
    /* 0x001c */ float Density;
    /* 0x0020 */ float Diffusion;
    /* 0x0024 */ float AirAbsorptionGainHF;
    /* 0x0028 */ float DecayHFRatio;
    /* 0x002c */ float LateGain;
    /* 0x0030 */ float Gain;
    /* 0x0034 */ float WetLevel;
    /* 0x0038 */ float DryLevel;
    /* 0x003c */ bool bBypass;
};

// Size: 0xb8
class USubmixEffectSubmixEQPreset : public USoundEffectSubmixPreset {
    /* 0x00a8 */ FSubmixEffectSubmixEQSettings Settings;

    void SetSettings(const FSubmixEffectSubmixEQSettings& InSettings);
};

// Size: 0x10
struct FSubmixEffectSubmixEQSettings {
    /* 0x0000 */ TArray<FSubmixEffectEQBand> EQBands;
};

// Size: 0x720
class USynthComponent : public USceneComponent {
    /* 0x0228 */ bool bAutoDestroy;
    /* 0x0228 */ bool bStopWhenOwnerDestroyed;
    /* 0x0228 */ bool bAllowSpatialization;
    /* 0x0228 */ bool bOverrideAttenuation;
    /* 0x022c */ bool bOutputToBusOnly;
    /* 0x022c */ bool bEnableBusSends;
    /* 0x022c */ bool bEnableBaseSubmix;
    /* 0x022c */ bool bEnableSubmixSends;
    /* 0x0230 */ USoundAttenuation* AttenuationSettings;
    /* 0x0238 */ FSoundAttenuationSettings AttenuationOverrides;
    /* 0x0600 */ USoundConcurrency* ConcurrencySettings;
    /* 0x0608 */ TSet<USoundConcurrency*> ConcurrencySet;
    /* 0x0658 */ USoundClass* SoundClass;
    /* 0x0660 */ USoundEffectSourcePresetChain* SourceEffectChain;
    /* 0x0668 */ USoundSubmixBase* SoundSubmix;
    /* 0x0670 */ TArray<FSoundSubmixSendInfo> SoundSubmixSends;
    /* 0x0680 */ TArray<FSoundSourceBusSendInfo> BusSends;
    /* 0x0690 */ TArray<FSoundSourceBusSendInfo> PreEffectBusSends;
    /* 0x06a0 */ bool bIsUISound;
    /* 0x06a0 */ bool bIsPreviewSound;
    /* 0x06a4 */ int32_t EnvelopeFollowerAttackTime;
    /* 0x06a8 */ int32_t EnvelopeFollowerReleaseTime;
    /* 0x06b0 */ FMulticastInlineDelegate OnAudioEnvelopeValue;
    /* 0x06e0 */ USynthSound* Synth;
    /* 0x06e8 */ UAudioComponent* AudioComponent;

    bool IsPlaying() const;
    void SetLowPassFilterEnabled(bool InLowPassFilterEnabled);
    void SetLowPassFilterFrequency(float InLowPassFilterFrequency);
    void SetOutputToBusOnly(bool bInOutputToBusOnly);
    void SetSubmixSend(USoundSubmixBase* Submix, float SendLevel);
    void SetVolumeMultiplier(float VolumeMultiplier);
    void Start();
    void Stop();
};

// Size: 0x570
class USynthSound : public USoundWaveProcedural {
    /* 0x0550 */ USynthComponent* OwningSynthComponent;
};

enum class ESoundwaveSampleRateSettings {
    Max = 0,
    High = 1,
    Medium = 2,
    Low = 3,
    Min = 4,
    MatchDevice = 5,
    ESoundwaveSampleRateSettings_MAX = 6,
};

// Size: 0x10
struct FPlatformRuntimeAudioCompressionOverrides {
    /* 0x0000 */ bool bOverrideCompressionTimes;
    /* 0x0004 */ float DurationThreshold;
    /* 0x0008 */ int32_t MaxNumRandomBranches;
    /* 0x000c */ int32_t SoundCueQualityIndex;
};

// Size: 0xd0
class UAudioSynesthesiaNRT : public UAudioAnalyzerNRT {
};

// Size: 0x48
class UAudioSynesthesiaNRTSettings : public UAudioAnalyzerNRTSettings {
};

// Size: 0xd8
class UConstantQNRT : public UAudioSynesthesiaNRT {
    /* 0x00d0 */ UConstantQNRTSettings* Settings;

    void GetChannelConstantQAtTime(const float InSeconds, const int32_t InChannel, TArray<float>& OutConstantQ) const;
    void GetNormalizedChannelConstantQAtTime(const float InSeconds, const int32_t InChannel, TArray<float>& OutConstantQ) const;
};

// Size: 0x68
class UConstantQNRTSettings : public UAudioSynesthesiaNRTSettings {
    /* 0x0048 */ float StartingFrequency;
    /* 0x004c */ int32_t NumBands;
    /* 0x0050 */ float NumBandsPerOctave;
    /* 0x0054 */ float AnalysisPeriod;
    /* 0x0058 */ bool bDownmixToMono;
    /* 0x0059 */ EConstantQFFTSizeEnum FFTSize;
    /* 0x005a */ EFFTWindowType WindowType;
    /* 0x005b */ EAudioSpectrumType SpectrumType;
    /* 0x005c */ float BandWidthStretch;
    /* 0x0060 */ EConstantQNormalizationEnum CQTNormalization;
    /* 0x0064 */ float NoiseFloorDb;
};

enum class EConstantQFFTSizeEnum {
    Min = 0,
    XXSmall = 1,
    XSmall = 2,
    Small = 3,
    Medium = 4,
    Large = 5,
    XLarge = 6,
    XXLarge = 7,
    Max = 8,
    EConstantQFFTSizeEnum_MAX = 9,
};

enum class EConstantQNormalizationEnum {
    EqualEuclideanNorm = 0,
    EqualEnergy = 1,
    EqualAmplitude = 2,
    EConstantQNormalizationEnum_MAX = 3,
};

enum class ELoudnessNRTCurveTypeEnum {
    A = 0,
    B = 1,
    C = 2,
    D = 3,
    None = 4,
    ELoudnessNRTCurveTypeEnum_MAX = 5,
};

// Size: 0xd8
class ULoudnessNRT : public UAudioSynesthesiaNRT {
    /* 0x00d0 */ ULoudnessNRTSettings* Settings;

    void GetChannelLoudnessAtTime(const float InSeconds, const int32_t InChannel, float& OutLoudness) const;
    void GetLoudnessAtTime(const float InSeconds, float& OutLoudness) const;
    void GetNormalizedChannelLoudnessAtTime(const float InSeconds, const int32_t InChannel, float& OutLoudness) const;
    void GetNormalizedLoudnessAtTime(const float InSeconds, float& OutLoudness) const;
};

// Size: 0x60
class ULoudnessNRTSettings : public UAudioSynesthesiaNRTSettings {
    /* 0x0048 */ float AnalysisPeriod;
    /* 0x004c */ float MinimumFrequency;
    /* 0x0050 */ float MaximumFrequency;
    /* 0x0054 */ ELoudnessNRTCurveTypeEnum CurveType;
    /* 0x0058 */ float NoiseFloorDb;
};

// Size: 0xd8
class UOnsetNRT : public UAudioSynesthesiaNRT {
    /* 0x00d0 */ UOnsetNRTSettings* Settings;

    void GetChannelOnsetsBetweenTimes(const float InStartSeconds, const float InEndSeconds, const int32_t InChannel, TArray<float>& OutOnsetTimestamps, TArray<float>& OutOnsetStrengths) const;
    void GetNormalizedChannelOnsetsBetweenTimes(const float InStartSeconds, const float InEndSeconds, const int32_t InChannel, TArray<float>& OutOnsetTimestamps, TArray<float>& OutOnsetStrengths) const;
};

// Size: 0x60
class UOnsetNRTSettings : public UAudioSynesthesiaNRTSettings {
    /* 0x0048 */ bool bDownmixToMono;
    /* 0x004c */ float GranularityInSeconds;
    /* 0x0050 */ float Sensitivity;
    /* 0x0054 */ float MinimumFrequency;
    /* 0x0058 */ float MaximumFrequency;
};

// Size: 0x90
class UAudioSynesthesiaNRTFactory : public UFactory {
    /* 0x0088 */ UClass* AudioSynesthesiaNRTClass;
};

// Size: 0x90
class UAudioSynesthesiaNRTSettingsFactory : public UFactory {
    /* 0x0088 */ UClass* AudioSynesthesiaNRTSettingsClass;
};

// Size: 0x2f8
class AARActor : public AActor {

    UARComponent* AddARComponent(UClass* InComponentClass, const FGuid& NativeID);
};

// Size: 0x58
class UARBaseAsyncTaskBlueprintProxy : public UBlueprintAsyncActionBase {
};

// Size: 0x48
class UARBasicLightEstimate : public UARLightEstimate {
    /* 0x0030 */ float AmbientIntensityLumens;
    /* 0x0034 */ float AmbientColorTemperatureKelvin;
    /* 0x0038 */ FLinearColor AmbientColor;

    FLinearColor GetAmbientColor() const;
    float GetAmbientColorTemperatureKelvin() const;
    float GetAmbientIntensityLumens() const;
};

// Size: 0x30
class UARBlueprintLibrary : public UBlueprintFunctionLibrary {

    static bool AddManualEnvironmentCaptureProbe(FVector Location, FVector Extent);
    static UARCandidateImage* AddRuntimeCandidateImage(UARSessionConfig* SessionConfig, UTexture2D* CandidateTexture, FString FriendlyName, float PhysicalWidth);
    static bool AddTrackedPointWithName(const FTransform& WorldTransform, FString PointName, bool bDeletePointsWithSameName);
    static void CalculateAlignmentTransform(const FTransform& TransformInFirstCoordinateSystem, const FTransform& TransformInSecondCoordinateSystem, FTransform& AlignmentTransform);
    static void CalculateClosestIntersection(const TArray<FVector>& StartPoints, const TArray<FVector>& EndPoints, FVector& ClosestIntersection);
    static void DebugDrawPin(UARPin* ARPin, UObject* WorldContextObject, FLinearColor Color, float Scale, float PersistForSeconds);
    static void DebugDrawTrackedGeometry(UARTrackedGeometry* TrackedGeometry, UObject* WorldContextObject, FLinearColor Color, float OutlineThickness, float PersistForSeconds);
    static TArray<UARTrackedPoint*> FindTrackedPointsByName(FString PointName);
    static FARSessionStatus GetARSessionStatus();
    static UARTexture* GetARTexture(EARTextureType TextureType);
    static float GetARWorldScale();
    static FTransform GetAlignmentTransform();
    static TArray<UARTrackedGeometry*> GetAllGeometries();
    static TArray<UARTrackedGeometry*> GetAllGeometriesByClass(UClass* GeometryClass);
    static TArray<UARPin*> GetAllPins();
    static TArray<FARPose2D> GetAllTracked2DPoses();
    static TArray<UAREnvironmentCaptureProbe*> GetAllTrackedEnvironmentCaptureProbes();
    static TArray<UARTrackedImage*> GetAllTrackedImages();
    static TArray<UARPlaneGeometry*> GetAllTrackedPlanes();
    static TArray<UARTrackedPoint*> GetAllTrackedPoints();
    static TArray<UARTrackedPose*> GetAllTrackedPoses();
    static UARTextureCameraDepth* GetCameraDepth();
    static UARTextureCameraImage* GetCameraImage();
    static bool GetCameraIntrinsics(FARCameraIntrinsics& OutCameraIntrinsics);
    static UARLightEstimate* GetCurrentLightEstimate();
    static int32_t GetNumberOfTrackedFacesSupported();
    static bool GetObjectClassificationAtLocation(const FVector& InWorldLocation, EARObjectClassification& OutClassification, FVector& OutClassificationLocation, float MaxLocationDiff);
    static UARTexture* GetPersonSegmentationDepthImage();
    static UARTexture* GetPersonSegmentationImage();
    static TArray<FVector> GetPointCloud();
    static UARSessionConfig* GetSessionConfig();
    static TArray<FARVideoFormat> GetSupportedVideoFormats(EARSessionType SessionType);
    static EARTrackingQuality GetTrackingQuality();
    static EARTrackingQualityReason GetTrackingQualityReason();
    static EARWorldMappingState GetWorldMappingStatus();
    static bool IsARPinLocalStoreReady();
    static bool IsARPinLocalStoreSupported();
    static bool IsARSupported();
    static bool IsSceneReconstructionSupported(EARSessionType SessionType, EARSceneReconstruction SceneReconstructionMethod);
    static bool IsSessionTrackingFeatureSupported(EARSessionType SessionType, EARSessionTrackingFeature SessionTrackingFeature);
    static bool IsSessionTypeSupported(EARSessionType SessionType);
    static TArray<FARTraceResult> LineTraceTrackedObjects(const FVector2D ScreenCoord, bool bTestFeaturePoints, bool bTestGroundPlane, bool bTestPlaneExtents, bool bTestPlaneBoundaryPolygon);
    static TArray<FARTraceResult> LineTraceTrackedObjects3D(const FVector Start, const FVector End, bool bTestFeaturePoints, bool bTestGroundPlane, bool bTestPlaneExtents, bool bTestPlaneBoundaryPolygon);
    static TMap<FName, UARPin*> LoadARPinsFromLocalStore();
    static void PauseARSession();
    static UARPin* PinComponent(USceneComponent* ComponentToPin, const FTransform& PinToWorldTransform, UARTrackedGeometry* TrackedGeometry, const FName DebugName);
    static bool PinComponentToARPin(USceneComponent* ComponentToPin, UARPin* Pin);
    static UARPin* PinComponentToTraceResult(USceneComponent* ComponentToPin, const FARTraceResult& TraceResult, const FName DebugName);
    static void RemoveARPinFromLocalStore(FName InSaveName);
    static void RemoveAllARPinsFromLocalStore();
    static void RemovePin(UARPin* PinToRemove);
    static FIntPoint ResizeXRCamera(const FIntPoint& InSize);
    static bool SaveARPinToLocalStore(FName InSaveName, UARPin* InPin);
    static void SetARWorldOriginLocationAndRotation(FVector OriginLocation, FRotator OriginRotation, bool bIsTransformInWorldSpace, bool bMaintainUpDirection);
    static void SetARWorldScale(float InWorldScale);
    static void SetAlignmentTransform(const FTransform& InAlignmentTransform);
    static void SetEnabledXRCamera(bool bOnOff);
    static void StartARSession(UARSessionConfig* SessionConfig);
    static void StopARSession();
    static bool ToggleARCapture(const bool bOnOff, const EARCaptureType CaptureType);
    static void UnpinComponent(USceneComponent* ComponentToUnpin);
};

// Size: 0x18
struct FARCameraIntrinsics {
    /* 0x0000 */ FIntPoint ImageResolution;
    /* 0x0008 */ FVector2D FocalLength;
    /* 0x0010 */ FVector2D PrincipalPoint;
};

// Size: 0x60
class UARCandidateImage : public UDataAsset {
    /* 0x0038 */ UTexture2D* CandidateTexture;
    /* 0x0040 */ FString FriendlyName;
    /* 0x0050 */ float Width;
    /* 0x0054 */ float Height;
    /* 0x0058 */ EARCandidateImageOrientation Orientation;

    UTexture2D* GetCandidateTexture() const;
    FString GetFriendlyName() const;
    EARCandidateImageOrientation GetOrientation() const;
    float GetPhysicalHeight() const;
    float GetPhysicalWidth() const;
};

// Size: 0x78
class UARCandidateObject : public UDataAsset {
    /* 0x0038 */ TArray<uint8_t> CandidateObjectData;
    /* 0x0048 */ FString FriendlyName;
    /* 0x0058 */ FBox BoundingBox;

    FBox GetBoundingBox() const;
    TArray<uint8_t> GetCandidateObjectData() const;
    FString GetFriendlyName() const;
    void SetBoundingBox(const FBox& InBoundingBox);
    void SetCandidateObjectData(const TArray<uint8_t>& InCandidateObject);
    void SetFriendlyName(FString NewName);
};

// Size: 0x2b0
class UARComponent : public USceneComponent {
    /* 0x0228 */ FGuid NativeID;
    /* 0x0268 */ bool bUseDefaultReplication;
    /* 0x0270 */ UMaterialInterface* DefaultMeshMaterial;
    /* 0x0278 */ UMaterialInterface* DefaultWireframeMeshMaterial;
    /* 0x0280 */ UMRMeshComponent* MRMeshComponent;
    /* 0x0288 */ UARTrackedGeometry* MyTrackedGeometry;

    UMRMeshComponent* GetMRMesh();
    void OnRep_Payload();
    void ReceiveRemove();
    void SetNativeID(FGuid NativeID);
    void UpdateVisualization();
};

// Size: 0x30
class UARDependencyHandler : public UObject {

    void CheckARServiceAvailability(UObject* WorldContextObject, FLatentActionInfo LatentInfo, EARServiceAvailability& OutAvailability);
    static UARDependencyHandler* GetARDependencyHandler();
    void InstallARService(UObject* WorldContextObject, FLatentActionInfo LatentInfo, EARServiceInstallRequestResult& OutInstallResult);
    void RequestARSessionPermission(UObject* WorldContextObject, UARSessionConfig* SessionConfig, FLatentActionInfo LatentInfo, EARServicePermissionRequestResult& OutPermissionResult);
    void StartARSessionLatent(UObject* WorldContextObject, UARSessionConfig* SessionConfig, FLatentActionInfo LatentInfo);
};

// Size: 0x120
class UAREnvironmentCaptureProbe : public UARTrackedGeometry {
    /* 0x0100 */ FVector Extent;
    /* 0x0110 */ UAREnvironmentCaptureProbeTexture* EnvironmentCaptureTexture;

    UAREnvironmentCaptureProbeTexture* GetEnvironmentCaptureTexture();
    FVector GetExtent() const;
};

// Size: 0x410
class UAREnvironmentCaptureProbeTexture : public UTextureCube {
    /* 0x03f0 */ EARTextureType TextureType;
    /* 0x03f4 */ float Timestamp;
    /* 0x03f8 */ FGuid ExternalTextureGuid;
    /* 0x0408 */ FVector2D Size;
};

// Size: 0x2e0
class UAREnvironmentProbeComponent : public UARComponent {
    /* 0x02b0 */ FAREnvironmentProbeUpdatePayload ReplicatedPayload;

    void ReceiveAdd(const FAREnvironmentProbeUpdatePayload& Payload);
    void ReceiveUpdate(const FAREnvironmentProbeUpdatePayload& Payload);
    void ServerUpdatePayload(const FAREnvironmentProbeUpdatePayload NewPayload);
};

// Size: 0x30
struct FAREnvironmentProbeUpdatePayload {
    /* 0x0000 */ FTransform WorldTransform;
};

// Size: 0x310
class UARFaceComponent : public UARComponent {
    /* 0x02a8 */ EARFaceTransformMixing TransformSetting;
    /* 0x02a9 */ bool bUpdateVertexNormal;
    /* 0x02aa */ bool bFaceOutOfScreen;
    /* 0x02b0 */ FARFaceUpdatePayload ReplicatedPayload;

    void ReceiveAdd(const FARFaceUpdatePayload& Payload);
    void ReceiveUpdate(const FARFaceUpdatePayload& Payload);
    void ServerUpdatePayload(const FARFaceUpdatePayload NewPayload);
    static void SetFaceComponentDebugMode(EFaceComponentDebugMode NewDebugMode);
};

// Size: 0x1f0
class UARFaceGeometry : public UARTrackedGeometry {
    /* 0x0100 */ FVector LookAtTarget;
    /* 0x010c */ bool bIsTracked;
    /* 0x0110 */ TMap<EARFaceBlendShape, float> BlendShapes;
    /* 0x0190 */ FTransform LeftEyeTransform;
    /* 0x01c0 */ FTransform RightEyeTransform;

    float GetBlendShapeValue(EARFaceBlendShape BlendShape) const;
    TMap<EARFaceBlendShape, float> GetBlendShapes() const;
    FTransform GetLocalSpaceEyeTransform(EAREye Eye) const;
    FTransform GetWorldSpaceEyeTransform(EAREye Eye) const;
};

// Size: 0x40
struct FARFaceUpdatePayload {
    /* 0x0000 */ FARSessionPayload SessionPayload;
    /* 0x0018 */ FVector LeftEyePosition;
    /* 0x0024 */ FVector RightEyePosition;
    /* 0x0030 */ FVector LookAtTarget;
};

// Size: 0x110
class UARGeoAnchor : public UARTrackedGeometry {

    float GetAltitudeMeters() const;
    EARAltitudeSource GetAltitudeSource() const;
    float GetLatitude() const;
    float GetLongitude() const;
};

// Size: 0x320
class UARGeoAnchorComponent : public UARComponent {
    /* 0x02b0 */ FARGeoAnchorUpdatePayload ReplicatedPayload;

    void ReceiveAdd(const FARGeoAnchorUpdatePayload& Payload);
    void ReceiveUpdate(const FARGeoAnchorUpdatePayload& Payload);
    void ServerUpdatePayload(const FARGeoAnchorUpdatePayload NewPayload);
    static void SetGeoAnchorComponentDebugMode(EGeoAnchorComponentDebugMode NewDebugMode);
};

// Size: 0x70
struct FARGeoAnchorUpdatePayload {
    /* 0x0000 */ FARSessionPayload SessionPayload;
    /* 0x0020 */ FTransform WorldTransform;
    /* 0x0050 */ float Longitude;
    /* 0x0054 */ float Latitude;
    /* 0x0058 */ float AltitudeMeters;
    /* 0x005c */ EARAltitudeSource AltitudeSource;
    /* 0x0060 */ FString AnchorName;
};

// Size: 0x30
class UARGeoTrackingSupport : public UObject {

    bool AddGeoAnchorAtLocation(float Longitude, float Latitude, FString OptionalAnchorName);
    bool AddGeoAnchorAtLocationWithAltitude(float Longitude, float Latitude, float AltitudeMeters, FString OptionalAnchorName);
    EARGeoTrackingAccuracy GetGeoTrackingAccuracy() const;
    EARGeoTrackingState GetGeoTrackingState() const;
    EARGeoTrackingStateReason GetGeoTrackingStateReason() const;
    static UARGeoTrackingSupport* GetGeoTrackingSupport();
};

// Size: 0xa0
class UARGetCandidateObjectAsyncTaskBlueprintProxy : public UARBaseAsyncTaskBlueprintProxy {
    /* 0x0058 */ FMulticastInlineDelegate OnSuccess;
    /* 0x0068 */ FMulticastInlineDelegate OnFailed;

    static UARGetCandidateObjectAsyncTaskBlueprintProxy* ARGetCandidateObject(UObject* WorldContextObject, FVector Location, FVector Extent);
};

// Size: 0x310
class UARImageComponent : public UARComponent {
    /* 0x02b0 */ FARImageUpdatePayload ReplicatedPayload;

    void ReceiveAdd(const FARImageUpdatePayload& Payload);
    void ReceiveUpdate(const FARImageUpdatePayload& Payload);
    void ServerUpdatePayload(const FARImageUpdatePayload NewPayload);
    static void SetImageComponentDebugMode(EImageComponentDebugMode NewDebugMode);
};

// Size: 0x60
struct FARImageUpdatePayload {
    /* 0x0000 */ FARSessionPayload SessionPayload;
    /* 0x0020 */ FTransform WorldTransform;
    /* 0x0050 */ UARCandidateImage* DetectedImage;
    /* 0x0058 */ FVector2D EstimatedSize;
};

// Size: 0x260
class UARLifeCycleComponent : public USceneComponent {
    /* 0x0228 */ FMulticastInlineDelegate OnARActorSpawnedDelegate;
    /* 0x0238 */ FMulticastInlineDelegate OnARActorToBeDestroyedDelegate;

    void InstanceARActorSpawnedDelegate__DelegateSignature(UClass* ComponentClass, FGuid NativeID, AARActor* SpawnedActor);
    void InstanceARActorToBeDestroyedDelegate__DelegateSignature(AARActor* Actor);
    void ServerDestroyARActor(AARActor* Actor);
    void ServerSpawnARActor(UClass* ComponentClass, FGuid NativeID);
};

// Size: 0x30
class UARLightEstimate : public UObject {
};

// Size: 0x310
class UARMeshComponent : public UARComponent {
    /* 0x02b0 */ FARMeshUpdatePayload ReplicatedPayload;

    void ReceiveAdd(const FARMeshUpdatePayload& Payload);
    void ReceiveUpdate(const FARMeshUpdatePayload& Payload);
    void ServerUpdatePayload(const FARMeshUpdatePayload NewPayload);
};

// Size: 0x100
class UARMeshGeometry : public UARTrackedGeometry {

    bool GetObjectClassificationAtLocation(const FVector& InWorldLocation, EARObjectClassification& OutClassification, FVector& OutClassificationLocation, float MaxLocationDiff);
};

// Size: 0x60
struct FARMeshUpdatePayload {
    /* 0x0000 */ FARSessionPayload SessionPayload;
    /* 0x0020 */ FTransform WorldTransform;
    /* 0x0050 */ EARObjectClassification ObjectClassification;
};

// Size: 0x2e0
class UARObjectComponent : public UARComponent {
    /* 0x02b0 */ FARObjectUpdatePayload ReplicatedPayload;

    void ReceiveAdd(const FARObjectUpdatePayload& Payload);
    void ReceiveUpdate(const FARObjectUpdatePayload& Payload);
    void ServerUpdatePayload(const FARObjectUpdatePayload NewPayload);
};

// Size: 0x30
struct FARObjectUpdatePayload {
    /* 0x0000 */ FTransform WorldTransform;
};

// Size: 0x2f8
class AAROriginActor : public AActor {
};

// Size: 0xf0
class UARPin : public UObject {
    /* 0x0030 */ UARTrackedGeometry* TrackedGeometry;
    /* 0x0038 */ USceneComponent* PinnedComponent;
    /* 0x0040 */ FTransform LocalToTrackingTransform;
    /* 0x0070 */ FTransform LocalToAlignedTrackingTransform;
    /* 0x00a0 */ EARTrackingState TrackingState;
    /* 0x00c8 */ FMulticastInlineDelegate OnARTrackingStateChanged;
    /* 0x00d8 */ FMulticastInlineDelegate OnARTransformUpdated;

    void DebugDraw(UWorld* World, const FLinearColor& Color, float Scale, float PersistForSeconds) const;
    FName GetDebugName() const;
    FTransform GetLocalToTrackingTransform() const;
    FTransform GetLocalToWorldTransform() const;
    USceneComponent* GetPinnedComponent() const;
    UARTrackedGeometry* GetTrackedGeometry() const;
    EARTrackingState GetTrackingState() const;
};

// Size: 0x330
class UARPlaneComponent : public UARComponent {
    /* 0x02b0 */ FARPlaneUpdatePayload ReplicatedPayload;

    static TMap<EARObjectClassification, FLinearColor> GetObjectClassificationDebugColors();
    void ReceiveAdd(const FARPlaneUpdatePayload& Payload);
    void ReceiveUpdate(const FARPlaneUpdatePayload& Payload);
    void ServerUpdatePayload(const FARPlaneUpdatePayload NewPayload);
    static void SetObjectClassificationDebugColors(const TMap<EARObjectClassification, FLinearColor>& InColors);
    static void SetPlaneComponentDebugMode(EPlaneComponentDebugMode NewDebugMode);
};

// Size: 0x140
class UARPlaneGeometry : public UARTrackedGeometry {
    /* 0x0100 */ EARPlaneOrientation Orientation;
    /* 0x0104 */ FVector Center;
    /* 0x0110 */ FVector Extent;
    /* 0x0120 */ TArray<FVector> BoundaryPolygon;
    /* 0x0130 */ UARPlaneGeometry* SubsumedBy;

    TArray<FVector> GetBoundaryPolygonInLocalSpace() const;
    FVector GetCenter() const;
    FVector GetExtent() const;
    EARPlaneOrientation GetOrientation() const;
    UARPlaneGeometry* GetSubsumedBy() const;
};

// Size: 0x80
struct FARPlaneUpdatePayload {
    /* 0x0000 */ FARSessionPayload SessionPayload;
    /* 0x0020 */ FTransform WorldTransform;
    /* 0x0050 */ FVector Center;
    /* 0x005c */ FVector Extents;
    /* 0x0068 */ TArray<FVector> BoundaryVertices;
    /* 0x0078 */ EARObjectClassification ObjectClassification;
};

// Size: 0x2b0
class UARPointComponent : public UARComponent {
    /* 0x02a8 */ FARPointUpdatePayload ReplicatedPayload;

    void ReceiveAdd(const FARPointUpdatePayload& Payload);
    void ReceiveUpdate(const FARPointUpdatePayload& Payload);
    void ServerUpdatePayload(const FARPointUpdatePayload NewPayload);
};

// Size: 0x1
struct FARPointUpdatePayload {
};

// Size: 0x48
struct FARPose2D {
    /* 0x0000 */ FARSkeletonDefinition SkeletonDefinition;
    /* 0x0028 */ TArray<FVector2D> JointLocations;
    /* 0x0038 */ TArray<bool> IsJointTracked;
};

// Size: 0x50
struct FARPose3D {
    /* 0x0000 */ FARSkeletonDefinition SkeletonDefinition;
    /* 0x0028 */ TArray<FTransform> JointTransforms;
    /* 0x0038 */ TArray<bool> IsJointTracked;
    /* 0x0048 */ EARJointTransformSpace JointTransformSpace;
};

// Size: 0x2f0
class UARPoseComponent : public UARComponent {
    /* 0x02b0 */ FARPoseUpdatePayload ReplicatedPayload;

    void ReceiveAdd(const FARPoseUpdatePayload& Payload);
    void ReceiveUpdate(const FARPoseUpdatePayload& Payload);
    void ServerUpdatePayload(const FARPoseUpdatePayload NewPayload);
    static void SetPoseComponentDebugMode(EPoseComponentDebugMode NewDebugMode);
};

// Size: 0x40
struct FARPoseUpdatePayload {
    /* 0x0000 */ FTransform WorldTransform;
    /* 0x0030 */ TArray<FTransform> JointTransforms;
};

// Size: 0x320
class UARQRCodeComponent : public UARComponent {
    /* 0x02b0 */ FARQRCodeUpdatePayload ReplicatedPayload;

    void ReceiveAdd(const FARQRCodeUpdatePayload& Payload);
    void ReceiveUpdate(const FARQRCodeUpdatePayload& Payload);
    void ServerUpdatePayload(const FARQRCodeUpdatePayload NewPayload);
    static void SetQRCodeComponentDebugMode(EQRCodeComponentDebugMode NewDebugMode);
};

// Size: 0x70
struct FARQRCodeUpdatePayload {
    /* 0x0000 */ FARSessionPayload SessionPayload;
    /* 0x0020 */ FTransform WorldTransform;
    /* 0x0050 */ FVector Extents;
    /* 0x0060 */ FString QRCode;
};

// Size: 0x88
class UARSaveWorldAsyncTaskBlueprintProxy : public UARBaseAsyncTaskBlueprintProxy {
    /* 0x0058 */ FMulticastInlineDelegate OnSuccess;
    /* 0x0068 */ FMulticastInlineDelegate OnFailed;

    static UARSaveWorldAsyncTaskBlueprintProxy* ARSaveWorld(UObject* WorldContextObject);
};

// Size: 0x118
class UARSessionConfig : public UDataAsset {
    /* 0x0038 */ bool bGenerateMeshDataFromTrackedGeometry;
    /* 0x0039 */ bool bGenerateCollisionForMeshData;
    /* 0x003a */ bool bGenerateNavMeshForMeshData;
    /* 0x003b */ bool bUseMeshDataForOcclusion;
    /* 0x003c */ bool bRenderMeshDataInWireframe;
    /* 0x003d */ bool bTrackSceneObjects;
    /* 0x003e */ bool bUsePersonSegmentationForOcclusion;
    /* 0x003f */ bool bUseSceneDepthForOcclusion;
    /* 0x0040 */ bool bUseAutomaticImageScaleEstimation;
    /* 0x0041 */ bool bUseStandardOnboardingUX;
    /* 0x0042 */ EARWorldAlignment WorldAlignment;
    /* 0x0043 */ EARSessionType SessionType;
    /* 0x0044 */ EARPlaneDetectionMode PlaneDetectionMode;
    /* 0x0045 */ bool bHorizontalPlaneDetection;
    /* 0x0046 */ bool bVerticalPlaneDetection;
    /* 0x0047 */ bool bEnableAutoFocus;
    /* 0x0048 */ EARLightEstimationMode LightEstimationMode;
    /* 0x0049 */ EARFrameSyncMode FrameSyncMode;
    /* 0x004a */ bool bEnableAutomaticCameraOverlay;
    /* 0x004b */ bool bEnableAutomaticCameraTracking;
    /* 0x004c */ bool bResetCameraTracking;
    /* 0x004d */ bool bResetTrackedObjects;
    /* 0x0050 */ TArray<UARCandidateImage*> CandidateImages;
    /* 0x0060 */ int32_t MaxNumSimultaneousImagesTracked;
    /* 0x0064 */ EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType;
    /* 0x0068 */ TArray<uint8_t> WorldMapData;
    /* 0x0078 */ TArray<UARCandidateObject*> CandidateObjects;
    /* 0x0088 */ FARVideoFormat DesiredVideoFormat;
    /* 0x0094 */ bool bUseOptimalVideoFormat;
    /* 0x0095 */ EARFaceTrackingDirection FaceTrackingDirection;
    /* 0x0096 */ EARFaceTrackingUpdate FaceTrackingUpdate;
    /* 0x0098 */ int32_t MaxNumberOfTrackedFaces;
    /* 0x00a0 */ TArray<uint8_t> SerializedARCandidateImageDatabase;
    /* 0x00b0 */ EARSessionTrackingFeature EnabledSessionTrackingFeature;
    /* 0x00b1 */ EARSceneReconstruction SceneReconstructionMethod;
    /* 0x00b8 */ UClass* PlaneComponentClass;
    /* 0x00c0 */ UClass* PointComponentClass;
    /* 0x00c8 */ UClass* FaceComponentClass;
    /* 0x00d0 */ UClass* ImageComponentClass;
    /* 0x00d8 */ UClass* QRCodeComponentClass;
    /* 0x00e0 */ UClass* PoseComponentClass;
    /* 0x00e8 */ UClass* EnvironmentProbeComponentClass;
    /* 0x00f0 */ UClass* ObjectComponentClass;
    /* 0x00f8 */ UClass* MeshComponentClass;
    /* 0x0100 */ UClass* GeoAnchorComponentClass;
    /* 0x0108 */ UMaterialInterface* DefaultMeshMaterial;
    /* 0x0110 */ UMaterialInterface* DefaultWireframeMeshMaterial;

    void AddCandidateImage(UARCandidateImage* NewCandidateImage);
    void AddCandidateObject(UARCandidateObject* CandidateObject);
    TArray<UARCandidateImage*> GetCandidateImageList() const;
    TArray<UARCandidateObject*> GetCandidateObjectList() const;
    FARVideoFormat GetDesiredVideoFormat() const;
    EARSessionTrackingFeature GetEnabledSessionTrackingFeature() const;
    EAREnvironmentCaptureProbeType GetEnvironmentCaptureProbeType() const;
    EARFaceTrackingDirection GetFaceTrackingDirection() const;
    EARFaceTrackingUpdate GetFaceTrackingUpdate() const;
    EARFrameSyncMode GetFrameSyncMode() const;
    EARLightEstimationMode GetLightEstimationMode() const;
    int32_t GetMaxNumSimultaneousImagesTracked() const;
    EARPlaneDetectionMode GetPlaneDetectionMode() const;
    EARSceneReconstruction GetSceneReconstructionMethod() const;
    EARSessionType GetSessionType() const;
    EARWorldAlignment GetWorldAlignment() const;
    TArray<uint8_t> GetWorldMapData() const;
    void SetCandidateObjectList(const TArray<UARCandidateObject*>& InCandidateObjects);
    void SetDesiredVideoFormat(FARVideoFormat NewFormat);
    void SetEnableAutoFocus(bool bNewValue);
    void SetFaceTrackingDirection(EARFaceTrackingDirection InDirection);
    void SetFaceTrackingUpdate(EARFaceTrackingUpdate InUpdate);
    void SetResetCameraTracking(bool bNewValue);
    void SetResetTrackedObjects(bool bNewValue);
    void SetSceneReconstructionMethod(EARSceneReconstruction InSceneReconstructionMethod);
    void SetSessionTrackingFeatureToEnable(EARSessionTrackingFeature InSessionTrackingFeature);
    void SetWorldMapData(TArray<uint8_t> WorldMapData);
    bool ShouldEnableAutoFocus() const;
    bool ShouldEnableCameraTracking() const;
    bool ShouldRenderCameraOverlay() const;
    bool ShouldResetCameraTracking() const;
    bool ShouldResetTrackedObjects() const;
};

// Size: 0x18
struct FARSessionPayload {
    /* 0x0000 */ int32_t ConfigFlags;
    /* 0x0008 */ UMaterialInterface* DefaultMeshMaterial;
    /* 0x0010 */ UMaterialInterface* DefaultWireframeMeshMaterial;
};

// Size: 0x18
struct FARSessionStatus {
    /* 0x0000 */ FString AdditionalInfo;
    /* 0x0010 */ EARSessionStatus Status;
};

// Size: 0x458
class AARSharedWorldGameMode : public AGameMode {
    /* 0x03f0 */ int32_t BufferSizePerChunk;

    AARSharedWorldGameState* GetARSharedWorldGameState();
    void SetARSharedWorldData(TArray<uint8_t> ARWorldData);
    void SetARWorldSharingIsReady();
    void SetPreviewImageData(TArray<uint8_t> ImageData);
};

// Size: 0x3b0
class AARSharedWorldGameState : public AGameState {
    /* 0x0378 */ TArray<uint8_t> PreviewImageData;
    /* 0x0388 */ TArray<uint8_t> ARWorldData;
    /* 0x0398 */ int32_t PreviewImageBytesTotal;
    /* 0x039c */ int32_t ARWorldBytesTotal;
    /* 0x03a0 */ int32_t PreviewImageBytesDelivered;
    /* 0x03a4 */ int32_t ARWorldBytesDelivered;

    void K2_OnARWorldMapIsReady();
};

// Size: 0x668
class AARSharedWorldPlayerController : public APlayerController {

    void ClientInitSharedWorld(int32_t PreviewImageSize, int32_t ARWorldDataSize);
    void ClientUpdateARWorldData(int32_t Offset, const TArray<uint8_t> Buffer);
    void ClientUpdatePreviewImageData(int32_t Offset, const TArray<uint8_t> Buffer);
    void ServerMarkReadyForReceiving();
};

// Size: 0x8
struct FARSharedWorldReplicationState {
    /* 0x0000 */ int32_t PreviewImageOffset;
    /* 0x0004 */ int32_t ARWorldOffset;
};

// Size: 0x28
struct FARSkeletonDefinition {
    /* 0x0000 */ int32_t NumJoints;
    /* 0x0008 */ TArray<FName> JointNames;
    /* 0x0018 */ TArray<int32_t> ParentIndices;
};

// Size: 0x320
class AARSkyLight : public ASkyLight {
    /* 0x0310 */ UAREnvironmentCaptureProbe* CaptureProbe;

    void SetEnvironmentCaptureProbe(UAREnvironmentCaptureProbe* InCaptureProbe);
};

// Size: 0x3c0
class UARTexture : public UTexture {
    /* 0x0398 */ EARTextureType TextureType;
    /* 0x039c */ float Timestamp;
    /* 0x03a0 */ FGuid ExternalTextureGuid;
    /* 0x03b0 */ FVector2D Size;
};

// Size: 0x3c0
class UARTextureCameraDepth : public UARTexture {
    /* 0x03b8 */ EARDepthQuality DepthQuality;
    /* 0x03b9 */ EARDepthAccuracy DepthAccuracy;
    /* 0x03ba */ bool bIsTemporallySmoothed;
};

// Size: 0x3c0
class UARTextureCameraImage : public UARTexture {
};

// Size: 0x60
struct FARTraceResult {
    /* 0x0000 */ float DistanceFromCamera;
    /* 0x0004 */ EARLineTraceChannels TraceChannel;
    /* 0x0010 */ FTransform LocalTransform;
    /* 0x0040 */ UARTrackedGeometry* TrackedGeometry;
};

// Size: 0x30
class UARTraceResultDummy : public UObject {
};

// Size: 0x30
class UARTraceResultLibrary : public UBlueprintFunctionLibrary {

    static float GetDistanceFromCamera(const FARTraceResult& TraceResult);
    static FTransform GetLocalToTrackingTransform(const FARTraceResult& TraceResult);
    static FTransform GetLocalToWorldTransform(const FARTraceResult& TraceResult);
    static FTransform GetLocalTransform(const FARTraceResult& TraceResult);
    static EARLineTraceChannels GetTraceChannel(const FARTraceResult& TraceResult);
    static UARTrackedGeometry* GetTrackedGeometry(const FARTraceResult& TraceResult);
};

// Size: 0x210
class UARTrackableNotifyComponent : public UActorComponent {
    /* 0x00c0 */ FMulticastInlineDelegate OnAddTrackedGeometry;
    /* 0x00d0 */ FMulticastInlineDelegate OnUpdateTrackedGeometry;
    /* 0x00e0 */ FMulticastInlineDelegate OnRemoveTrackedGeometry;
    /* 0x00f0 */ FMulticastInlineDelegate OnAddTrackedPlane;
    /* 0x0100 */ FMulticastInlineDelegate OnUpdateTrackedPlane;
    /* 0x0110 */ FMulticastInlineDelegate OnRemoveTrackedPlane;
    /* 0x0120 */ FMulticastInlineDelegate OnAddTrackedPoint;
    /* 0x0130 */ FMulticastInlineDelegate OnUpdateTrackedPoint;
    /* 0x0140 */ FMulticastInlineDelegate OnRemoveTrackedPoint;
    /* 0x0150 */ FMulticastInlineDelegate OnAddTrackedImage;
    /* 0x0160 */ FMulticastInlineDelegate OnUpdateTrackedImage;
    /* 0x0170 */ FMulticastInlineDelegate OnRemoveTrackedImage;
    /* 0x0180 */ FMulticastInlineDelegate OnAddTrackedFace;
    /* 0x0190 */ FMulticastInlineDelegate OnUpdateTrackedFace;
    /* 0x01a0 */ FMulticastInlineDelegate OnRemoveTrackedFace;
    /* 0x01b0 */ FMulticastInlineDelegate OnAddTrackedEnvProbe;
    /* 0x01c0 */ FMulticastInlineDelegate OnUpdateTrackedEnvProbe;
    /* 0x01d0 */ FMulticastInlineDelegate OnRemoveTrackedEnvProbe;
    /* 0x01e0 */ FMulticastInlineDelegate OnAddTrackedObject;
    /* 0x01f0 */ FMulticastInlineDelegate OnUpdateTrackedObject;
    /* 0x0200 */ FMulticastInlineDelegate OnRemoveTrackedObject;
};

// Size: 0x100
class UARTrackedGeometry : public UObject {
    /* 0x0030 */ FGuid UniqueId;
    /* 0x0040 */ FTransform LocalToTrackingTransform;
    /* 0x0070 */ FTransform LocalToAlignedTrackingTransform;
    /* 0x00a0 */ EARTrackingState TrackingState;
    /* 0x00b0 */ UMRMeshComponent* UnderlyingMesh;
    /* 0x00b8 */ EARObjectClassification ObjectClassification;
    /* 0x00b9 */ EARSpatialMeshUsageFlags SpatialMeshUsageFlags;
    /* 0x00d0 */ int32_t LastUpdateFrameNumber;
    /* 0x00e0 */ FName DebugName;

    FName GetDebugName() const;
    int32_t GetLastUpdateFrameNumber() const;
    float GetLastUpdateTimestamp() const;
    FTransform GetLocalToTrackingTransform() const;
    FTransform GetLocalToWorldTransform() const;
    FString GetName() const;
    EARObjectClassification GetObjectClassification() const;
    EARTrackingState GetTrackingState() const;
    UMRMeshComponent* GetUnderlyingMesh();
    bool HasSpatialMeshUsageFlag(const EARSpatialMeshUsageFlags InFlag) const;
    bool IsTracked() const;
};

// Size: 0x110
class UARTrackedImage : public UARTrackedGeometry {
    /* 0x0100 */ UARCandidateImage* DetectedImage;
    /* 0x0108 */ FVector2D EstimatedSize;

    UARCandidateImage* GetDetectedImage() const;
    FVector2D GetEstimateSize();
};

// Size: 0x110
class UARTrackedObject : public UARTrackedGeometry {
    /* 0x0100 */ UARCandidateObject* DetectedObject;

    UARCandidateObject* GetDetectedObject() const;
};

// Size: 0x100
class UARTrackedPoint : public UARTrackedGeometry {
};

// Size: 0x150
class UARTrackedPose : public UARTrackedGeometry {
    /* 0x0100 */ FARPose3D TrackedPose;

    FARPose3D GetTrackedPoseData() const;
};

// Size: 0x130
class UARTrackedQRCode : public UARTrackedImage {
    /* 0x0110 */ FString QRCode;
    /* 0x0120 */ int32_t Version;
};

// Size: 0x30
class UARTypesDummyClass : public UObject {
};

// Size: 0xc
struct FARVideoFormat {
    /* 0x0000 */ int32_t FPS;
    /* 0x0004 */ int32_t Width;
    /* 0x0008 */ int32_t Height;
};

// Size: 0xa8
class UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy : public UARBaseAsyncTaskBlueprintProxy {
    /* 0x0058 */ FMulticastInlineDelegate OnSuccess;
    /* 0x0068 */ FMulticastInlineDelegate OnFailed;

    static UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy* CheckGeoTrackingAvailability(UObject* WorldContextObject);
    static UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy* CheckGeoTrackingAvailabilityAtLocation(UObject* WorldContextObject, float Longitude, float Latitude);
    void GeoTrackingAvailabilityDelegate__DelegateSignature(bool bIsAvailable, FString Error);
};

enum class EARAltitudeSource {
    Precise = 0,
    Coarse = 1,
    UserDefined = 2,
    Unknown = 3,
    EARAltitudeSource_MAX = 4,
};

enum class EARCandidateImageOrientation {
    Landscape = 0,
    Portrait = 1,
    EARCandidateImageOrientation_MAX = 2,
};

enum class EARCaptureType {
    Camera = 0,
    QRCode = 1,
    SpatialMapping = 2,
    SceneUnderstanding = 3,
    HandMesh = 4,
    EARCaptureType_MAX = 5,
};

enum class EARDepthAccuracy {
    Unkown = 0,
    Approximate = 1,
    Accurate = 2,
    EARDepthAccuracy_MAX = 3,
};

enum class EARDepthQuality {
    Unkown = 0,
    Low = 1,
    High = 2,
    EARDepthQuality_MAX = 3,
};

enum class EAREnvironmentCaptureProbeType {
    None = 0,
    Manual = 1,
    Automatic = 2,
    EAREnvironmentCaptureProbeType_MAX = 3,
};

enum class EAREye {
    LeftEye = 0,
    RightEye = 1,
    EAREye_MAX = 2,
};

enum class EARFaceBlendShape {
    EyeBlinkLeft = 0,
    EyeLookDownLeft = 1,
    EyeLookInLeft = 2,
    EyeLookOutLeft = 3,
    EyeLookUpLeft = 4,
    EyeSquintLeft = 5,
    EyeWideLeft = 6,
    EyeBlinkRight = 7,
    EyeLookDownRight = 8,
    EyeLookInRight = 9,
    EyeLookOutRight = 10,
    EyeLookUpRight = 11,
    EyeSquintRight = 12,
    EyeWideRight = 13,
    JawForward = 14,
    JawLeft = 15,
    JawRight = 16,
    JawOpen = 17,
    MouthClose = 18,
    MouthFunnel = 19,
    MouthPucker = 20,
    MouthLeft = 21,
    MouthRight = 22,
    MouthSmileLeft = 23,
    MouthSmileRight = 24,
    MouthFrownLeft = 25,
    MouthFrownRight = 26,
    MouthDimpleLeft = 27,
    MouthDimpleRight = 28,
    MouthStretchLeft = 29,
    MouthStretchRight = 30,
    MouthRollLower = 31,
    MouthRollUpper = 32,
    MouthShrugLower = 33,
    MouthShrugUpper = 34,
    MouthPressLeft = 35,
    MouthPressRight = 36,
    MouthLowerDownLeft = 37,
    MouthLowerDownRight = 38,
    MouthUpperUpLeft = 39,
    MouthUpperUpRight = 40,
    BrowDownLeft = 41,
    BrowDownRight = 42,
    BrowInnerUp = 43,
    BrowOuterUpLeft = 44,
    BrowOuterUpRight = 45,
    CheekPuff = 46,
    CheekSquintLeft = 47,
    CheekSquintRight = 48,
    NoseSneerLeft = 49,
    NoseSneerRight = 50,
    TongueOut = 51,
    HeadYaw = 52,
    HeadPitch = 53,
    HeadRoll = 54,
    LeftEyeYaw = 55,
    LeftEyePitch = 56,
    LeftEyeRoll = 57,
    RightEyeYaw = 58,
    RightEyePitch = 59,
    RightEyeRoll = 60,
    MAX = 61,
};

enum class EARFaceTrackingDirection {
    FaceRelative = 0,
    FaceMirrored = 1,
    EARFaceTrackingDirection_MAX = 2,
};

enum class EARFaceTrackingUpdate {
    CurvesAndGeo = 0,
    CurvesOnly = 1,
    EARFaceTrackingUpdate_MAX = 2,
};

enum class EARFaceTransformMixing {
    ComponentOnly = 0,
    ComponentLocationTrackedRotation = 1,
    ComponentWithTracked = 2,
    TrackingOnly = 3,
    EARFaceTransformMixing_MAX = 4,
};

enum class EARFrameSyncMode {
    SyncTickWithCameraImage = 0,
    SyncTickWithoutCameraImage = 1,
    EARFrameSyncMode_MAX = 2,
};

enum class EARGeoTrackingAccuracy {
    Undetermined = 0,
    Low = 1,
    Medium = 2,
    High = 3,
    EARGeoTrackingAccuracy_MAX = 4,
};

enum class EARGeoTrackingState {
    Initializing = 0,
    Localized = 1,
    Localizing = 2,
    NotAvailable = 3,
    EARGeoTrackingState_MAX = 4,
};

enum class EARGeoTrackingStateReason {
    None = 0,
    NotAvailableAtLocation = 1,
    NeedLocationPermissions = 2,
    DevicePointedTooLow = 3,
    WorldTrackingUnstable = 4,
    WaitingForLocation = 5,
    GeoDataNotLoaded = 6,
    VisualLocalizationFailed = 7,
    WaitingForAvailabilityCheck = 8,
    EARGeoTrackingStateReason_MAX = 9,
};

enum class EARJointTransformSpace {
    Model = 0,
    ParentJoint = 1,
    EARJointTransformSpace_MAX = 2,
};

enum class EARLightEstimationMode {
    None = 0,
    AmbientLightEstimate = 1,
    DirectionalLightEstimate = 2,
    EARLightEstimationMode_MAX = 3,
};

enum class EARLineTraceChannels {
    None = 0,
    FeaturePoint = 1,
    GroundPlane = 2,
    PlaneUsingExtent = 4,
    PlaneUsingBoundaryPolygon = 8,
    EARLineTraceChannels_MAX = 9,
};

enum class EARObjectClassification {
    NotApplicable = 0,
    Unknown = 1,
    Wall = 2,
    Ceiling = 3,
    Floor = 4,
    Table = 5,
    Seat = 6,
    Face = 7,
    Image = 8,
    World = 9,
    SceneObject = 10,
    HandMesh = 11,
    Door = 12,
    Window = 13,
    EARObjectClassification_MAX = 14,
};

enum class EARPlaneDetectionMode {
    None = 0,
    HorizontalPlaneDetection = 1,
    VerticalPlaneDetection = 2,
    EARPlaneDetectionMode_MAX = 3,
};

enum class EARPlaneOrientation {
    Horizontal = 0,
    Vertical = 1,
    Diagonal = 2,
    EARPlaneOrientation_MAX = 3,
};

enum class EARSceneReconstruction {
    None = 0,
    MeshOnly = 1,
    MeshWithClassification = 2,
    EARSceneReconstruction_MAX = 3,
};

enum class EARServiceAvailability {
    UnknownError = 0,
    UnknownChecking = 1,
    UnknownTimedOut = 2,
    UnsupportedDeviceNotCapable = 3,
    SupportedNotInstalled = 4,
    SupportedVersionTooOld = 5,
    SupportedInstalled = 6,
    EARServiceAvailability_MAX = 7,
};

enum class EARServiceInstallRequestResult {
    Installed = 0,
    DeviceNotCompatible = 1,
    UserDeclinedInstallation = 2,
    FatalError = 3,
    EARServiceInstallRequestResult_MAX = 4,
};

enum class EARServicePermissionRequestResult {
    Granted = 0,
    Denied = 1,
    EARServicePermissionRequestResult_MAX = 2,
};

enum class EARSessionConfigFlags {
    None = 0,
    GenerateMeshData = 1,
    RenderMeshDataInWireframe = 2,
    GenerateCollisionForMeshData = 4,
    GenerateNavMeshForMeshData = 8,
    UseMeshDataForOcclusion = 16,
    EARSessionConfigFlags_MAX = 17,
};

enum class EARSessionStatus {
    NotStarted = 0,
    Running = 1,
    NotSupported = 2,
    FatalError = 3,
    PermissionNotGranted = 4,
    UnsupportedConfiguration = 5,
    Other = 6,
    EARSessionStatus_MAX = 7,
};

enum class EARSessionTrackingFeature {
    None = 0,
    PoseDetection2D = 1,
    PersonSegmentation = 2,
    PersonSegmentationWithDepth = 3,
    SceneDepth = 4,
    SmoothedSceneDepth = 5,
    EARSessionTrackingFeature_MAX = 6,
};

enum class EARSessionType {
    None = 0,
    Orientation = 1,
    World = 2,
    Face = 3,
    Image = 4,
    ObjectScanning = 5,
    PoseTracking = 6,
    GeoTracking = 7,
    EARSessionType_MAX = 8,
};

enum class EARSpatialMeshUsageFlags {
    NotApplicable = 0,
    Visible = 1,
    Collision = 2,
    EARSpatialMeshUsageFlags_MAX = 3,
};

enum class EARTextureType {
    Unknown = 0,
    CameraImage = 1,
    CameraDepth = 2,
    EnvironmentCapture = 3,
    PersonSegmentationImage = 4,
    PersonSegmentationDepth = 5,
    SceneDepthMap = 6,
    SceneDepthConfidenceMap = 7,
    EARTextureType_MAX = 8,
};

enum class EARTrackingQuality {
    NotTracking = 0,
    OrientationOnly = 1,
    OrientationAndPosition = 2,
    EARTrackingQuality_MAX = 3,
};

enum class EARTrackingQualityReason {
    None = 0,
    Initializing = 1,
    Relocalizing = 2,
    ExcessiveMotion = 3,
    InsufficientFeatures = 4,
    InsufficientLight = 5,
    BadState = 6,
    EARTrackingQualityReason_MAX = 7,
};

enum class EARTrackingState {
    Unknown = 0,
    Tracking = 1,
    NotTracking = 2,
    StoppedTracking = 3,
    EARTrackingState_MAX = 4,
};

enum class EARWorldAlignment {
    Gravity = 0,
    GravityAndHeading = 1,
    Camera = 2,
    EARWorldAlignment_MAX = 3,
};

enum class EARWorldMappingState {
    NotAvailable = 0,
    StillMappingNotRelocalizable = 1,
    StillMappingRelocalizable = 2,
    Mapped = 3,
    EARWorldMappingState_MAX = 4,
};

enum class EFaceComponentDebugMode {
    None = 0,
    ShowEyeVectors = 1,
    ShowFaceMesh = 2,
    EFaceComponentDebugMode_MAX = 3,
};

enum class EGeoAnchorComponentDebugMode {
    None = 0,
    ShowGeoData = 1,
    EGeoAnchorComponentDebugMode_MAX = 2,
};

enum class EImageComponentDebugMode {
    None = 0,
    ShowDetectedImage = 1,
    EImageComponentDebugMode_MAX = 2,
};

enum class EPlaneComponentDebugMode {
    None = 0,
    ShowNetworkRole = 1,
    ShowClassification = 2,
    EPlaneComponentDebugMode_MAX = 3,
};

enum class EPoseComponentDebugMode {
    None = 0,
    ShowSkeleton = 1,
    EPoseComponentDebugMode_MAX = 2,
};

enum class EQRCodeComponentDebugMode {
    None = 0,
    ShowQRCode = 1,
    EQRCodeComponentDebugMode_MAX = 2,
};

// Size: 0xa8
class UGetGeoLocationAsyncTaskBlueprintProxy : public UARBaseAsyncTaskBlueprintProxy {
    /* 0x0058 */ FMulticastInlineDelegate OnSuccess;
    /* 0x0068 */ FMulticastInlineDelegate OnFailed;

    static UGetGeoLocationAsyncTaskBlueprintProxy* GetGeoLocationAtWorldPosition(UObject* WorldContextObject, const FVector& WorldPosition);
    void GetGeoLocationDelegate__DelegateSignature(float Longitude, float Latitude, float Altitude, FString Error);
};

// Size: 0x18
struct FTrackedGeometryGroup {
    /* 0x0000 */ AARActor* ARActor;
    /* 0x0008 */ UARComponent* ARComponent;
    /* 0x0010 */ UARTrackedGeometry* TrackedGeometry;
};

// Size: 0x18
struct FAutomatedTestFilter {
    /* 0x0000 */ FString Contains;
    /* 0x0010 */ bool MatchFromStart;
};

// Size: 0x20
struct FAutomatedTestGroup {
    /* 0x0000 */ FString Name;
    /* 0x0010 */ TArray<FAutomatedTestFilter> Filters;
};

// Size: 0xb0
struct FAutomatedTestPassResults {
    /* 0x0000 */ FString ClientDescriptor;
    /* 0x0010 */ FDateTime ReportCreatedOn;
    /* 0x0018 */ int32_t Succeeded;
    /* 0x001c */ int32_t SucceededWithWarnings;
    /* 0x0020 */ int32_t Failed;
    /* 0x0024 */ int32_t NotRun;
    /* 0x0028 */ int32_t InProcess;
    /* 0x002c */ float TotalDuration;
    /* 0x0030 */ bool ComparisonExported;
    /* 0x0038 */ FString ComparisonExportDirectory;
    /* 0x0048 */ TArray<FAutomatedTestResult> Tests;
};

// Size: 0x60
struct FAutomatedTestResult {
    /* 0x0010 */ FString TestDisplayName;
    /* 0x0020 */ FString FullTestPath;
    /* 0x0030 */ EAutomationState State;
    /* 0x0038 */ TArray<FAutomationExecutionEntry> Entries;
    /* 0x0048 */ int32_t Warnings;
    /* 0x004c */ int32_t Errors;
    /* 0x0050 */ TArray<FAutomationArtifact> Artifacts;
};

// Size: 0xc8
struct FAutomationArtifact {
    /* 0x0000 */ FGuid ID;
    /* 0x0010 */ FString Name;
    /* 0x0020 */ EAutomationArtifactType Type;
    /* 0x0028 */ TMap<FString, FString> Files;
};

// Size: 0x50
class UAutomationControllerSettings : public UObject {
    /* 0x0030 */ TArray<FAutomatedTestGroup> Groups;
    /* 0x0040 */ bool bSuppressLogErrors;
    /* 0x0041 */ bool bSuppressLogWarnings;
    /* 0x0042 */ bool bTreatLogWarningsAsTestErrors;
    /* 0x0044 */ float CheckTestIntervalSeconds;
    /* 0x0048 */ float GameInstanceLostTimerSeconds;
};

enum class EAutomationArtifactType {
    None = 0,
    Image = 1,
    Comparison = 2,
    EAutomationArtifactType_MAX = 3,
};

enum class EAutomationState {
    NotRun = 0,
    InProcess = 1,
    Fail = 2,
    Success = 3,
    NotEnoughParticipants = 4,
    EAutomationState_MAX = 5,
};

// Size: 0x128
struct FAutomationScreenshotMetadata {
    /* 0x0000 */ FString ScreenShotName;
    /* 0x0010 */ FString Context;
    /* 0x0020 */ FString TestName;
    /* 0x0030 */ FString Notes;
    /* 0x0040 */ FGuid ID;
    /* 0x0050 */ FString Commit;
    /* 0x0060 */ int32_t Width;
    /* 0x0064 */ int32_t Height;
    /* 0x0068 */ FString RHI;
    /* 0x0078 */ FString Platform;
    /* 0x0088 */ FString FeatureLevel;
    /* 0x0098 */ bool bIsStereo;
    /* 0x00a0 */ FString Vendor;
    /* 0x00b0 */ FString AdapterName;
    /* 0x00c0 */ FString AdapterInternalDriverVersion;
    /* 0x00d0 */ FString AdapterUserDriverVersion;
    /* 0x00e0 */ FString UniqueDeviceId;
    /* 0x00f0 */ float ResolutionQuality;
    /* 0x00f4 */ int32_t ViewDistanceQuality;
    /* 0x00f8 */ int32_t AntiAliasingQuality;
    /* 0x00fc */ int32_t ShadowQuality;
    /* 0x0100 */ int32_t PostProcessQuality;
    /* 0x0104 */ int32_t TextureQuality;
    /* 0x0108 */ int32_t EffectsQuality;
    /* 0x010c */ int32_t FoliageQuality;
    /* 0x0110 */ int32_t ShadingQuality;
    /* 0x0114 */ bool bHasComparisonRules;
    /* 0x0115 */ uint8_t ToleranceRed;
    /* 0x0116 */ uint8_t ToleranceGreen;
    /* 0x0117 */ uint8_t ToleranceBlue;
    /* 0x0118 */ uint8_t ToleranceAlpha;
    /* 0x0119 */ uint8_t ToleranceMinBrightness;
    /* 0x011a */ uint8_t ToleranceMaxBrightness;
    /* 0x011c */ float MaximumLocalError;
    /* 0x0120 */ float MaximumGlobalError;
    /* 0x0124 */ bool bIgnoreAntiAliasing;
    /* 0x0125 */ bool bIgnoreColors;
};

// Size: 0x38
struct FAutomationWorkerFindWorkers {
    /* 0x0000 */ int32_t Changelist;
    /* 0x0008 */ FString GameName;
    /* 0x0018 */ FString ProcessName;
    /* 0x0028 */ FGuid SessionId;
};

// Size: 0x98
struct FAutomationWorkerFindWorkersResponse {
    /* 0x0000 */ FString DeviceName;
    /* 0x0010 */ FString InstanceName;
    /* 0x0020 */ FString Platform;
    /* 0x0030 */ FString OSVersionName;
    /* 0x0040 */ FString ModelName;
    /* 0x0050 */ FString GPUName;
    /* 0x0060 */ FString CPUModelName;
    /* 0x0070 */ uint32_t RAMInGB;
    /* 0x0078 */ FString RenderModeName;
    /* 0x0088 */ FGuid SessionId;
};

// Size: 0x38
struct FAutomationWorkerImageComparisonResults {
    /* 0x0000 */ FGuid UniqueId;
    /* 0x0010 */ bool bNew;
    /* 0x0011 */ bool bSimilar;
    /* 0x0018 */ double MaxLocalDifference;
    /* 0x0020 */ double GlobalDifference;
    /* 0x0028 */ FString ErrorMessage;
};

// Size: 0x1
struct FAutomationWorkerNextNetworkCommandReply {
};

// Size: 0x40
struct FAutomationWorkerPerformanceDataRequest {
    /* 0x0000 */ FString Platform;
    /* 0x0010 */ FString Hardware;
    /* 0x0020 */ FString TestName;
    /* 0x0030 */ TArray<double> DataPoints;
};

// Size: 0x18
struct FAutomationWorkerPerformanceDataResponse {
    /* 0x0000 */ bool bSuccess;
    /* 0x0008 */ FString ErrorMessage;
};

// Size: 0x1
struct FAutomationWorkerPing {
};

// Size: 0x1
struct FAutomationWorkerPong {
};

// Size: 0x4
struct FAutomationWorkerRequestNextNetworkCommand {
    /* 0x0000 */ uint32_t ExecutionCount;
};

// Size: 0x8
struct FAutomationWorkerRequestTests {
    /* 0x0000 */ bool DeveloperDirectoryIncluded;
    /* 0x0004 */ uint32_t RequestedTestFlags;
};

// Size: 0x10
struct FAutomationWorkerRequestTestsReplyComplete {
    /* 0x0000 */ TArray<FAutomationWorkerSingleTestReply> Tests;
};

// Size: 0x1
struct FAutomationWorkerResetTests {
};

// Size: 0x30
struct FAutomationWorkerRunTests {
    /* 0x0000 */ uint32_t ExecutionCount;
    /* 0x0004 */ int32_t RoleIndex;
    /* 0x0008 */ FString TestName;
    /* 0x0018 */ FString BeautifiedTestName;
    /* 0x0028 */ bool bSendAnalytics;
};

// Size: 0x38
struct FAutomationWorkerRunTestsReply {
    /* 0x0000 */ FString TestName;
    /* 0x0010 */ TArray<FAutomationExecutionEntry> Entries;
    /* 0x0020 */ int32_t WarningTotal;
    /* 0x0024 */ int32_t ErrorTotal;
    /* 0x0028 */ float Duration;
    /* 0x002c */ uint32_t ExecutionCount;
    /* 0x0030 */ bool Success;
};

// Size: 0x158
struct FAutomationWorkerScreenImage {
    /* 0x0000 */ TArray<uint8_t> ScreenImage;
    /* 0x0010 */ TArray<uint8_t> FrameTrace;
    /* 0x0020 */ FString ScreenShotName;
    /* 0x0030 */ FAutomationScreenshotMetadata MetaData;
};

// Size: 0x80
struct FAutomationWorkerSingleTestReply {
    /* 0x0000 */ FString DisplayName;
    /* 0x0010 */ FString FullTestPath;
    /* 0x0020 */ FString TestName;
    /* 0x0030 */ FString TestParameter;
    /* 0x0040 */ FString SourceFile;
    /* 0x0050 */ int32_t SourceFileLine;
    /* 0x0058 */ FString AssetPath;
    /* 0x0068 */ FString OpenCommand;
    /* 0x0078 */ uint32_t TestFlags;
    /* 0x007c */ uint32_t NumParticipantsRequired;
};

// Size: 0x1
struct FAutomationWorkerStopTests {
};

// Size: 0x50
struct FAutomationWorkerTestDataRequest {
    /* 0x0000 */ FString DataType;
    /* 0x0010 */ FString DataPlatform;
    /* 0x0020 */ FString DataTestName;
    /* 0x0030 */ FString DataName;
    /* 0x0040 */ FString JsonData;
};

// Size: 0x18
struct FAutomationWorkerTestDataResponse {
    /* 0x0000 */ FString JsonData;
    /* 0x0010 */ bool bIsNew;
};

// Size: 0x1
struct FAutomationWorkerWorkerOffline {
};

// Size: 0x30
class UAutomationUtilsBlueprintLibrary : public UBlueprintFunctionLibrary {

    static void TakeGameplayAutomationScreenshot(const FString ScreenShotName, float MaxGlobalError, float MaxLocalError, FString MapNameOverride);
};

// Size: 0x88
class UScreenshotComparisonCommandlet : public UCommandlet {
};

// Size: 0x40
struct FAutomationTestPreset {
    /* 0x0008 */ FName ID;
    /* 0x0018 */ FText Name;
    /* 0x0030 */ TArray<FString> EnabledTests;
};

// Size: 0x88
class UAvfFileMediaSourceFactory : public UFactory {
};

// Size: 0x38
class UAvfMediaSettings : public UObject {
    /* 0x0030 */ bool NativeAudioOut;
};

// Size: 0xb0
class UBehaviorTreeDecoratorGraph : public UEdGraph {
};

// Size: 0xd0
class UBehaviorTreeDecoratorGraphNode : public UEdGraphNode {
};

// Size: 0x140
class UBehaviorTreeDecoratorGraphNode_Decorator : public UBehaviorTreeDecoratorGraphNode {
    /* 0x00d0 */ UObject* NodeInstance;
    /* 0x00d8 */ FGraphNodeClassData ClassData;
};

// Size: 0xd8
class UBehaviorTreeDecoratorGraphNode_Logic : public UBehaviorTreeDecoratorGraphNode {
    /* 0x00d0 */ uint8_t LogicMode;
};

// Size: 0x30
class UBehaviorTreeEditorTypes : public UObject {
};

// Size: 0x88
class UBehaviorTreeFactory : public UFactory {
};

// Size: 0xc0
class UBehaviorTreeGraph : public UAIGraph {
    /* 0x00b8 */ int32_t ModCounter;
    /* 0x00bc */ bool bIsUsingModCounter;
};

// Size: 0x1a8
class UBehaviorTreeGraphNode : public UAIGraphNode {
    /* 0x0168 */ TArray<UBehaviorTreeGraphNode*> Decorators;
    /* 0x0178 */ TArray<UBehaviorTreeGraphNode*> Services;
    /* 0x0188 */ bool bInjectedNode;
};

// Size: 0x1a8
class UBehaviorTreeGraphNode_Composite : public UBehaviorTreeGraphNode {
};

// Size: 0x1e8
class UBehaviorTreeGraphNode_CompositeDecorator : public UBehaviorTreeGraphNode {
    /* 0x01a8 */ UEdGraph* BoundGraph;
    /* 0x01b0 */ FString CompositeName;
    /* 0x01c0 */ bool bShowOperations;
    /* 0x01c0 */ bool bCanAbortFlow;
    /* 0x01c8 */ UBTCompositeNode* ParentNodeInstance;
    /* 0x01d8 */ FString CachedDescription;
};

// Size: 0x1a8
class UBehaviorTreeGraphNode_Decorator : public UBehaviorTreeGraphNode {
};

// Size: 0x1b0
class UBehaviorTreeGraphNode_Root : public UBehaviorTreeGraphNode {
    /* 0x01a8 */ UBlackboardData* BlackboardAsset;
};

// Size: 0x1a8
class UBehaviorTreeGraphNode_Service : public UBehaviorTreeGraphNode {
};

// Size: 0x1a8
class UBehaviorTreeGraphNode_SimpleParallel : public UBehaviorTreeGraphNode_Composite {
};

// Size: 0x1c0
class UBehaviorTreeGraphNode_SubtreeTask : public UBehaviorTreeGraphNode_Task {
};

// Size: 0x1a8
class UBehaviorTreeGraphNode_Task : public UBehaviorTreeGraphNode {
};

// Size: 0x100
struct FBehaviorTreeSchemaAction_AutoArrange : public FEdGraphSchemaAction {
};

// Size: 0x88
class UBlackboardDataFactory : public UFactory {
};

// Size: 0x108
struct FDecoratorSchemaAction_NewNode : public FEdGraphSchemaAction {
    /* 0x0100 */ UBehaviorTreeDecoratorGraphNode* NodeTemplate;
};

enum class EDecoratorLogicMode {
    Sink = 0,
    And = 1,
    Or = 2,
    Not = 3,
    EDecoratorLogicMode_MAX = 4,
};

// Size: 0x30
class UEdGraphSchema_BehaviorTree : public UAIGraphSchema {
};

// Size: 0x40
class UEdGraphSchema_BehaviorTreeDecorator : public UEdGraphSchema {
    /* 0x0030 */ FString PC_Boolean;
};

// Size: 0x3a0
class ABlank4_27GameModeBase : public AGameModeBase {
};

// Size: 0x160
class UBlueprintBoundEventNodeSpawner : public UBlueprintEventNodeSpawner {
    /* 0x0130 */ FFieldPath EventDelegate;
};

// Size: 0x148
class UBlueprintBoundNodeSpawner : public UBlueprintNodeSpawner {
};

// Size: 0x50
struct FBlueprintCallableFunctionRedirect {
    /* 0x0000 */ FString ClassName;
    /* 0x0010 */ FString OldFunctionName;
    /* 0x0020 */ FString NewFunctionName;
    /* 0x0030 */ FString BlueprintParamName;
    /* 0x0040 */ FString ClassParamName;
};

// Size: 0x140
class UBlueprintComponentNodeSpawner : public UBlueprintNodeSpawner {
    /* 0x0118 */ UClass* ComponentClass;
    /* 0x0120 */ FString ComponentName;
    /* 0x0130 */ FString ComponentAssetName;
};

// Size: 0x168
class UBlueprintDelegateNodeSpawner : public UBlueprintFieldNodeSpawner {
};

// Size: 0x128
class UBlueprintEditorSettings : public UObject {
    /* 0x0030 */ bool bDrawMidpointArrowsInBlueprints;
    /* 0x0031 */ bool bShowGraphInstructionText;
    /* 0x0032 */ bool bHideUnrelatedNodes;
    /* 0x0033 */ bool bShowShortTooltips;
    /* 0x0034 */ bool bSplitContextTargetSettings;
    /* 0x0035 */ bool bExposeAllMemberComponentFunctions;
    /* 0x0036 */ bool bShowContextualFavorites;
    /* 0x0037 */ bool bExposeDeprecatedFunctions;
    /* 0x0038 */ bool bCompactCallOnMemberNodes;
    /* 0x0039 */ bool bFlattenFavoritesMenus;
    /* 0x003a */ bool bFavorPureCastNodes;
    /* 0x003b */ bool bAutoCastObjectConnections;
    /* 0x003c */ bool bShowViewportOnSimulate;
    /* 0x003d */ bool bShowInheritedVariables;
    /* 0x003e */ bool bAlwaysShowInterfacesInOverrides;
    /* 0x003f */ bool bShowParentClassInOverrides;
    /* 0x0040 */ bool bShowEmptySections;
    /* 0x0041 */ bool bShowAccessSpecifier;
    /* 0x0042 */ bool bSpawnDefaultBlueprintNodes;
    /* 0x0043 */ bool bHideConstructionScriptComponentsInDetailsView;
    /* 0x0044 */ bool bHostFindInBlueprintsInGlobalTab;
    /* 0x0045 */ bool bNavigateToNativeFunctionsFromCallNodes;
    /* 0x0048 */ TMap<FGuid, FEditedDocumentInfo> Bookmarks;
    /* 0x0098 */ TArray<FBPEditorBookmarkNode> BookmarkNodes;
    /* 0x00a8 */ bool bIncludeCommentNodesInBookmarksTab;
    /* 0x00a9 */ bool bShowBookmarksForCurrentDocumentOnlyInTab;
    /* 0x00b0 */ TMap<int32_t, FEditedDocumentInfo> GraphEditorQuickJumps;
    /* 0x0100 */ uint8_t SaveOnCompile;
    /* 0x0101 */ bool bJumpToNodeErrors;
    /* 0x0102 */ bool bAllowExplicitImpureNodeDisabling;
    /* 0x0103 */ bool bShowActionMenuItemSignatures;
    /* 0x0104 */ bool bBlueprintNodeUniqueNames;
    /* 0x0108 */ TArray<FString> NamespacesToAlwaysInclude;
    /* 0x0118 */ bool bShowDetailedCompileResults;
    /* 0x011c */ int32_t CompileEventDisplayThresholdMs;
    /* 0x0120 */ float NodeTemplateCacheCapMB;
};

// Size: 0x130
class UBlueprintEventNodeSpawner : public UBlueprintNodeSpawner {
    /* 0x0118 */ UFunction* EventFunc;
    /* 0x0120 */ FName CustomEventName;
};

// Size: 0x168
class UBlueprintFieldNodeSpawner : public UBlueprintNodeSpawner {
    /* 0x0128 */ UClass* OwnerClass;
    /* 0x0130 */ UField* Field;
    /* 0x0138 */ FFieldPath Property;
};

// Size: 0x168
class UBlueprintFunctionNodeSpawner : public UBlueprintFieldNodeSpawner {
};

// Size: 0x118
class UBlueprintNodeSpawner : public UObject {
    /* 0x0038 */ UClass* NodeClass;
};

// Size: 0x260
class UBlueprintVariableNodeSpawner : public UBlueprintFieldNodeSpawner {
    /* 0x0168 */ UEdGraph* LocalVarOuter;
    /* 0x0170 */ FBPVariableDescription LocalVarDesc;
};

// Size: 0x1c
struct FCustomPin {
    /* 0x0000 */ FName PinName;
    /* 0x000c */ FName CallFuncPinName;
    /* 0x0018 */ bool bValuePin;
};

enum class EEdGraphSchemaAction_K2Graph {
    Graph = 0,
    Subgraph = 1,
    Function = 2,
    Interface = 3,
    Macro = 4,
    MAX = 5,
};

enum class ESaveOnCompile {
    SoC_Never = 0,
    SoC_SuccessOnly = 1,
    SoC_Always = 2,
    SoC_MAX = 3,
};

enum class ESelfContextInfo {
    Unspecified = 0,
    NotSelfContext = 1,
    ESelfContextInfo_MAX = 2,
};

enum class ETunnelBoundaryType {
    Unknown = 0,
    EntrySite = 1,
    InputSite = 2,
    OutputSite = 3,
    ETunnelBoundaryType_MAX = 4,
};

// Size: 0x118
struct FEdGraphSchemaAction_BlueprintVariableBase : public FEdGraphSchemaAction {
};

// Size: 0x108
struct FEdGraphSchemaAction_EventFromFunction : public FEdGraphSchemaAction {
    /* 0x0100 */ UFunction* SignatureFunction;
};

// Size: 0x120
struct FEdGraphSchemaAction_K2AddCallOnActor : public FEdGraphSchemaAction_K2NewNode {
    /* 0x0110 */ TArray<AActor*> LevelActors;
};

// Size: 0x100
struct FEdGraphSchemaAction_K2AddComment : public FEdGraphSchemaAction {
};

// Size: 0x120
struct FEdGraphSchemaAction_K2AddComponent : public FEdGraphSchemaAction_K2NewNode {
    /* 0x0110 */ UClass* ComponentClass;
    /* 0x0118 */ UObject* ComponentAsset;
};

// Size: 0x110
struct FEdGraphSchemaAction_K2AddCustomEvent : public FEdGraphSchemaAction_K2NewNode {
};

// Size: 0x110
struct FEdGraphSchemaAction_K2AddEvent : public FEdGraphSchemaAction_K2NewNode {
};

// Size: 0x110
struct FEdGraphSchemaAction_K2AssignDelegate : public FEdGraphSchemaAction_K2NewNode {
};

// Size: 0x120
struct FEdGraphSchemaAction_K2Delegate : public FEdGraphSchemaAction_BlueprintVariableBase {
};

// Size: 0x108
struct FEdGraphSchemaAction_K2Enum : public FEdGraphSchemaAction {
};

// Size: 0x110
struct FEdGraphSchemaAction_K2Event : public FEdGraphSchemaAction_K2TargetNode {
};

// Size: 0x118
struct FEdGraphSchemaAction_K2Graph : public FEdGraphSchemaAction {
};

// Size: 0x110
struct FEdGraphSchemaAction_K2InputAction : public FEdGraphSchemaAction_K2TargetNode {
};

// Size: 0x118
struct FEdGraphSchemaAction_K2LocalVar : public FEdGraphSchemaAction_BlueprintVariableBase {
};

// Size: 0x110
struct FEdGraphSchemaAction_K2NewNode : public FEdGraphSchemaAction {
    /* 0x0100 */ UK2Node* NodeTemplate;
    /* 0x0108 */ bool bGotoNode;
};

// Size: 0x100
struct FEdGraphSchemaAction_K2PasteHere : public FEdGraphSchemaAction {
};

// Size: 0x108
struct FEdGraphSchemaAction_K2Struct : public FEdGraphSchemaAction {
};

// Size: 0x110
struct FEdGraphSchemaAction_K2TargetNode : public FEdGraphSchemaAction_K2NewNode {
};

// Size: 0x118
struct FEdGraphSchemaAction_K2Var : public FEdGraphSchemaAction_BlueprintVariableBase {
};

// Size: 0x108
struct FEdGraphSchemaAction_K2ViewNode : public FEdGraphSchemaAction {
    /* 0x0100 */ UK2Node* NodePtr;
};

// Size: 0x40
class UEdGraphSchema_K2 : public UEdGraphSchema {
    /* 0x0030 */ TArray<FBlueprintCallableFunctionRedirect> EditoronlyBPFunctionRedirects;
};

// Size: 0xc8
class UK2Node : public UEdGraphNode {
};

// Size: 0x1b0
class UK2Node_ActorBoundEvent : public UK2Node_Event {
    /* 0x0170 */ FName DelegatePropertyName;
    /* 0x0180 */ UClass* DelegateOwnerClass;
    /* 0x0188 */ AActor* EventOwner;
};

// Size: 0x178
class UK2Node_AddComponent : public UK2Node_CallFunction {
    /* 0x0158 */ bool bHasExposedVariable;
    /* 0x0160 */ FString TemplateBlueprint;
    /* 0x0170 */ UClass* TemplateType;
};

// Size: 0x100
class UK2Node_AddComponentByClass : public UK2Node_ConstructObjectFromClass {
};

// Size: 0x120
class UK2Node_AddDelegate : public UK2Node_BaseMCDelegate {
};

// Size: 0x30
class IK2Node_AddPinInterface : public UInterface {
};

// Size: 0x140
class UK2Node_AssignDelegate : public UK2Node_AddDelegate {
};

// Size: 0xc8
class UK2Node_AssignmentStatement : public UK2Node {
};

// Size: 0xf8
class UK2Node_AsyncAction : public UK2Node_BaseAsyncTask {
};

// Size: 0xf8
class UK2Node_BaseAsyncTask : public UK2Node {
    /* 0x00c8 */ FName ProxyFactoryFunctionName;
    /* 0x00d8 */ UClass* ProxyFactoryClass;
    /* 0x00e0 */ UClass* ProxyClass;
    /* 0x00e8 */ FName ProxyActivateFunctionName;
};

// Size: 0x120
class UK2Node_BaseMCDelegate : public UK2Node {
    /* 0x00c8 */ FMemberReference DelegateReference;
};

// Size: 0xd8
class UK2Node_BitmaskLiteral : public UK2Node {
    /* 0x00d0 */ UEnum* BitflagsEnum;
};

// Size: 0x1d0
class UK2Node_BreakStruct : public UK2Node_StructMemberGet {
    /* 0x0188 */ bool bMadeAfterOverridePinRemoval;
};

// Size: 0x158
class UK2Node_CallArrayFunction : public UK2Node_CallFunction {
};

// Size: 0x158
class UK2Node_CallDataTableFunction : public UK2Node_CallFunction {
};

// Size: 0x120
class UK2Node_CallDelegate : public UK2Node_BaseMCDelegate {
};

// Size: 0x158
class UK2Node_CallFunction : public UK2Node {
    /* 0x00c8 */ bool bIsPureFunc;
    /* 0x00c8 */ bool bIsConstFunc;
    /* 0x00c8 */ bool bWantsEnumToExecExpansion;
    /* 0x00c8 */ bool bIsInterfaceCall;
    /* 0x00c8 */ bool bIsFinalFunction;
    /* 0x00c8 */ bool bIsBeadFunction;
    /* 0x00d0 */ FMemberReference FunctionReference;
    /* 0x0108 */ FName CallFunctionName;
    /* 0x0118 */ UClass* CallFunctionClass;
};

// Size: 0x190
class UK2Node_CallFunctionOnMember : public UK2Node_CallFunction {
    /* 0x0158 */ FMemberReference MemberVariableToCallOn;
};

// Size: 0x158
class UK2Node_CallMaterialParameterCollectionFunction : public UK2Node_CallFunction {
};

// Size: 0x158
class UK2Node_CallParentFunction : public UK2Node_CallFunction {
};

// Size: 0xf8
class UK2Node_CastByteToEnum : public UK2Node {
    /* 0x00c8 */ UEnum* Enum;
    /* 0x00d0 */ bool bSafe;
};

// Size: 0xf8
class UK2Node_ClassDynamicCast : public UK2Node_DynamicCast {
};

// Size: 0x120
class UK2Node_ClearDelegate : public UK2Node_BaseMCDelegate {
};

// Size: 0x168
class UK2Node_CommutativeAssociativeBinaryOperator : public UK2Node_CallFunction {
    /* 0x0160 */ int32_t NumAdditionalInputs;
};

// Size: 0x1d0
class UK2Node_ComponentBoundEvent : public UK2Node_Event {
    /* 0x0170 */ FName DelegatePropertyName;
    /* 0x0180 */ UClass* DelegateOwnerClass;
    /* 0x0188 */ FName ComponentPropertyName;
    /* 0x0198 */ FText DelegatePropertyDisplayName;
};

// Size: 0x1b8
class UK2Node_Composite : public UK2Node_Tunnel {
    /* 0x0190 */ UEdGraph* BoundGraph;
};

// Size: 0x100
class UK2Node_ConstructObjectFromClass : public UK2Node {
};

// Size: 0xc8
class UK2Node_ConvertAsset : public UK2Node {
};

// Size: 0xc8
class UK2Node_Copy : public UK2Node {
};

// Size: 0xe8
class UK2Node_CreateDelegate : public UK2Node {
    /* 0x00c8 */ FName SelectedFunctionName;
    /* 0x00d4 */ FGuid SelectedFunctionGuid;
};

// Size: 0x230
class UK2Node_CustomEvent : public UK2Node_Event {
    /* 0x0170 */ FString DeprecationMessage;
    /* 0x0180 */ bool bIsDeprecated;
    /* 0x0181 */ bool bCallInEditor;
    /* 0x01a8 */ FKismetUserDeclaredFunctionMetadata MetaData;
};

// Size: 0xc8
class UK2Node_DeadClass : public UK2Node {
};

// Size: 0x120
class UK2Node_DelegateSet : public UK2Node {
    /* 0x00c8 */ FName DelegatePropertyName;
    /* 0x00d8 */ UClass* DelegatePropertyClass;
};

// Size: 0xe0
class UK2Node_DoOnceMultiInput : public UK2Node {
    /* 0x00d0 */ int32_t NumAdditionalInputs;
    /* 0x00d8 */ UK2Node_TemporaryVariable* DataNode;
};

// Size: 0xf8
class UK2Node_DynamicCast : public UK2Node {
    /* 0x00c8 */ UClass* TargetType;
    /* 0x00f0 */ bool bIsPureCast;
};

// Size: 0xf8
class UK2Node_EaseFunction : public UK2Node {
    /* 0x00c8 */ FName EaseFunctionName;
};

// Size: 0xe0
class UK2Node_EditablePinBase : public UK2Node {
    /* 0x00c8 */ bool bIsEditable;
};

// Size: 0x158
class UK2Node_EditorPropertyAccessBase : public UK2Node_CallFunction {
};

// Size: 0xc8
class UK2Node_EnumEquality : public UK2Node {
};

// Size: 0xc8
class UK2Node_EnumInequality : public UK2Node_EnumEquality {
};

// Size: 0xf8
class UK2Node_EnumLiteral : public UK2Node {
    /* 0x00d0 */ UEnum* Enum;
};

// Size: 0x170
class UK2Node_Event : public UK2Node_EditablePinBase {
    /* 0x00e8 */ FName EventSignatureName;
    /* 0x00f8 */ UClass* EventSignatureClass;
    /* 0x0100 */ FMemberReference EventReference;
    /* 0x0138 */ bool bOverrideFunction;
    /* 0x0138 */ bool bInternalEvent;
    /* 0x013c */ FName CustomFunctionName;
    /* 0x0148 */ uint32_t FunctionFlags;
};

// Size: 0x30
class IK2Node_EventNodeInterface : public UInterface {
};

// Size: 0xd0
class UK2Node_ExecutionSequence : public UK2Node {
};

// Size: 0xf0
class UK2Node_ForEachElementInEnum : public UK2Node {
    /* 0x00c8 */ UEnum* Enum;
};

// Size: 0xf8
class UK2Node_FormatText : public UK2Node {
    /* 0x00c8 */ TArray<FName> PinNames;
};

// Size: 0x1f8
class UK2Node_FunctionEntry : public UK2Node_FunctionTerminator {
    /* 0x0130 */ FName CustomGeneratedFunctionName;
    /* 0x0140 */ FKismetUserDeclaredFunctionMetadata MetaData;
    /* 0x01c8 */ TArray<FBPVariableDescription> LocalVariables;
    /* 0x01d8 */ bool bEnforceConstCorrectness;
    /* 0x01dc */ int32_t ExtraFlags;
};

// Size: 0x130
class UK2Node_FunctionResult : public UK2Node_FunctionTerminator {
};

// Size: 0x130
class UK2Node_FunctionTerminator : public UK2Node_EditablePinBase {
    /* 0x00e0 */ FMemberReference FunctionReference;
    /* 0x0118 */ UClass* SignatureClass;
    /* 0x0120 */ FName SignatureName;
};

// Size: 0x100
class UK2Node_GenericCreateObject : public UK2Node_ConstructObjectFromClass {
};

// Size: 0xd0
class UK2Node_GetArrayItem : public UK2Node {
    /* 0x00c8 */ bool bReturnByRefDesired;
};

// Size: 0x108
class UK2Node_GetClassDefaults : public UK2Node {
    /* 0x00c8 */ UBlueprint* BlueprintSubscribedTo;
    /* 0x00e0 */ TArray<FOptionalPinFromProperty> ShowPinForProperties;
    /* 0x0100 */ bool bExcludeObjectContainers;
    /* 0x0101 */ bool bExcludeObjectArrays;
};

// Size: 0x100
class UK2Node_GetDataTableRow : public UK2Node {
};

// Size: 0x158
class UK2Node_GetEditorProperty : public UK2Node_EditorPropertyAccessBase {
};

// Size: 0xd0
class UK2Node_GetEditorSubsystem : public UK2Node_GetSubsystem {
};

// Size: 0xd0
class UK2Node_GetEngineSubsystem : public UK2Node_GetSubsystem {
};

// Size: 0xc8
class UK2Node_GetEnumeratorName : public UK2Node {
};

// Size: 0xc8
class UK2Node_GetEnumeratorNameAsString : public UK2Node_GetEnumeratorName {
};

// Size: 0x1c0
class UK2Node_GetInputAxisKeyValue : public UK2Node_CallFunction {
    /* 0x0158 */ FKey InputAxisKey;
    /* 0x0178 */ bool bConsumeInput;
    /* 0x0178 */ bool bExecuteWhenPaused;
};

// Size: 0x1a8
class UK2Node_GetInputAxisValue : public UK2Node_CallFunction {
    /* 0x0158 */ FName InputAxisName;
    /* 0x0164 */ bool bConsumeInput;
    /* 0x0164 */ bool bExecuteWhenPaused;
};

// Size: 0x1c0
class UK2Node_GetInputVectorAxisValue : public UK2Node_GetInputAxisKeyValue {
};

// Size: 0x118
class UK2Node_GetNumEnumEntries : public UK2Node {
    /* 0x00d0 */ UEnum* Enum;
};

// Size: 0xd0
class UK2Node_GetSubsystem : public UK2Node {
    /* 0x00c8 */ UClass* CustomClass;
};

// Size: 0xd0
class UK2Node_GetSubsystemFromPC : public UK2Node_GetSubsystem {
};

// Size: 0xc8
class UK2Node_IfThenElse : public UK2Node {
};

// Size: 0x120
class UK2Node_InputAction : public UK2Node {
    /* 0x00d0 */ FName InputActionName;
    /* 0x00dc */ bool bConsumeInput;
    /* 0x00dc */ bool bExecuteWhenPaused;
    /* 0x00dc */ bool bOverrideParentBinding;
};

// Size: 0x188
class UK2Node_InputActionEvent : public UK2Node_Event {
    /* 0x0170 */ FName InputActionName;
    /* 0x017c */ uint8_t InputKeyEvent;
    /* 0x0180 */ bool bConsumeInput;
    /* 0x0180 */ bool bExecuteWhenPaused;
    /* 0x0180 */ bool bOverrideParentBinding;
};

// Size: 0x1c0
class UK2Node_InputAxisEvent : public UK2Node_Event {
    /* 0x0170 */ FName InputAxisName;
    /* 0x017c */ bool bConsumeInput;
    /* 0x017c */ bool bExecuteWhenPaused;
    /* 0x017c */ bool bOverrideParentBinding;
};

// Size: 0x1b8
class UK2Node_InputAxisKeyEvent : public UK2Node_Event {
    /* 0x0170 */ FKey AxisKey;
    /* 0x0190 */ bool bConsumeInput;
    /* 0x0190 */ bool bExecuteWhenPaused;
    /* 0x0190 */ bool bOverrideParentBinding;
};

// Size: 0x138
class UK2Node_InputKey : public UK2Node {
    /* 0x00d0 */ FKey InputKey;
    /* 0x00f0 */ bool bConsumeInput;
    /* 0x00f0 */ bool bExecuteWhenPaused;
    /* 0x00f0 */ bool bOverrideParentBinding;
    /* 0x00f0 */ bool bControl;
    /* 0x00f0 */ bool bAlt;
    /* 0x00f0 */ bool bShift;
    /* 0x00f0 */ bool bCommand;
};

// Size: 0x1a0
class UK2Node_InputKeyEvent : public UK2Node_Event {
    /* 0x0170 */ FInputChord InputChord;
    /* 0x0198 */ uint8_t InputKeyEvent;
    /* 0x019c */ bool bConsumeInput;
    /* 0x019c */ bool bExecuteWhenPaused;
    /* 0x019c */ bool bOverrideParentBinding;
};

// Size: 0xd8
class UK2Node_InputTouch : public UK2Node {
    /* 0x00d0 */ bool bConsumeInput;
    /* 0x00d0 */ bool bExecuteWhenPaused;
    /* 0x00d0 */ bool bOverrideParentBinding;
};

// Size: 0x178
class UK2Node_InputTouchEvent : public UK2Node_Event {
    /* 0x0170 */ uint8_t InputKeyEvent;
    /* 0x0171 */ bool bConsumeInput;
    /* 0x0171 */ bool bExecuteWhenPaused;
    /* 0x0171 */ bool bOverrideParentBinding;
};

// Size: 0x1b8
class UK2Node_InputVectorAxisEvent : public UK2Node_InputAxisKeyEvent {
};

// Size: 0xd0
class UK2Node_Knot : public UK2Node {
};

// Size: 0xd0
class UK2Node_Literal : public UK2Node {
    /* 0x00c8 */ UObject* ObjectRef;
};

// Size: 0xc8
class UK2Node_LoadAsset : public UK2Node {
};

// Size: 0xc8
class UK2Node_LoadAssetClass : public UK2Node_LoadAsset {
};

// Size: 0x1a8
class UK2Node_LocalVariable : public UK2Node_TemporaryVariable {
    /* 0x0180 */ FName CustomVariableName;
    /* 0x0190 */ FText VariableTooltip;
};

// Size: 0x250
class UK2Node_MacroInstance : public UK2Node_Tunnel {
    /* 0x0190 */ UEdGraph* MacroGraph;
    /* 0x0198 */ FGraphReference MacroGraphReference;
    /* 0x01b8 */ FEdGraphPinType ResolvedWildcardType;
};

// Size: 0xd8
class UK2Node_MakeArray : public UK2Node_MakeContainer {
};

// Size: 0xd8
class UK2Node_MakeContainer : public UK2Node {
    /* 0x00d0 */ int32_t NumInputs;
};

// Size: 0xd8
class UK2Node_MakeMap : public UK2Node_MakeContainer {
};

// Size: 0xd8
class UK2Node_MakeSet : public UK2Node_MakeContainer {
};

// Size: 0x1d0
class UK2Node_MakeStruct : public UK2Node_StructMemberSet {
    /* 0x0188 */ bool bMadeAfterOverridePinRemoval;
};

// Size: 0x1b8
class UK2Node_MakeVariable : public UK2Node {
    /* 0x00c8 */ FBPVariableDescription VariableType;
};

// Size: 0x220
class UK2Node_MathExpression : public UK2Node_Composite {
    /* 0x01b8 */ FString Expression;
    /* 0x01c8 */ bool bMadeAfterRotChange;
};

// Size: 0xd0
class UK2Node_MatineeController : public UK2Node {
    /* 0x00c8 */ AMatineeActor* MatineeActor;
};

// Size: 0x1d8
class UK2Node_Message : public UK2Node_CallFunction {
};

// Size: 0xd8
class UK2Node_MultiGate : public UK2Node_ExecutionSequence {
    /* 0x00d0 */ UK2Node_TemporaryVariable* DataNode;
};

// Size: 0xc8
class UK2Node_PureAssignmentStatement : public UK2Node {
};

// Size: 0x120
class UK2Node_RemoveDelegate : public UK2Node_BaseMCDelegate {
};

// Size: 0x180
class UK2Node_Select : public UK2Node {
    /* 0x00d8 */ int32_t NumOptionPins;
    /* 0x00e0 */ FEdGraphPinType IndexPinType;
    /* 0x0150 */ UEnum* Enum;
    /* 0x0158 */ TArray<FName> EnumEntries;
    /* 0x0168 */ TArray<FText> EnumEntryFriendlyNames;
    /* 0x0178 */ bool bReconstructNode;
};

// Size: 0xc8
class UK2Node_Self : public UK2Node {
};

// Size: 0x158
class UK2Node_SetEditorProperty : public UK2Node_EditorPropertyAccessBase {
};

// Size: 0x218
class UK2Node_SetFieldsInStruct : public UK2Node_MakeStruct {
};

// Size: 0xc8
class UK2Node_SetVariableOnPersistentFrame : public UK2Node {
};

// Size: 0x100
class UK2Node_SpawnActor : public UK2Node {
};

// Size: 0x100
class UK2Node_SpawnActorFromClass : public UK2Node_ConstructObjectFromClass {
};

// Size: 0x188
class UK2Node_StructMemberGet : public UK2Node_StructOperation {
    /* 0x0128 */ TArray<FOptionalPinFromProperty> ShowPinForProperties;
};

// Size: 0x188
class UK2Node_StructMemberSet : public UK2Node_StructOperation {
    /* 0x0128 */ TArray<FOptionalPinFromProperty> ShowPinForProperties;
};

// Size: 0x128
class UK2Node_StructOperation : public UK2Node_Variable {
    /* 0x0120 */ UScriptStruct* StructType;
};

// Size: 0xe8
class UK2Node_Switch : public UK2Node {
    /* 0x00c8 */ bool bHasDefaultPin;
    /* 0x00cc */ FName FunctionName;
    /* 0x00d8 */ UClass* FunctionClass;
};

// Size: 0x138
class UK2Node_SwitchEnum : public UK2Node_Switch {
    /* 0x00f0 */ UEnum* Enum;
    /* 0x00f8 */ TArray<FName> EnumEntries;
    /* 0x0108 */ TArray<FText> EnumFriendlyNames;
};

// Size: 0xf0
class UK2Node_SwitchInteger : public UK2Node_Switch {
    /* 0x00e8 */ int32_t StartIndex;
};

// Size: 0xf8
class UK2Node_SwitchName : public UK2Node_Switch {
    /* 0x00e8 */ TArray<FName> PinNames;
};

// Size: 0x100
class UK2Node_SwitchString : public UK2Node_Switch {
    /* 0x00e8 */ TArray<FName> PinNames;
    /* 0x00f8 */ bool bIsCaseSensitive;
};

// Size: 0x180
class UK2Node_TemporaryVariable : public UK2Node {
    /* 0x00c8 */ FEdGraphPinType VariableType;
    /* 0x0138 */ bool bIsPersistent;
};

// Size: 0xf0
class UK2Node_Timeline : public UK2Node {
    /* 0x00c8 */ FName TimelineName;
    /* 0x00d4 */ bool bAutoPlay;
    /* 0x00d8 */ FGuid TimelineGuid;
    /* 0x00e8 */ bool bLoop;
    /* 0x00e8 */ bool bReplicated;
    /* 0x00e8 */ bool bIgnoreTimeDilation;
};

// Size: 0x190
class UK2Node_Tunnel : public UK2Node_EditablePinBase {
    /* 0x00e0 */ UK2Node_Tunnel* OutputSourceNode;
    /* 0x00e8 */ UK2Node_Tunnel* InputSinkNode;
    /* 0x00f0 */ bool bCanHaveInputs;
    /* 0x00f0 */ bool bCanHaveOutputs;
    /* 0x00f8 */ FKismetUserDeclaredFunctionMetadata MetaData;
};

// Size: 0xd8
class UK2Node_TunnelBoundary : public UK2Node {
    /* 0x00c8 */ FName BaseName;
    /* 0x00d4 */ ETunnelBoundaryType TunnelBoundaryType;
};

// Size: 0x120
class UK2Node_Variable : public UK2Node {
    /* 0x00c8 */ FMemberReference VariableReference;
    /* 0x0100 */ uint8_t SelfContextInfo;
    /* 0x0108 */ UClass* VariableSourceClass;
    /* 0x0110 */ FName VariableName;
    /* 0x011c */ bool bSelfContext;
};

// Size: 0x168
class UK2Node_VariableGet : public UK2Node_Variable {
    /* 0x0160 */ bool bIsPureGet;
};

// Size: 0x160
class UK2Node_VariableSet : public UK2Node_Variable {
};

// Size: 0xe8
class UK2Node_VariableSetRef : public UK2Node {
};

// Size: 0x88
struct FKismetUserDeclaredFunctionMetadata {
    /* 0x0000 */ FText Tooltip;
    /* 0x0018 */ FText Category;
    /* 0x0030 */ FText Keywords;
    /* 0x0048 */ FText CompactNodeTitle;
    /* 0x0060 */ FLinearColor InstanceTitleColor;
    /* 0x0070 */ FString DeprecationMessage;
    /* 0x0080 */ bool bIsDeprecated;
    /* 0x0081 */ bool bCallInEditor;
    /* 0x0082 */ int8_t HasLatentFunctions;
};

// Size: 0x30
class INodeDependingOnEnumInterface : public UInterface {
};

// Size: 0x48
struct FOptionalPinFromProperty {
    /* 0x0000 */ FName PropertyName;
    /* 0x0010 */ FString PropertyFriendlyName;
    /* 0x0020 */ FText PropertyTooltip;
    /* 0x0038 */ FName CategoryName;
    /* 0x0044 */ bool bShowPin;
    /* 0x0044 */ bool bCanToggleVisibility;
    /* 0x0044 */ bool bPropertyIsCustomized;
    /* 0x0044 */ bool bHasOverridePin;
    /* 0x0044 */ bool bIsMarkedForAdvancedDisplay;
    /* 0x0044 */ bool bIsOverrideEnabled;
    /* 0x0044 */ bool bIsSetValuePinVisible;
    /* 0x0044 */ bool bIsOverridePinVisible;
};

// Size: 0x98
struct FUserPinInfo {
    /* 0x0000 */ FName PinName;
    /* 0x0010 */ FEdGraphPinType PinType;
    /* 0x0080 */ uint8_t DesiredPinDirection;
    /* 0x0088 */ FString PinDefaultValue;
};

// Size: 0x158
struct FBlueprintNativeCodeGenManifest {
    /* 0x0000 */ int32_t ManifestChunkId;
    /* 0x0008 */ FString PluginName;
    /* 0x0018 */ FString OutputDir;
    /* 0x0028 */ TArray<UPackage*> ModuleDependencies;
    /* 0x0038 */ TMap<FName, FConvertedAssetRecord> ConvertedAssets;
    /* 0x0088 */ TMap<FName, FUnconvertedDependencyRecord> UnconvertedDependencies;
    /* 0x00d8 */ FCompilerNativizationOptions NativizationOptions;
};

// Size: 0x38
struct FConvertedAssetRecord {
    /* 0x0000 */ UClass* AssetType;
    /* 0x0008 */ FString TargetObjPath;
    /* 0x0018 */ FString GeneratedHeaderPath;
    /* 0x0028 */ FString GeneratedCppPath;
};

// Size: 0x10
struct FUnconvertedDependencyRecord {
    /* 0x0000 */ FString GeneratedWrapperPath;
};

// Size: 0x38
class UActorActionUtility : public UEditorUtilityObject {

    UClass* GetSupportedClass() const;
};

// Size: 0x38
class UAssetActionUtility : public UEditorUtilityObject {

    UClass* GetSupportedClass() const;
    bool IsActionForBlueprints() const;
};

// Size: 0x58
class UAsyncEditorDelay : public UEditorUtilityBlueprintAsyncActionBase {
    /* 0x0038 */ FMulticastInlineDelegate Complete;

    static UAsyncEditorDelay* AsyncEditorDelay(float Seconds, int32_t MinimumFrames);
};

// Size: 0x78
class UAsyncEditorOpenMapAndFocusActor : public UEditorUtilityBlueprintAsyncActionBase {
    /* 0x0038 */ FMulticastInlineDelegate Complete;

    static UAsyncEditorOpenMapAndFocusActor* AsyncEditorOpenMapAndFocusActor(FSoftObjectPath Map, FString FocusActorName);
};

// Size: 0x50
class UAsyncEditorWaitForGameWorld : public UEditorUtilityBlueprintAsyncActionBase {
    /* 0x0038 */ FMulticastInlineDelegate Complete;

    static UAsyncEditorWaitForGameWorld* AsyncWaitForGameWorld(int32_t index, bool Server);
};

// Size: 0x2f8
class AEditorUtilityActor : public AActor {

    void Run();
};

// Size: 0xc0
class UEditorUtilityActorComponent : public UActorComponent {
};

// Size: 0x4d8
class UEditorUtilityBlueprint : public UBlueprint {
};

// Size: 0x38
class UEditorUtilityBlueprintAsyncActionBase : public UBlueprintAsyncActionBase {
};

// Size: 0xa0
class UEditorUtilityBlueprintFactory : public UFactory {
    /* 0x0088 */ UClass* ParentClass;
};

// Size: 0x8c0
class AEditorUtilityCamera : public ACameraActor {
};

// Size: 0x30
class IEditorUtilityExtension : public UInterface {
};

// Size: 0x30
class UEditorUtilityLibrary : public UBlueprintFunctionLibrary {

    AActor* GetActorReference(FString PathToActor);
    static TArray<FAssetData> GetSelectedAssetData();
    static TArray<UObject*> GetSelectedAssets();
    static TArray<UClass*> GetSelectedBlueprintClasses();
    static void GetSelectionBounds(FVector& Origin, FVector& BoxExtent, float& SphereRadius);
    static TArray<AActor*> GetSelectionSet();
    static void RenameAsset(UObject* Asset, FString NewName);
};

// Size: 0x30
class UEditorUtilityObject : public UObject {

    void Run();
};

// Size: 0x190
class UEditorUtilitySubsystem : public UEditorSubsystem {
    /* 0x0038 */ TArray<FSoftObjectPath> LoadedUIs;
    /* 0x0048 */ TArray<FSoftObjectPath> StartupObjects;
    /* 0x00b8 */ TMap<UObject*, UObject*> ObjectInstances;
    /* 0x0120 */ TArray<UEditorUtilityTask*> PendingTasks;
    /* 0x0130 */ UEditorUtilityTask* ActiveTask;
    /* 0x0140 */ TSet<UObject*> ReferencedObjects;

    bool CanRun(UObject* Asset) const;
    bool CloseTabByID(FName NewTabID);
    bool DoesTabExist(FName NewTabID);
    UEditorUtilityWidget* FindUtilityWidgetFromBlueprint(UEditorUtilityWidgetBlueprint* InBlueprint);
    void RegisterAndExecuteTask(UEditorUtilityTask* NewTask);
    void RegisterTabAndGetID(UEditorUtilityWidgetBlueprint* InBlueprint, FName& NewTabID);
    void ReleaseInstanceOfAsset(UObject* Asset);
    UEditorUtilityWidget* SpawnAndRegisterTab(UEditorUtilityWidgetBlueprint* InBlueprint);
    UEditorUtilityWidget* SpawnAndRegisterTabAndGetID(UEditorUtilityWidgetBlueprint* InBlueprint, FName& NewTabID);
    bool SpawnRegisteredTabByID(FName NewTabID);
    bool TryRun(UObject* Asset);
};

// Size: 0x48
class UEditorUtilityTask : public UObject {
    /* 0x0030 */ UEditorUtilitySubsystem* MyTaskManager;
    /* 0x0038 */ bool bCancelRequested;

    void FinishExecutingTask();
    void ReceiveBeginExecution();
    void Run();
    void SetTaskNotificationText(const FText& text);
};

// Size: 0xe0
class UEditorUtilityToolMenuEntry : public UToolMenuEntryScript {
};

// Size: 0x30
class UEditorUtilityToolMenuSection : public UToolMenuSectionDynamic {
};

// Size: 0x410
class UEditorUtilityWidget : public UUserWidget {
    /* 0x03f8 */ FString HelpText;
    /* 0x0408 */ bool bAlwaysReregisterWithWindowsMenu;
    /* 0x0409 */ bool bAutoRunDefaultAction;

    void Run();
};

// Size: 0x568
class UEditorUtilityWidgetBlueprint : public UWidgetBlueprint {
    /* 0x0560 */ UEditorUtilityWidget* CreatedUMGWidget;
};

// Size: 0xa0
class UEditorUtilityWidgetBlueprintFactory : public UFactory {
    /* 0x0088 */ uint8_t BlueprintType;
    /* 0x0090 */ UClass* ParentClass;
};

// Size: 0x68
class UGlobalEditorUtilityBase : public UObject {
    /* 0x0030 */ FString HelpText;
    /* 0x0040 */ bool bDirtiedSelectionSet;
    /* 0x0041 */ bool bAutoRunDefaultAction;
    /* 0x0048 */ FMulticastInlineDelegate OnEachSelectedActor;
    /* 0x0058 */ FMulticastInlineDelegate OnEachSelectedAsset;

    void ClearActorSelectionSet();
    void ForEachSelectedActor();
    void ForEachSelectedAsset();
    AActor* GetActorReference(FString PathToActor);
    UEditorPerProjectUserSettings* GetEditorUserSettings();
    TArray<UObject*> GetSelectedAssets();
    void GetSelectionBounds(FVector& Origin, FVector& BoxExtent, float& SphereRadius);
    TArray<AActor*> GetSelectionSet();
    void OnDefaultActionClicked();
    void RenameAsset(UObject* Asset, FString NewName);
    void SelectNothing();
    void SetActorSelectionState(AActor* Actor, bool bShouldBeSelected);
};

// Size: 0x308
class APlacedEditorUtilityBase : public AActor {
    /* 0x02f8 */ FString HelpText;

    void ClearActorSelectionSet();
    AActor* GetActorReference(FString PathToActor);
    bool GetLevelViewportCameraInfo(FVector& CameraLocation, FRotator& CameraRotation);
    TArray<AActor*> GetSelectionSet();
    void SelectNothing();
    void SetActorSelectionState(AActor* Actor, bool bShouldBeSelected);
    void SetLevelViewportCameraInfo(FVector CameraLocation, FRotator CameraRotation);
};

// Size: 0x128
class UBuildPatchManifest : public UObject {
    /* 0x0030 */ uint8_t ManifestFileVersion;
    /* 0x0031 */ bool bIsFileData;
    /* 0x0034 */ uint32_t AppID;
    /* 0x0038 */ FString AppName;
    /* 0x0048 */ FString BuildVersion;
    /* 0x0058 */ FString LaunchExe;
    /* 0x0068 */ FString LaunchCommand;
    /* 0x0078 */ TSet<FString> PrereqIds;
    /* 0x00c8 */ FString PrereqName;
    /* 0x00d8 */ FString PrereqPath;
    /* 0x00e8 */ FString PrereqArgs;
    /* 0x00f8 */ TArray<FFileManifestData> FileManifestList;
    /* 0x0108 */ TArray<FChunkInfoData> ChunkList;
    /* 0x0118 */ TArray<FCustomFieldData> CustomFields;
};

// Size: 0x40
struct FChunkInfoData {
    /* 0x0000 */ FGuid Guid;
    /* 0x0010 */ uint64_t Hash;
    /* 0x0018 */ FSHAHashData ShaHash;
    /* 0x0030 */ int64_t FileSize;
    /* 0x0038 */ uint8_t GroupNumber;
};

// Size: 0x18
struct FChunkPartData {
    /* 0x0000 */ FGuid Guid;
    /* 0x0010 */ uint32_t Offset;
    /* 0x0014 */ uint32_t Size;
};

// Size: 0x20
struct FCustomFieldData {
    /* 0x0000 */ FString Key;
    /* 0x0010 */ FString Value;
};

// Size: 0x68
struct FFileManifestData {
    /* 0x0000 */ FString Filename;
    /* 0x0010 */ FSHAHashData FileHash;
    /* 0x0028 */ TArray<FChunkPartData> FileChunkParts;
    /* 0x0038 */ TArray<FString> InstallTags;
    /* 0x0048 */ bool bIsUnixExecutable;
    /* 0x0050 */ FString SymlinkTarget;
    /* 0x0060 */ bool bIsReadOnly;
    /* 0x0061 */ bool bIsCompressed;
};

// Size: 0x14
struct FSHAHashData {
    /* 0x0000 */ uint8_t Hash[20];
};

// Size: 0x300
class ACableActor : public AActor {
    /* 0x02f8 */ UCableComponent* CableComponent;
};

// Size: 0x5a0
class UCableComponent : public UMeshComponent {
    /* 0x0500 */ bool bAttachStart;
    /* 0x0501 */ bool bAttachEnd;
    /* 0x0508 */ FComponentReference AttachEndTo;
    /* 0x0538 */ FName AttachEndToSocketName;
    /* 0x0544 */ FVector EndLocation;
    /* 0x0550 */ float CableLength;
    /* 0x0554 */ int32_t NumSegments;
    /* 0x0558 */ float SubstepTime;
    /* 0x055c */ int32_t SolverIterations;
    /* 0x0560 */ bool bEnableStiffness;
    /* 0x0561 */ bool bUseSubstepping;
    /* 0x0562 */ bool bSkipCableUpdateWhenNotVisible;
    /* 0x0563 */ bool bSkipCableUpdateWhenNotOwnerRecentlyRendered;
    /* 0x0564 */ bool bEnableCollision;
    /* 0x0568 */ float CollisionFriction;
    /* 0x056c */ FVector CableForce;
    /* 0x0578 */ float CableGravityScale;
    /* 0x057c */ float CableWidth;
    /* 0x0580 */ int32_t NumSides;
    /* 0x0584 */ float TileMaterial;

    AActor* GetAttachedActor() const;
    USceneComponent* GetAttachedComponent() const;
    void GetCableParticleLocations(TArray<FVector>& Locations) const;
    void SetAttachEndTo(AActor* Actor, FName ComponentProperty, FName SocketName);
    void SetAttachEndToComponent(USceneComponent* Component, FName SocketName);
};

// Size: 0x2a10
class APreviewPlayerCameraManager : public APlayerCameraManager {
};

// Size: 0x68
struct FChaosSolverConfiguration {
    /* 0x0000 */ int32_t Iterations;
    /* 0x0004 */ int32_t CollisionPairIterations;
    /* 0x0008 */ int32_t PushOutIterations;
    /* 0x000c */ int32_t CollisionPushOutPairIterations;
    /* 0x0010 */ float CollisionMarginFraction;
    /* 0x0014 */ float CollisionMarginMax;
    /* 0x0018 */ float CollisionCullDistance;
    /* 0x001c */ int32_t JointPairIterations;
    /* 0x0020 */ int32_t JointPushOutPairIterations;
    /* 0x0024 */ float ClusterConnectionFactor;
    /* 0x0028 */ EClusterUnionMethod ClusterUnionConnectionType;
    /* 0x0029 */ bool bGenerateCollisionData;
    /* 0x002c */ FSolverCollisionFilterSettings CollisionFilterSettings;
    /* 0x003c */ bool bGenerateBreakData;
    /* 0x0040 */ FSolverBreakingFilterSettings BreakingFilterSettings;
    /* 0x0050 */ bool bGenerateTrailingData;
    /* 0x0054 */ FSolverTrailingFilterSettings TrailingFilterSettings;
    /* 0x0064 */ bool bGenerateContactGraph;
};

enum class EChaosBufferMode {
    Double = 0,
    Triple = 1,
    Num = 2,
    Invalid = 3,
    EChaosBufferMode_MAX = 4,
};

enum class EChaosSolverTickMode {
    Fixed = 0,
    Variable = 1,
    VariableCapped = 2,
    VariableCappedWithTarget = 3,
    EChaosSolverTickMode_MAX = 4,
};

enum class EChaosThreadingMode {
    DedicatedThread = 0,
    TaskGraph = 1,
    SingleThread = 2,
    Num = 3,
    Invalid = 4,
    EChaosThreadingMode_MAX = 5,
};

enum class EClusterUnionMethod {
    PointImplicit = 0,
    DelaunayTriangulation = 1,
    MinimalSpanningSubsetDelaunayTriangulation = 2,
    PointImplicitAugmentedWithMinimalDelaunay = 3,
    None = 4,
    EClusterUnionMethod_MAX = 5,
};

enum class ECollisionTypeEnum {
    Chaos_Volumetric = 0,
    Chaos_Surface_Volumetric = 1,
    Chaos_Max = 2,
    Chaos_Max = 3,
};

enum class EEmissionPatternTypeEnum {
    Chaos_Emission_Pattern_First_Frame = 0,
    Chaos_Emission_Pattern_On_Demand = 1,
    Chaos_Max = 2,
    Chaos_Max = 3,
};

enum class EFieldCullingOperationType {
    Field_Culling_Inside = 0,
    Field_Culling_Outside = 1,
    Field_Culling_Operation_Max = 2,
    Field_Culling_MAX = 3,
};

enum class EFieldFalloffType {
    Field_FallOff_None = 0,
    Field_Falloff_Linear = 1,
    Field_Falloff_Inverse = 2,
    Field_Falloff_Squared = 3,
    Field_Falloff_Logarithmic = 4,
    Field_Falloff_Max = 5,
};

enum class EFieldFilterType {
    Field_Filter_Dynamic = 0,
    Field_Filter_Kinematic = 1,
    Field_Filter_Static = 2,
    Field_Filter_All = 3,
    Field_Filter_Max = 4,
    Field_Filter_Max = 5,
};

enum class EFieldIntegerType {
    Integer_DynamicState = 0,
    Integer_ActivateDisabled = 1,
    Integer_CollisionGroup = 2,
    Integer_PositionAnimated = 3,
    Integer_PositionStatic = 4,
    Integer_TargetMax = 5,
    Integer_MAX = 6,
};

enum class EFieldOperationType {
    Field_Multiply = 0,
    Field_Divide = 1,
    Field_Add = 2,
    Field_Substract = 3,
    Field_Operation_Max = 4,
};

enum class EFieldOutputType {
    Field_Output_Vector = 0,
    Field_Output_Scalar = 1,
    Field_Output_Integer = 2,
    Field_Output_Max = 3,
    Field_Output_Max = 4,
};

enum class EFieldPhysicsDefaultFields {
    Field_RadialIntMask = 0,
    Field_RadialFalloff = 1,
    Field_UniformVector = 2,
    Field_RadialVector = 3,
    Field_RadialVectorFalloff = 4,
    Field_EFieldPhysicsDefaultFields_Max = 5,
    Field_MAX = 6,
};

enum class EFieldPhysicsType {
    Field_None = 0,
    Field_DynamicState = 1,
    Field_LinearForce = 2,
    Field_ExternalClusterStrain = 3,
    Field_Kill = 4,
    Field_LinearVelocity = 5,
    Field_AngularVelociy = 6,
    Field_AngularTorque = 7,
    Field_InternalClusterStrain = 8,
    Field_DisableThreshold = 9,
    Field_SleepingThreshold = 10,
    Field_PositionStatic = 11,
    Field_PositionAnimated = 12,
    Field_PositionTarget = 13,
    Field_DynamicConstraint = 14,
    Field_CollisionGroup = 15,
    Field_ActivateDisabled = 16,
    Field_PhysicsType_Max = 17,
};

enum class EFieldResolutionType {
    Field_Resolution_Minimal = 0,
    Field_Resolution_DisabledParents = 1,
    Field_Resolution_Maximum = 2,
    Field_Resolution_Max = 3,
    Field_Resolution_Max = 4,
};

enum class EFieldScalarType {
    Scalar_ExternalClusterStrain = 0,
    Scalar_Kill = 1,
    Scalar_DisableThreshold = 2,
    Scalar_SleepingThreshold = 3,
    Scalar_InternalClusterStrain = 4,
    Scalar_DynamicConstraint = 5,
    Scalar_TargetMax = 6,
    Scalar_MAX = 7,
};

enum class EFieldVectorType {
    Vector_LinearForce = 0,
    Vector_LinearVelocity = 1,
    Vector_AngularVelocity = 2,
    Vector_AngularTorque = 3,
    Vector_PositionTarget = 4,
    Vector_TargetMax = 5,
    Vector_MAX = 6,
};

enum class EGeometryCollectionCacheType {
    None = 0,
    Record = 1,
    Play = 2,
    RecordAndPlay = 3,
    EGeometryCollectionCacheType_MAX = 4,
};

enum class EGeometryCollectionPhysicsTypeEnum {
    Chaos_AngularVelocity = 0,
    Chaos_DynamicState = 1,
    Chaos_LinearVelocity = 2,
    Chaos_InitialAngularVelocity = 3,
    Chaos_InitialLinearVelocity = 4,
    Chaos_CollisionGroup = 5,
    Chaos_LinearForce = 6,
    Chaos_AngularTorque = 7,
    Chaos_Max = 8,
    Chaos_Max = 9,
};

enum class EImplicitTypeEnum {
    Chaos_Implicit_Box = 0,
    Chaos_Implicit_Sphere = 1,
    Chaos_Implicit_Capsule = 2,
    Chaos_Implicit_LevelSet = 3,
    Chaos_Implicit_None = 4,
    Chaos_Max = 5,
    Chaos_Max = 6,
};

enum class EInitialVelocityTypeEnum {
    Chaos_Initial_Velocity_User_Defined = 0,
    Chaos_Initial_Velocity_None = 1,
    Chaos_Max = 2,
    Chaos_Max = 3,
};

enum class EObjectStateTypeEnum {
    Chaos_NONE = 0,
    Chaos_Object_Sleeping = 1,
    Chaos_Object_Kinematic = 2,
    Chaos_Object_Static = 3,
    Chaos_Object_Dynamic = 4,
    Chaos_Object_UserDefined = 100,
    Chaos_Max = 101,
    Chaos_Max = 102,
};

enum class ESetMaskConditionType {
    Field_Set_Always = 0,
    Field_Set_IFF_NOT_Interior = 1,
    Field_Set_IFF_NOT_Exterior = 2,
    Field_MaskCondition_Max = 3,
};

enum class EWaveFunctionType {
    Field_Wave_Cosine = 0,
    Field_Wave_Gaussian = 1,
    Field_Wave_Falloff = 2,
    Field_Wave_Decay = 3,
    Field_Wave_Max = 4,
    Field_Wave_Max = 5,
};

// Size: 0xb8
struct FRecordedFrame {
    /* 0x0000 */ TArray<FTransform> Transforms;
    /* 0x0010 */ TArray<int32_t> TransformIndices;
    /* 0x0020 */ TArray<int32_t> PreviousTransformIndices;
    /* 0x0030 */ TArray<bool> DisabledFlags;
    /* 0x0040 */ TArray<FSolverCollisionData> Collisions;
    /* 0x0050 */ TArray<FSolverBreakingData> Breakings;
    /* 0x0060 */ TSet<FSolverTrailingData> Trailings;
    /* 0x00b0 */ float Timestamp;
};

// Size: 0x10
struct FRecordedTransformTrack {
    /* 0x0000 */ TArray<FRecordedFrame> Records;
};

// Size: 0x30
struct FSolverBreakingData {
    /* 0x0000 */ FVector Location;
    /* 0x000c */ FVector Velocity;
    /* 0x0018 */ FVector AngularVelocity;
    /* 0x0024 */ float Mass;
    /* 0x0028 */ int32_t ParticleIndex;
    /* 0x002c */ int32_t ParticleIndexMesh;
};

// Size: 0x10
struct FSolverBreakingFilterSettings {
    /* 0x0000 */ bool FilterEnabled;
    /* 0x0004 */ float MinMass;
    /* 0x0008 */ float MinSpeed;
    /* 0x000c */ float MinVolume;
};

// Size: 0x6c
struct FSolverCollisionData {
    /* 0x0000 */ FVector Location;
    /* 0x000c */ FVector AccumulatedImpulse;
    /* 0x0018 */ FVector Normal;
    /* 0x0024 */ FVector Velocity1;
    /* 0x0030 */ FVector Velocity2;
    /* 0x003c */ FVector AngularVelocity1;
    /* 0x0048 */ FVector AngularVelocity2;
    /* 0x0054 */ float Mass1;
    /* 0x0058 */ float Mass2;
    /* 0x005c */ int32_t ParticleIndex;
    /* 0x0060 */ int32_t LevelsetIndex;
    /* 0x0064 */ int32_t ParticleIndexMesh;
    /* 0x0068 */ int32_t LevelsetIndexMesh;
};

// Size: 0x10
struct FSolverCollisionFilterSettings {
    /* 0x0000 */ bool FilterEnabled;
    /* 0x0004 */ float MinMass;
    /* 0x0008 */ float MinSpeed;
    /* 0x000c */ float MinImpulse;
};

// Size: 0x30
struct FSolverTrailingData {
    /* 0x0000 */ FVector Location;
    /* 0x000c */ FVector Velocity;
    /* 0x0018 */ FVector AngularVelocity;
    /* 0x0024 */ float Mass;
    /* 0x0028 */ int32_t ParticleIndex;
    /* 0x002c */ int32_t ParticleIndexMesh;
};

// Size: 0x10
struct FSolverTrailingFilterSettings {
    /* 0x0000 */ bool FilterEnabled;
    /* 0x0004 */ float MinMass;
    /* 0x0008 */ float MinSpeed;
    /* 0x000c */ float MinVolume;
};

// Size: 0xd8
class UChaosClothConfig : public UClothConfigCommon {
    /* 0x0030 */ EClothMassMode MassMode;
    /* 0x0034 */ float UniformMass;
    /* 0x0038 */ float TotalMass;
    /* 0x003c */ float Density;
    /* 0x0040 */ float MinPerParticleMass;
    /* 0x0044 */ float EdgeStiffness;
    /* 0x0048 */ float BendingStiffness;
    /* 0x004c */ bool bUseBendingElements;
    /* 0x0050 */ float AreaStiffness;
    /* 0x0054 */ float VolumeStiffness;
    /* 0x0058 */ FChaosClothWeightedValue TetherStiffness;
    /* 0x0060 */ float LimitScale;
    /* 0x0064 */ bool bUseGeodesicDistance;
    /* 0x0068 */ float ShapeTargetStiffness;
    /* 0x006c */ float CollisionThickness;
    /* 0x0070 */ float FrictionCoefficient;
    /* 0x0074 */ bool bUseCCD;
    /* 0x0075 */ bool bUseSelfCollisions;
    /* 0x0078 */ float SelfCollisionThickness;
    /* 0x007c */ bool bUseLegacyBackstop;
    /* 0x0080 */ float DampingCoefficient;
    /* 0x0084 */ bool bUsePointBasedWindModel;
    /* 0x0088 */ float DragCoefficient;
    /* 0x008c */ float LiftCoefficient;
    /* 0x0090 */ bool bUseGravityOverride;
    /* 0x0094 */ float GravityScale;
    /* 0x0098 */ FVector Gravity;
    /* 0x00a4 */ FChaosClothWeightedValue AnimDriveStiffness;
    /* 0x00ac */ FChaosClothWeightedValue AnimDriveDamping;
    /* 0x00b4 */ FVector LinearVelocityScale;
    /* 0x00c0 */ float AngularVelocityScale;
    /* 0x00c4 */ float FictitiousAngularScale;
    /* 0x00c8 */ bool bUseTetrahedralConstraints;
    /* 0x00c9 */ bool bUseThinShellVolumeConstraints;
    /* 0x00ca */ bool bUseContinuousCollisionDetection;
    /* 0x00cb */ EChaosClothTetherMode TetherMode;
    /* 0x00cc */ float AnimDriveSpringStiffness;
    /* 0x00d0 */ float StrainLimitingStiffness;
};

// Size: 0x60
class UChaosClothSharedSimConfig : public UClothSharedConfigCommon {
    /* 0x0030 */ int32_t IterationCount;
    /* 0x0034 */ int32_t SubdivisionCount;
    /* 0x0038 */ float SelfCollisionThickness;
    /* 0x003c */ float CollisionThickness;
    /* 0x0040 */ bool bUseDampingOverride;
    /* 0x0044 */ float Damping;
    /* 0x0048 */ bool bUseGravityOverride;
    /* 0x004c */ float GravityScale;
    /* 0x0050 */ FVector Gravity;
    /* 0x005c */ bool bUseLocalSpaceSimulation;
    /* 0x005d */ bool bUseXPBDConstraints;
};

// Size: 0x8
struct FChaosClothWeightedValue {
    /* 0x0000 */ float Low;
    /* 0x0004 */ float High;
};

// Size: 0x48
class UChaosClothingInteractor : public UClothingInteractor {

    void ResetAndTeleport(bool bReset, bool bTeleport);
    void SetAerodynamics(float DragCoefficient, float LiftCoefficient, FVector WindVelocity);
    void SetAnimDrive(FVector2D AnimDriveStiffness, FVector2D AnimDriveDamping);
    void SetAnimDriveLinear(float AnimDriveStiffness);
    void SetCollision(float CollisionThickness, float FrictionCoefficient, bool bUseCCD, float SelfCollisionThickness);
    void SetDamping(float DampingCoefficient);
    void SetGravity(float GravityScale, bool bIsGravityOverridden, FVector GravityOverride);
    void SetLongRangeAttachment(FVector2D TetherStiffness);
    void SetLongRangeAttachmentLinear(float TetherStiffness);
    void SetMaterialLinear(float EdgeStiffness, float BendingStiffness, float AreaStiffness);
    void SetVelocityScale(FVector LinearVelocityScale, float AngularVelocityScale, float FictitiousAngularScale);
};

// Size: 0x30
class UChaosClothingSimulationFactory : public UClothingSimulationFactory {
};

// Size: 0xa8
class UChaosClothingSimulationInteractor : public UClothingSimulationInteractor {
};

enum class EChaosClothTetherMode {
    FastTetherFastLength = 0,
    AccurateTetherFastLength = 1,
    AccurateTetherAccurateLength = 2,
    MaxChaosClothTetherMode = 3,
    EChaosClothTetherMode_MAX = 4,
};

enum class EChaosWeightMapTarget {
    None = 0,
    MaxDistance = 1,
    BackstopDistance = 2,
    BackstopRadius = 3,
    AnimDriveStiffness = 4,
    AnimDriveDamping = 5,
    TetherStiffness = 6,
    EChaosWeightMapTarget_MAX = 7,
};

// Size: 0x44
struct FChaosDestructionEvent {
    /* 0x0000 */ FVector Position;
    /* 0x000c */ FVector Normal;
    /* 0x0018 */ FVector Velocity;
    /* 0x0024 */ FVector AngularVelocity;
    /* 0x0030 */ float ExtentMin;
    /* 0x0034 */ float ExtentMax;
    /* 0x0038 */ int32_t ParticleID;
    /* 0x003c */ float Time;
    /* 0x0040 */ int32_t Type;
};

enum class EDataSortTypeEnum {
    ChaosNiagara_DataSortType_NoSorting = 0,
    ChaosNiagara_DataSortType_RandomShuffle = 1,
    ChaosNiagara_DataSortType_SortByMassMaxToMin = 2,
    ChaosNiagara_DataSortType_SortByMassMinToMax = 3,
    ChaosNiagara_Max = 4,
    ChaosNiagara_Max = 5,
};

enum class EDataSourceTypeEnum {
    ChaosNiagara_DataSourceType_Collision = 0,
    ChaosNiagara_DataSourceType_Breaking = 1,
    ChaosNiagara_DataSourceType_Trailing = 2,
    ChaosNiagara_Max = 3,
    ChaosNiagara_Max = 4,
};

enum class EDebugTypeEnum {
    ChaosNiagara_DebugType_NoDebug = 0,
    ChaosNiagara_DebugType_ColorBySolver = 1,
    ChaosNiagara_DebugType_ColorByParticleIndex = 2,
    ChaosNiagara_Max = 3,
    ChaosNiagara_Max = 4,
};

enum class ELocationFilteringModeEnum {
    ChaosNiagara_LocationFilteringMode_Inclusive = 0,
    ChaosNiagara_LocationFilteringMode_Exclusive = 1,
    ChaosNiagara_Max = 2,
    ChaosNiagara_Max = 3,
};

enum class ELocationXToSpawnEnum {
    ChaosNiagara_LocationXToSpawn_None = 0,
    ChaosNiagara_LocationXToSpawn_Min = 1,
    ChaosNiagara_LocationXToSpawn_Max = 2,
    ChaosNiagara_LocationXToSpawn_MinMax = 3,
    ChaosNiagara_Max = 4,
    ChaosNiagara_Max = 5,
};

enum class ELocationYToSpawnEnum {
    ChaosNiagara_LocationYToSpawn_None = 0,
    ChaosNiagara_LocationYToSpawn_Min = 1,
    ChaosNiagara_LocationYToSpawn_Max = 2,
    ChaosNiagara_LocationYToSpawn_MinMax = 3,
    ChaosNiagara_Max = 4,
    ChaosNiagara_Max = 5,
};

enum class ELocationZToSpawnEnum {
    ChaosNiagara_LocationZToSpawn_None = 0,
    ChaosNiagara_LocationZToSpawn_Min = 1,
    ChaosNiagara_LocationZToSpawn_Max = 2,
    ChaosNiagara_LocationZToSpawn_MinMax = 3,
    ChaosNiagara_Max = 4,
    ChaosNiagara_Max = 5,
};

enum class ERandomVelocityGenerationTypeEnum {
    ChaosNiagara_RandomVelocityGenerationType_RandomDistribution = 0,
    ChaosNiagara_RandomVelocityGenerationType_RandomDistributionWithStreamers = 1,
    ChaosNiagara_RandomVelocityGenerationType_CollisionNormalBased = 2,
    ChaosNiagara_Max = 3,
    ChaosNiagara_Max = 4,
};

// Size: 0x280
class UNiagaraDataInterfaceChaosDestruction : public UNiagaraDataInterface {
    /* 0x0080 */ TSet<AChaosSolverActor*> ChaosSolverActorSet;
    /* 0x00d0 */ EDataSourceTypeEnum DataSourceType;
    /* 0x00d4 */ int32_t DataProcessFrequency;
    /* 0x00d8 */ int32_t MaxNumberOfDataEntriesToSpawn;
    /* 0x00dc */ bool DoSpawn;
    /* 0x00e0 */ FVector2D SpawnMultiplierMinMax;
    /* 0x00e8 */ float SpawnChance;
    /* 0x00ec */ FVector2D ImpulseToSpawnMinMax;
    /* 0x00f4 */ FVector2D SpeedToSpawnMinMax;
    /* 0x00fc */ FVector2D MassToSpawnMinMax;
    /* 0x0104 */ FVector2D ExtentMinToSpawnMinMax;
    /* 0x010c */ FVector2D ExtentMaxToSpawnMinMax;
    /* 0x0114 */ FVector2D VolumeToSpawnMinMax;
    /* 0x011c */ FVector2D SolverTimeToSpawnMinMax;
    /* 0x0124 */ int32_t SurfaceTypeToSpawn;
    /* 0x0128 */ ELocationFilteringModeEnum LocationFilteringMode;
    /* 0x0129 */ ELocationXToSpawnEnum LocationXToSpawn;
    /* 0x012c */ FVector2D LocationXToSpawnMinMax;
    /* 0x0134 */ ELocationYToSpawnEnum LocationYToSpawn;
    /* 0x0138 */ FVector2D LocationYToSpawnMinMax;
    /* 0x0140 */ ELocationZToSpawnEnum LocationZToSpawn;
    /* 0x0144 */ FVector2D LocationZToSpawnMinMax;
    /* 0x014c */ EDataSortTypeEnum DataSortingType;
    /* 0x014d */ bool bGetExternalCollisionData;
    /* 0x014e */ bool DoSpatialHash;
    /* 0x0150 */ FVector SpatialHashVolumeMin;
    /* 0x015c */ FVector SpatialHashVolumeMax;
    /* 0x0168 */ FVector SpatialHashVolumeCellSize;
    /* 0x0174 */ int32_t MaxDataPerCell;
    /* 0x0178 */ bool bApplyMaterialsFilter;
    /* 0x0180 */ TSet<UPhysicalMaterial*> ChaosBreakingMaterialSet;
    /* 0x01d0 */ bool bGetExternalBreakingData;
    /* 0x01d1 */ bool bGetExternalTrailingData;
    /* 0x01d4 */ FVector2D RandomPositionMagnitudeMinMax;
    /* 0x01dc */ float InheritedVelocityMultiplier;
    /* 0x01e0 */ ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType;
    /* 0x01e4 */ FVector2D RandomVelocityMagnitudeMinMax;
    /* 0x01ec */ float SpreadAngleMax;
    /* 0x01f0 */ FVector VelocityOffsetMin;
    /* 0x01fc */ FVector VelocityOffsetMax;
    /* 0x0208 */ FVector2D FinalVelocityMagnitudeMinMax;
    /* 0x0210 */ float MaxLatency;
    /* 0x0214 */ EDebugTypeEnum DebugType;
    /* 0x0218 */ int32_t LastSpawnedPointID;
    /* 0x021c */ float LastSpawnTime;
    /* 0x0230 */ float SolverTime;
    /* 0x0234 */ float TimeStampOfLastProcessedData;
};

// Size: 0x80
class UNiagaraDataInterfacePhysicsField : public UNiagaraDataInterface {
};

// Size: 0x78
class UActorFactoryChaosSolver : public UActorFactory {
};

// Size: 0x88
class UChaosSolverFactory : public UFactory {
};

// Size: 0x50
struct FBreakEventCallbackWrapper {
};

// Size: 0x30
struct FChaosBreakEvent {
    /* 0x0000 */ UPrimitiveComponent* Component;
    /* 0x0008 */ FVector Location;
    /* 0x0014 */ FVector Velocity;
    /* 0x0020 */ FVector AngularVelocity;
    /* 0x002c */ float Mass;
};

// Size: 0xd8
class UChaosDebugDrawComponent : public UActorComponent {
};

// Size: 0x18
struct FChaosDebugSubstepControl {
    /* 0x0000 */ bool bPause;
    /* 0x0001 */ bool bSubstep;
    /* 0x0002 */ bool bStep;
};

// Size: 0xc8
class UChaosEventListenerComponent : public UActorComponent {
};

// Size: 0x280
class UChaosGameplayEventDispatcher : public UChaosEventListenerComponent {
    /* 0x01d8 */ TMap<UPrimitiveComponent*, FChaosHandlerSet> CollisionEventRegistrations;
    /* 0x0228 */ TMap<UPrimitiveComponent*, FBreakEventCallbackWrapper> BreakEventRegistrations;
};

// Size: 0x58
struct FChaosHandlerSet {
    /* 0x0008 */ TSet<UObject*> ChaosHandlers;
};

// Size: 0x30
class IChaosNotifyHandlerInterface : public UInterface {
};

// Size: 0x70
struct FChaosPhysicsCollisionInfo {
    /* 0x0000 */ UPrimitiveComponent* Component;
    /* 0x0008 */ UPrimitiveComponent* OtherComponent;
    /* 0x0010 */ FVector Location;
    /* 0x001c */ FVector Normal;
    /* 0x0028 */ FVector AccumulatedImpulse;
    /* 0x0034 */ FVector Velocity;
    /* 0x0040 */ FVector OtherVelocity;
    /* 0x004c */ FVector AngularVelocity;
    /* 0x0058 */ FVector OtherAngularVelocity;
    /* 0x0064 */ float Mass;
    /* 0x0068 */ float OtherMass;
};

// Size: 0x30
class UChaosSolver : public UObject {
};

// Size: 0x408
class AChaosSolverActor : public AActor {
    /* 0x02f8 */ FChaosSolverConfiguration Properties;
    /* 0x0360 */ float TimeStepMultiplier;
    /* 0x0364 */ int32_t CollisionIterations;
    /* 0x0368 */ int32_t PushOutIterations;
    /* 0x036c */ int32_t PushOutPairIterations;
    /* 0x0370 */ float ClusterConnectionFactor;
    /* 0x0374 */ EClusterConnectionTypeEnum ClusterUnionConnectionType;
    /* 0x0375 */ bool DoGenerateCollisionData;
    /* 0x0378 */ FSolverCollisionFilterSettings CollisionFilterSettings;
    /* 0x0388 */ bool DoGenerateBreakingData;
    /* 0x038c */ FSolverBreakingFilterSettings BreakingFilterSettings;
    /* 0x039c */ bool DoGenerateTrailingData;
    /* 0x03a0 */ FSolverTrailingFilterSettings TrailingFilterSettings;
    /* 0x03b0 */ float MassScale;
    /* 0x03b4 */ bool bGenerateContactGraph;
    /* 0x03b5 */ bool bHasFloor;
    /* 0x03b8 */ float FloorHeight;
    /* 0x03c0 */ FChaosDebugSubstepControl ChaosDebugSubstepControl;
    /* 0x03d8 */ UBillboardComponent* SpriteComponent;
    /* 0x03f8 */ UChaosGameplayEventDispatcher* GameplayEventDispatcherComponent;

    void SetAsCurrentWorldSolver();
    void SetSolverActive(bool bActive);
};

// Size: 0x30
class UChaosSolverEngineBlueprintLibrary : public UBlueprintFunctionLibrary {

    static FHitResult ConvertPhysicsCollisionToHitResult(const FChaosPhysicsCollisionInfo& PhysicsCollision);
};

// Size: 0x88
class UChaosSolverSettings : public UDeveloperSettings {
    /* 0x0068 */ FSoftClassPath DefaultChaosSolverActorClass;
};

enum class EClusterConnectionTypeEnum {
    Chaos_PointImplicit = 0,
    Chaos_DelaunayTriangulation = 1,
    Chaos_MinimalSpanningSubsetDelaunayTriangulation = 2,
    Chaos_PointImplicitAugmentedWithMinimalDelaunay = 3,
    Chaos_None = 4,
    Chaos_EClsuterCreationParameters_Max = 5,
    Chaos_MAX = 6,
};

// Size: 0xc
struct FCameraFilmbackSettings {
    /* 0x0000 */ float SensorWidth;
    /* 0x0004 */ float SensorHeight;
    /* 0x0008 */ float SensorAspectRatio;
};

// Size: 0x60
struct FCameraFocusSettings {
    /* 0x0000 */ ECameraFocusMethod FocusMethod;
    /* 0x0004 */ float ManualFocusDistance;
    /* 0x0008 */ FCameraTrackingFocusSettings TrackingFocusSettings;
    /* 0x0048 */ bool bDrawDebugFocusPlane;
    /* 0x004c */ FColor DebugFocusPlaneColor;
    /* 0x0050 */ bool bSmoothFocusChanges;
    /* 0x0054 */ float FocusSmoothingInterpSpeed;
    /* 0x0058 */ float FocusOffset;
};

// Size: 0x18
struct FCameraLensSettings {
    /* 0x0000 */ float MinFocalLength;
    /* 0x0004 */ float MaxFocalLength;
    /* 0x0008 */ float MinFStop;
    /* 0x000c */ float MaxFStop;
    /* 0x0010 */ float MinimumFocusDistance;
    /* 0x0014 */ int32_t DiaphragmBladeCount;
};

// Size: 0x58
struct FCameraLookatTrackingSettings {
    /* 0x0000 */ bool bEnableLookAtTracking;
    /* 0x0000 */ bool bDrawDebugLookAtTrackingPosition;
    /* 0x0004 */ float LookAtTrackingInterpSpeed;
    /* 0x0018 */ TSoftObjectPtr<AActor> ActorToTrack;
    /* 0x0048 */ FVector RelativeOffset;
    /* 0x0054 */ bool bAllowRoll;
};

// Size: 0x348
class ACameraRig_Crane : public AActor {
    /* 0x02f8 */ float CranePitch;
    /* 0x02fc */ float CraneYaw;
    /* 0x0300 */ float CraneArmLength;
    /* 0x0304 */ bool bLockMountPitch;
    /* 0x0305 */ bool bLockMountYaw;
    /* 0x0308 */ USceneComponent* TransformComponent;
    /* 0x0310 */ USceneComponent* CraneYawControl;
    /* 0x0318 */ USceneComponent* CranePitchControl;
    /* 0x0320 */ USceneComponent* CraneCameraMount;
    /* 0x0328 */ UStaticMeshComponent* PreviewMesh_CraneArm;
    /* 0x0330 */ UStaticMeshComponent* PreviewMesh_CraneBase;
    /* 0x0338 */ UStaticMeshComponent* PreviewMesh_CraneMount;
    /* 0x0340 */ UStaticMeshComponent* PreviewMesh_CraneCounterWeight;
};

// Size: 0x348
class ACameraRig_Rail : public AActor {
    /* 0x02f8 */ float CurrentPositionOnRail;
    /* 0x02fc */ bool bLockOrientationToRail;
    /* 0x02fd */ bool bShowRailVisualization;
    /* 0x0300 */ float PreviewMeshScale;
    /* 0x0308 */ USceneComponent* TransformComponent;
    /* 0x0310 */ USplineComponent* RailSplineComponent;
    /* 0x0318 */ USceneComponent* RailCameraMount;
    /* 0x0320 */ USplineMeshComponent* PreviewMesh_Rail;
    /* 0x0328 */ TArray<USplineMeshComponent*> PreviewRailMeshSegments;
    /* 0x0338 */ UStaticMesh* PreviewRailStaticMesh;
    /* 0x0340 */ UStaticMeshComponent* PreviewMesh_Mount;

    USplineComponent* GetRailSplineComponent();
};

// Size: 0x40
struct FCameraTrackingFocusSettings {
    /* 0x0000 */ TSoftObjectPtr<AActor> ActorToTrack;
    /* 0x0030 */ FVector RelativeOffset;
    /* 0x003c */ bool bDrawDebugTrackingFocusPoint;
};

// Size: 0x930
class ACineCameraActor : public ACameraActor {
    /* 0x08c0 */ FCameraLookatTrackingSettings LookatTrackingSettings;

    UCineCameraComponent* GetCineCameraComponent() const;
};

// Size: 0x980
class UCineCameraComponent : public UCameraComponent {
    /* 0x0858 */ FCameraFilmbackSettings FilmbackSettings;
    /* 0x0864 */ FCameraFilmbackSettings Filmback;
    /* 0x0870 */ FCameraLensSettings LensSettings;
    /* 0x0888 */ FCameraFocusSettings FocusSettings;
    /* 0x08e8 */ float CurrentFocalLength;
    /* 0x08ec */ float CurrentAperture;
    /* 0x08f0 */ float CurrentFocusDistance;
    /* 0x08f4 */ float CurrentHorizontalFOV;
    /* 0x0900 */ UStaticMesh* FocusPlaneVisualizationMesh;
    /* 0x0908 */ UMaterial* FocusPlaneVisualizationMaterial;
    /* 0x0910 */ UStaticMeshComponent* DebugFocusPlaneComponent;
    /* 0x0918 */ UMaterialInstanceDynamic* DebugFocusPlaneMID;
    /* 0x0920 */ TArray<FNamedFilmbackPreset> FilmbackPresets;
    /* 0x0930 */ TArray<FNamedLensPreset> LensPresets;
    /* 0x0940 */ FString DefaultFilmbackPresetName;
    /* 0x0950 */ FString DefaultFilmbackPreset;
    /* 0x0960 */ FString DefaultLensPresetName;
    /* 0x0970 */ float DefaultLensFocalLength;
    /* 0x0974 */ float DefaultLensFStop;

    FString GetDefaultFilmbackPresetName() const;
    FString GetFilmbackPresetName() const;
    static TArray<FNamedFilmbackPreset> GetFilmbackPresetsCopy();
    float GetHorizontalFieldOfView() const;
    FString GetLensPresetName() const;
    static TArray<FNamedLensPreset> GetLensPresetsCopy();
    float GetVerticalFieldOfView() const;
    void SetCurrentFocalLength(float InFocalLength);
